[{"reviewerID": "AYB4ELCS5AM8P", "asin": "B00KI00FU2", "reviewerName": "John B. Goode \"JBG\"", "helpful": [0, 0], "reviewText": "This is a very nice water resistant speaker. It has a white plastic shell and has a few colored rubber parts. I chose a green one and it looks superb. I use this speaker when I'm in the shower and it works great. It has gotten wet many many times and has not short circuited. I have not completely submerged it because it's only water resistant, not water proof. It's surprisingly loud for such a small speaker. You can take calls with it but I don't think I will be taking calls while I'm in the shower. The suction cup on it is extremely useful and sticks onto a lot of surfaces in my bathroom. It's a great speaker that I would definitely get for a friend or relative. I received this product as a review sample.", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "A35Q0RBM3YNQNF", "asin": "B00KI00FU2", "reviewerName": "M. Hill", "helpful": [0, 0], "reviewText": "Out of the box, it took 30 minutes to charge the built-in lithium battery using the included USB cable. The User Manual is clear and brief with logical steps detailed to pair the speaker with phone or other Bluetooth capable devices like an iPod, iPad, etc. A short press of the plus or minus sign increases or decreases volume, while a long press either moves the song selection forward or back. A clicking noise is heard to alert the user when maximum volume is reached.  Pressing the phone icon button permits incoming calls to be answered.For a small speaker the performance is surprisingly good. Optimal sound resides in the upper and mid range with bass a bit weak -- with nothing sounding distorted even at maximum volume. The speaker works up to thirty feet from the device to which it is paired, and will run for four hours per battery charge. While in the shower, I tested it both with my phone and iPod and the sound was clear even above the noise of the water running, and I could easily carry on a conversation with the caller, although they thought it was weird when I told them I was speaking from the shower.The speaker has a large suction cup on the back which I stuck to the shower wall, out of the direct path, but next to the water stream. Water was definitely splashed on the device the entire time I was in the shower. It adhered securely, and stayed firmly attached to the tile even while control buttons were pushed multiple times. The silicone face of the unit provided a relatively non-slip texture when wet so no undue pressure was necessary to change songs or adjust volume.Water resistant with an IPX4 rating, which means the speaker should be able to withstand being splashed from all angles for at least five minutes but it should not be submerged in water. As I noted above, it was splashed on for a good ten minutes while I tested the music and phone capabilities without any problems.Small, attractive, and it did everything it promised.Sample provided without obligation.", "overall": 5.0, "summary": "AQUACUBE - URGE Basics Water Resistant Shower Speaker", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KI00FU2", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [1, 1], "reviewText": "Over the past year I have reviewed nearly a dozen waterproof bluetooth speakers and all seemed to fall short in one or more categories. The review sample that I received for this one is actually a vast improvement over the other ones.The biggest reason I like this one is you can actually hear it in a shower. The other ones I have tried sounded good on their own, but the minute you turned on a shower that noise drowned out the music I was trying to play. This one is loud enough to cut through that,Another feature that this has that the older ones lacked is it goes into pairing more as soon as you power it up. In fact, a female voice announces the fact. All of the other waterproof speakers I have tried required you to hold down a multifunction button for a set number of seconds, then scan for it from your phone. This one is so simple to pair with and connect to that you do not need the instruction sheet that comes with it.One final thing that distinguishes this one from the others is the large suction cup that will hold it firmly to a tiled (or any smooth) surface. Believe me, it will hold the speaker like glue.Music quality is surprisingly good. The speaker's frequency response across the high, low and mid ranges did an excellent job of playing my favorite test album (Miles Davis'Kind Of Blue) and I could hear every nuance. Considering that this speaker is encased in sound deadening rubber makes me wonder how much better it would sound in a non-waterproof form factor.At the time of this review the product description on this page claims that you can get four hours of play time on a completely charged speaker. The instructions claim ten, and I've had mine running for nearly six hours as I write this review and it's still going strong. It takes about three hours to fully charge it out of the box.Bottom line: this waterproof speaker is the only one that I've tested that I can recommend without reservations.", "overall": 5.0, "summary": "Vast improvement over other waterproof BT speakers", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00KI00FU2", "reviewerName": "Nuknuk", "helpful": [0, 0], "reviewText": "The Urge Basics Aquacube is smaller than a bathroom tile.  It has some candy charm (I have the white with lime green accent) by the way it looks.Pairing:Pairing is simple. Just turn it on and it will start looking for a device.  I didn't have to punch in a password but if it asked for one, type in \"0000\".The suction cup is very flexible and really sucks. I have no worries that it won't stay put.It comes with a microUSB cable for charging the Bluetooth player. The USB port is covered with a silicone plug to avoid getting wet.  LED is red when charging and disappears when fully charged.  All the other button controls are  sealed.Controls are simple like the - and + for volume. The middle button for pause and play.  Phone icon for answering calls and the power button symbol is on the top.  To go to the next song, you need to press and hold the + button until it the music stop and play the next song.  Same thing for - for previous.Finally the audio. Audio is loud and fine for a speaker of this type.  Don't expect much bass.  Also great to play NPR while in the shower.Cons:- Announcement (when you turn it on, pair, etc.) is scandalously loud.  On the other hand, this is an advantage if you are in the shower.  Too loud, if for some reason you want to play it in the office environment.- very little bassA sample of this product was sent to me for review purposes.", "overall": 4.0, "summary": "Showermate", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
,{"reviewerID": "A1CMD08Z49PGKQ", "asin": "B00KI00FU2", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "Place it in the shower and stream your tunes.  As we all know....we sound good in the shower.I however like this better on the boat.  Place it on the windshield and you have your own personal speaker.It really does have a good sound to it.  Since I got it for free for writing this review I decided to test it out.Recipe: Take one urge basics and drop it into one bag of fish. Leave it in water for a few minutes.  I took it out and did let it dry out for about half an hour.Place back on windshield.  Guess what.  It still worked.  So it is water resistant/repellant.  amazing little thing.", "overall": 5.0, "summary": "Better sound that anticipated.  IS water resistant.", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "ARBKYIVNYWK3C", "asin": "B00KI00FU2", "reviewerName": "RST10", "helpful": [0, 0], "reviewText": "I have been on a quest for a shower speaker, and I thought I had one in the past. It was labeled &#34;water proof&#34; when in fact it was also water resistant and they did not recommend it for shower use.When I opened this, I was surprised at the small size. Don't let the size fool you-- the sound is big! The sound projects out the back and uses the shower wall as an amplifier. It is quite surprising.It is very easy to use and in fact I didn't need to reference the instructions.  After charging I was able to pair and use it with no issues. There is a voice that tells you what's going on, and what to do when you are pairing to your phone. It also shows on my phone how much battery life is left in the unit.I would have no hesitations recommending this device, it works very well and I couldn't be more pleased.By a lot of hard hours and days and years of time spent reviewing, I found myself in the top 10 reviewers on Amazon. This wasn't a goal or self promotion, but by nose-down focused reviewing. I occasionally get contacted by manufacturers or sellers who appreciate my way of reviewing and ask if I'll consider reviewing a product for them, with no obligation or cost. This is one of those products. I assure you that I review what I want, when I want, how I want, in order to share what I feel is the most accurate useful information.", "overall": 5.0, "summary": "Simple, loud, effective, space saving", "unixReviewTime": 1403308800, "reviewTime": "06 21, 2014"}
,{"reviewerID": "A3IL4WNBMGBJRY", "asin": "B00KJ0K9JI", "reviewerName": "Brian Smith \"Tough But Fair\"", "helpful": [4, 5], "reviewText": "There are many of these portable batteries on the market now and I think I own most of them.  I have received several at no charge in exchange for my honest review, including this one. This is my second favorite.  It's good, but not the best.If you're going to get a portable battery, forget the \"lipstick\" models.  Make sure you get one that has a power gauge on it.  Since you are likely to use the device infrequently, you want to be able to check how much of a charge it has on it before you walk out the door. Once you've charged your device, you will want to know if you can get another charge out of it.  And, if you have a tablet, you're going to need a high capacity port (2A) and a decent size battery to charge it.  Don't waste your money on the smaller, lower capacity devices.The LifeCharge JuicyPack has everything you need to get the job done, with one exception I'll cover later.  It has a four light battery gauge so you can tell how much juice you have left within 25%.  It has two ports for charging your device and one port (micro USB) for charging it. It comes with a micro USB cable.  It includes a flashlight (because why not?).The reasons why it's my second favorite charger right now?  Well, one is the price. It's a bit expensive as this field has become competitive and prices have plummeted.  The battery light indicators are nice and were the standard.  That is until the one I just received that has an LED display that shows the exact percentage of battery left in a digital read out as opposed to a few lights.  That's not really necessary, but it is nice. The biggest reason this is number two for me is almost none of these devices come with a lightning connector, and I have an iPhone and an iPad. For me to use this, means I have to carry two cables with me- the micro USB cable to charge it and a lightning cable to charge my device.  One manufacturer has finally figured this out and includes a lightning cable with their unit.  If you're an Apple guy like me, I would recommend that one.  It's cheaper, the battery gauge is nicer and you don't need to carry two cables.  If you're not an Apple guy or gal, this one will certainly do, but you can probably find one for less money.  Overall, this is a nice product and could be a lifesaver in a tough spot.", "overall": 3.0, "summary": "Pretty nice high capacity battery, but not the best", "unixReviewTime": 1402963200, "reviewTime": "06 17, 2014"}
,{"reviewerID": "A1U5XB6PCIDLIK", "asin": "B00KJ0K9JI", "reviewerName": "Dennis Waller", "helpful": [0, 0], "reviewText": "I worked in the field and require power for all the devices I use. Sometimes, I'll be miles from any power source and need backup external batteries that I can depend on. The external battery packs by Lifecharge have never let me down. In addition their versatility is as important as they work with all my devices, from cameras, laptop, to iPhones. The 10400 is powerful enough for the most demanding devices.Tough, rugged, durable are just a few of the words I can use to describe the device besides delivering the power when I need it the most. As an Author and Indie film maker, it is critical to have these on hand when working in the field and can testify that the battery packs by Lifecharge deliver when it counts", "overall": 5.0, "summary": "An Excellent Device that Delivers", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "A18U49406IPPIJ", "asin": "B00KJ0K9JI", "reviewerName": "Deon", "helpful": [0, 0], "reviewText": "This battery pack might be fit in your pocket, but big enough energy to power any mobile devices.Having a 10,400mAh battery places this battery pack in the upper range of battery packs. There is enough power to charge most cell phones multiple times. I use it to charge my Note 2 and get almost four full charges.The size is very portable and can be easily slipped into a pocket or purse.The layout is very clean and simple with no moving parts. The design is great with two complementing colors of blue and white. In the hand, it has a very solid feel, nice and sturdy. The size is similar to a deck of playing cards.This battery will do the job to charge whatever you throw at it, and does it well. The best part is how portable and powerful it is.I was supplied a sample for the purpose of review.", "overall": 5.0, "summary": "Powerful & Portable", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
,{"reviewerID": "A36K2N527TXXJN", "asin": "B00KJ0K9JI", "reviewerName": "Dr. Bojan Tunguz", "helpful": [0, 0], "reviewText": "The bottom line on the LifeCHARGE battery is this: it works. In the past I've tried several different reserve power supplies for my gadgets, and I have had mixed results. However, there is no ambiguity about this battery: it's large, effective, versatile and well designed. It's one of the largest external battery that I've come across in terms of capacity (with impressive 10,400 mAh of charge), and yet it's much smaller in size than some of its larger near-competitors.In order to test this battery charger I decided to completely drain my small electronic devices so that I get as clean of an idea of this battery's efficiency as I can. (As an aside, when you really want to discharge them, the consumer electronics has become really robust in recent year. It took me much longer than I thought it would. I had to blast music from my iPhone for hours and hours ...) I discover that I was able to fully charge all of my small electronic devices with plenty of power to spare. Most of them I was able to charge several times, and thanks to dual USB ports, was able to charge up to two devices at once. Full charging usually takes between one to two hours. I've tested this battery with iPhone 4S, iPhone 3G, Kindle Keyboard, Mobee Magic Bar, Jabra SPORT Bluetooth Stereo Headset, and the first generation iPad (32GB, Wifi + 3G). Oftentimes I was able to fully charge four or five devices with just one fully charged LifeCHARGE battery. I was also able to charge my iPad to completely, and even charge it to almost half its capacity the second time around. If there was an easy way of connecting this battery to an ultrabook I would not be surprised if it would be possible to charge it to a decent amount as well.The battery comes with a micro USB cable that allows you to charge it by either connecting it to a computer or a stand-alone USB charger. I think this would have been a much more effective product if it had two additions that some of its competitors already incorporate into their batteries/power banks: incorporated wall-outlet prongs for easy charging, and a permanently attached retractable micro USB cable. These two additions would make this battery stand out in the already very crowded field of external batteries/chargers.**** Product provided for review purposes. ****", "overall": 5.0, "summary": "Capacious, Elegant and Portable External Battery", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
,{"reviewerID": "A2DG63DN704LOI", "asin": "B00KJ0K9JI", "reviewerName": "ESlayd", "helpful": [0, 0], "reviewText": "If you're like me, you don't pay too much attention to the measurements of things you buy. I'm a pretty smart guy, but when buying things like this, I usually just go by sight by looking at the provided photo. Sometimes this lack of investigating leads me to something too big (i.e. all-in-one printer), but here's what I found out when I received this: it's pretty small. Roughly the size of a pack of cigarettes, only slightly thinner. This is actually a good thing... no, a GREAT thing. For the most part, a battery really is just a battery, but if you can get one in a small package, then you're golden. And I am here to report that this one is small for its WHOPPING 10400 Mah capacity.I also like that it has LED indicators, which is helpful since I never remember which one of my packs is full.[sample provided for an honest review]", "overall": 5.0, "summary": "Smaller than expected! Pleasant surprise!", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "AT53ZTTO707MB", "asin": "B00KJ0K9JI", "reviewerName": "I Do The Speed Limit", "helpful": [0, 0], "reviewText": "This battery charger / power bank has enough juice to re-charge several devices. So, if you are heading out and there's a chance that you won't see a wall outlet or car charger for quite a while, or if you are in &#34;charge&#34; of charging the whole family's devices on a trip, this is a charger that will get the job done. No bells, no whistles, except for a flashlight feature and four LEDs to give you charging status. But then, you are not paying for any features that you won't use, either.One feature that a 5-star, simple, convenient charger would have (and this four-star charger does not have) is a built-in USB cable. With this portable charger, you will still have to lug around a cable or two. Too bad: A rubber band does the trick and will keep your cables and charger together, but is so un-cool.This charger has four bright blue LEDs to give you status of the charge. Unlike aluminum-cased battery chargers, you can see the light of the LEDs right through this thin-walled plastic case, so more than the four lights light up: You get a blotchy light effect from inside the case.This unit weighs in at a little more than a half pound. So, think hard if you really need a power bank that provides this much charge. While it is necessary for long trips or lots of devices, if you only need to charge your one phone once in a while, this is overkill. Overkill is definitely a problem when it comes to chargers: A half pound is real weight. Do you need it? Or can you get by with a 2600mAh lipstick-size charger that will fit in your pocket and will charge up your one phone one time.For those of you who do not like in-your-face logos marring the fronts of your possessions: Notice that the Lifecharge logo is very big and bold and black and centered. It definitely detracts from the simple lines and the look of this design, and the black ink on the bright blue plastic cheapens the look.One thing I noticed that was interesting--and may be why different people get different test charge results: I charged it up the first time, until I got.the blue fully-charged light, then unplugged it, but did not use it. Plugged it in a few hours later, and it showed a red not-fully-charged light. So I left it plugged and in an hour it showed blue again. I unplugged it and did not use it.until the next day. I checked the charge, and it still showed blue. So, for some reason, when charging for the first time, it did not accept a 100% charge. The second time it did. I'm no electrical engineer, so I don't know why. It happened with the Lifecharge 2600mAh that I've been working with, too.*I received a sample product from Lifecharge.", "overall": 4.0, "summary": "Basic, simple charger does what it claims to do", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A1M1Y5UGONAW06", "asin": "B00KJ0K9JI", "reviewerName": "Jody", "helpful": [1, 2], "reviewText": "This portable charger is the real deal.  It's businesslike, sturdy, and best of all, does exactly what it says it will.  I received a sample for review, but would not hesitate to purchase one.  Except for Vine products, I don't review samples unless they're great.This external battery is big.  It won't get lost in your carry on.  It takes about five hours to charge, so foresight is necessary, but it's good to go for at least a couple of complete charges.  I've used it with both my iPad and Kindle DX, and it took a couple of hours to charge from less than 20% to above 80%.  That's the same as using a wall plug.There are four blue lights that flash while the unit is charging.  As it charges, the lights stop flashing as quarter levels are reached.  In addition there are indicator lights to show when the devices being charged are powered up.  You always know how much juice is left in the charger, which is invaluable if you've every had one Odeon you without warning.You should know that the Lifecharge Juicypack does not come with a wall charger.  All that's in the box are the unit and a USB connector.  That's certainly not a problem for me--I could macrame a hammock out of all the superfluous cables around my house--but it's something you should know.A battery backup is essential if you're dependent on your electronic devices.  My experience with Lifecharge is that their products are well made and dependable.  This one is no exception.", "overall": 5.0, "summary": "Heavy duty backup", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "AYB4ELCS5AM8P", "asin": "B00KJ0K9JI", "reviewerName": "John B. Goode \"JBG\"", "helpful": [0, 0], "reviewText": "This is a high powered external battery charger with 10400mAh and dual charging ports. I received this as a review sample. The two charging ports are 1.0A and 2.0A which means you can charge a large device and a small one or two small ones. It comes with your usual circuit protection that protects against over-charging and other damage to your device. It also has a small LED flashlight (dual beams). Overall, what I like about it is that it's small and handy and holds 10400mAh in capacity. With this much charging power you can charge your phone 3x over assuming a 75% efficiency rate and your iPad once. Recommended.", "overall": 5.0, "summary": "Nice!", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
,{"reviewerID": "A2R1HUYHXV7H18", "asin": "B00KJ0K9JI", "reviewerName": "Kristi Gilleland", "helpful": [0, 0], "reviewText": "I have had absolutely no problems with my LifeCharge. I charged mine from the wall - I've got a wall charger that the usb cable comes with - it doesn't come with the wall charge component though - it would be very nice if it did. If you don't have a wall to usb plug, then you charge it using any usb port.It has 4 lights that each show 25%. When it is fully charged, they all light up.It charges a number of devices. I've been using it on my Kindle Fire, Apple I-phone 3gs, and my HTC One X. I like to binge watch tv while I work with my Kindle Fire propped in front of the PC. Using the LifeCharge, I was able to watch 10 straight hours of a TV show I was binging on without having to worry about running out of power. By the time I quit, the LifeCharge was empty but I STILL had a full charge on the Kindle, so I could have probably watched another couple of hours.Just make sure when you are ready to use a device, that you do turn the power ON. There's a little button on the side. It also has a LED flashlight that comes in handy.It's not heavy - it only weighs a few ounces, so it is fine to carry in my purse. The blue color is as shown. It's easy to hold; it fits well in my palm as it is narrow enough to grip ok.  It is wide, but the company also offers a lipstick size if this is a concern.My only complaint is rather minor - the blue indicator lights are VERY bright, so if you are charging it while sleeping, it can bug you. The first night I found I had to get up and position it with the lights against the wall. I made the mistake of looking right at those blue lights for a few seconds, and I got a bit of an after image for a while. I think they are too bright.It does charge well.  For instance, I had a bluetooth speaker that had 25% charge on it.  We wanted to watch a movie outside so I plugged my Juicypack into my speaker, and we watched 2 full movies and one tv series without the speaker ever going dead.  When I brought the speaker in, I noticed it still was nearly charged, though the Juicypack was depleted.I was given a sample in order to provide an honest review. I do like this product. It's nice to get so many more hours of charge time on my favorite device.", "overall": 4.0, "summary": "Very convenient, with lots of extra play time on my devices", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A1UQBFCERIP7VJ", "asin": "B00KJ0K9JI", "reviewerName": "Margaret Picky", "helpful": [0, 0], "reviewText": "This power bank has a large 10,400 mAh nominal capacity that will recharge most smartphones or Kindle Paperwhites five or six times and provide almost a complete recharge to a power-hungry tablet like the 8,820 mAh iPad Air.  It has two charging ports, one each at 2.1 A and 1.0 A, to quickly charge two electronic devices at the same time.There is a four-LED indicator for charging and remaining capacity.  It also has a handy dual-LED flashlight that is quite bright, very useful in emergencies or just for finding a dropped key in the dark.  A good quality USB cable and legible instruction manual are also included.I suggest using a USB wall adapter or a charging hub to refill this power bank because of the large capacity, as it will be much faster than most all USB ports on electronic devices.LifeCHARGE provided a Juicypack for evaluation and review.", "overall": 5.0, "summary": "High-capacity power bank with flashlight", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KJ0K9JI", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [0, 0], "reviewText": "There are some excellent reviews already posted that completely describe this battery. I will avoid repeating the physical characteristics and provide my own observations and experiences with the review sample that I received.This battery pack has the capacity to satisfy most power users who are glued to their phone. It will also provide a respectable margin of additional use time for the true geeks who are constantly glued to both a smart phone and a tablet. For that breed of power user even the 10400mAh capacity this provides may not be enough, but for ninety-nine percent of us this is more than ample.Before proceeding I want to disclose that I always multiply new battery packs by .9 to get a more realistic capacity. That's because there are some losses in efficiency from heat, the transfer process, condition of your charging cable and myriad other factors. Using my quick formula you can expect about 9360mAh from this battery.Even at the readjusted capacity you can expect some significant increases in use time. An Apple iPhone 5S with a stock 1560mAh battery will get an additional six hundred percent of use time attached to this. An iPad 2 with a stock 6930mAh battery will get slightly more than double its normal use time. Of course plugging two devices into this battery will alter the effective use time increases, but some very simple math will let you forecast how much.I tested this with a few devices, including an iPhone 5S, iPad 2, Samsung Galaxy Note 3 and Samsung Tab 3 10.1. In all cases I connected two devices simultaneously (Apples first, then the Samsungs) and the charging rate from this battery was slightly less than if I plugged each device individually into their respective OEM wall chargers. That's actually pretty impressive.Note that the instructions claim that you can charge this battery from a PC's USB port. I tried that on my ThinkPad T61 and it was extremely show compared to one of my Samsung wall chargers to which I connected it. This is more of a problem with my ThinkPad than the battery, but I wanted to point that out to set expectations.Bottom line: this battery pack is solid, reliable and has more than enough capacity for all but true power users. Mine is actually connected to the tablet on which I am writing this review - I trust it that much.", "overall": 5.0, "summary": "For power users", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00KJ0K9JI", "reviewerName": "Nuknuk", "helpful": [0, 0], "reviewText": "It gives me spare juice wherever I need it for my phone and iPads. Sometimes it is more convenient to have my iPad plugged into it while I am in the bed or couch where no wall outlet is nearby. I am also weary of some car chargers ruining my Lightning cables with the inrush current when I start my car ignition (not proven but a hunch), and so I am more comfortable plugging to a battery pack.The 4 LEDs represent the remaining charge from your battery pack. There are 2 white LEDs for use as a flashlight. Two double quick presses to turn it on and off. It alternates from turning on one LED and 2 LEDs in cycle. They are regular LEDs and not the super bright type but still quite welcomed for emergency situations.Overall, it is a fine product though nothing exceptional from other power banks so I am rating it a solid 4 stars.Quick specs:- 10,400 mAh- dual USB slots (One 2.1A for iPad and tablets and one 1A for smartphones)- 2 flashlight LEDs- microUSB charging (cable included)A sample of this product was sent to me for review purposes.", "overall": 4.0, "summary": "Good charger", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
,{"reviewerID": "A1CMD08Z49PGKQ", "asin": "B00KJ0K9JI", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "Ten charge and discharge cycles.  Charges over night.  Not sure how long it really takes.  Provides a good emergency battery backup that will take your iPad Retina full size up from 30% to 80% during usage of a little over two hours.I did not try and be as technical with this one as I have with others.  Many of these devices offer up the same charge capability.  So it comes down to how you personally use such things.  If you have two devices to charge you are given a 1A and a 2A.  I did try this with my iPad and my nexus.......it did keep both going even though I drained both to around 20%.  With this I achieved way over an hour of use on both......I have noticed that when left unused it will loose some of it's charge so you will want to plug it in a few hours before you leave to insure full usage.The flashlight is nice.......push the power button twice and on it goes.....nice when trying to find something in your backpack or gadget bag.I was presented with one of these for free.", "overall": 5.0, "summary": "Capable, multi function, flashlight= a good choice for your portable power needs.", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "AQ2FC1DLKVD8H", "asin": "B00KJ0K9JI", "reviewerName": "P. McWhorter", "helpful": [0, 0], "reviewText": "I find that many smartphones can not make it through a full day of heavy use without running out of battery. If you work near an outlet this is not an issue but if you are on the go, nothing is worse than a dead phone and no way to recharge. This LifeCharge battery is just the ticket for those needing insurance that they can make it through the day without a dead phone or tablet battery.This unit is rated at 10,400 mAh, which means at five volts it can provide 1 amp of current for ten hours. The bottom line is this is lots of charging capacity. It should be able to fully recharge two dead smartphones, or 1 tablet with power to spare.The unit will charge anything that you would normally charge through a computer USB. It is neat in that it will work for a variety of brands . . . iphones, ipads, droids or windows tablets.I have been pleased with this battery unit.(NOTE: I was provided a sample for review purposes)", "overall": 5.0, "summary": "Never Get Caught with Dead Phone Again", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A2NOW4U7W3F7RI", "asin": "B00KJ0K9JI", "reviewerName": "rpv", "helpful": [1, 2], "reviewText": "Lifecharge Juicypack 10400 mAH portable charger comes in a very compact design for everyday travel. You can charge two devices at the same time.I tried charging- Samsung Galaxy S4 phones- Samsung Galaxy Tab 4- Olympus Voice Recorder- A 4.5&#34; SmartphoneThe microUSB is used to charge this powerbank and the USB itself to charge other devices. The charge will hold enough to power a Samsung Galaxy S4 nearly 4 times.I tried charging Samsung from no charge to 100% and following is time it took approximately for each of 10 minutes. (using only one port)10% = 7 minutes20% = 7 min30% = 8 min40% = 9 min50% = 11 min60% = 12 min70% = 12 min80% = 14 min90% = 16 min100% = 19 minThis device is great for taking to camping trips/any long distance travel/flight trips and many similar use cases. Sample provided for a fair and honest review.", "overall": 5.0, "summary": "Compact and Powerful!", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
,{"reviewerID": "A2NB2E5DXE319Z", "asin": "B00KJ0K9JI", "reviewerName": "S. Lionel", "helpful": [0, 1], "reviewText": "The Lifecharge Juicepack 10400 mAh charger is fairly typical of its type, with two USB power outlets and MicroUSB charging. In addition to the four, fairly bright charge status lights, it also offers two white LEDs which can illuminate, serving as sort of a flashlight, if you want. They aren't very bright. The manufacturer sent me the charger and asked for a review.Though the USB outlets are labeled as 2A and 1A, I found that they both charged my iPad at about 5 watts (1A), according to my PracticalMeter. A 2.1A wall charger delivered about 7 watts at the same charge level.The Juicypack isn't any larger than it needs to be, and isn't fancy, but it gets the job done, and it has a much larger capacity than most other battery packs.", "overall": 4.0, "summary": "Lots of capacity, charges two devices at once", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A3NEAETOSXDBOM", "asin": "B00KJ0K9JI", "reviewerName": "Stephen M. Charme", "helpful": [2, 2], "reviewText": "I received this at no cost in exchange for writing a review. Here are my comments.1. For a such a powerful unit this is light and compact (2 15/16 x 4 1/16 x 3/4 inches). It has two ports (2A and 1A) and a double LED flashlight, which contrary to another review, I think is just as bright as on any other power bank (actually brighter because there are two lights). Just press the power button quickly twice to turn them on and off.A single click of the power button activates the four indicator lights. All four will light up if the unit is full charged, three if it is 3/4 charged etc. A micro USB cable is include for charging, during which the indicator lights go on depending on the charge level, and ultimate all four are on. Contrary to another review, I don't find the indicator lights to be any brighter than on other power banks. If I charge this in a bedroom while I am away I just face the indicator lights toward the wall.2. This does a good job of holding a charge. A week after I fully charged it, all four indicator lights went on when I checked the charge level.3. This easily and effectively charges my iPhone, iPad, Nexus 2013, GoPro camera, etc.4. This is what I now carry in my briefcase along with the included micro USB cable and an Apple cable. Contrary to another review, I'm happy this doesn't have a built in Micro USB cable because power banks that I have like that are not as compact. It's not a big deal for me to stick my cables into the USB ports and wrap them around the unit (no rubber band required for them to stay in place).Bottom line: Perfect for everyday use and travel.", "overall": 5.0, "summary": "Nice power bank", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
,{"reviewerID": "A25C2M3QF9G7OQ", "asin": "B00KJ0QV9K", "reviewerName": "Comdet", "helpful": [0, 0], "reviewText": "This is a compact way to have 5 ports for charging various devices. The device itself is very compact, measuring only about 4 inches wide and 2.25 inches deep. It has five USB ports on the front. Three are labeled as &#8220;universal&#8221; ports, and provide a 1A output; two are labeled as &#8220;super charger&#8221; ports and provide a max of 2.1A. According to the specs, the super charger ports will adjust their output based on the demand of whatever is plugged in. The total output across all five ports is 7.2A/36 watts.It has an on/off switch on the back, which is a feature I really like and is not often found in chargers. I don&#8217;t like to leave the charger on overnight, and the switch allows me to turn it off without having to unplug the devices. There&#8217;s a small LED indicator on the top that shows when it is powered on. It&#8217;s easily visible, but is not lighthouse beacon bright.It has an in-line transformer that is pretty large but, since it&#8217;s not at the end of the cord, it doesn't block the wall outlet. The power cord will stretch a good 8 feet, which is great for keeping the charger on my desk but having enough cord slack to plug it into a power strip on the floor.The build quality seems pretty good. All the ports are well anchored; the power cord is sturdy; and the ports are well-labeled with white on black lettering. The only thing it lacks that I would have liked is non-skid feet on the base of the unit. The unit is small and light enough that it&#8217;s not a major omission, but it would have been a nice feature to have.Other than the lack of non-skid feet, zero complaints. It&#8217;s a simple and compact way to provide 5 usable ports for recharging.[Sample provided for review]", "overall": 5.0, "summary": "Compact 5-port charger; nice design and build quality", "unixReviewTime": 1401926400, "reviewTime": "06 5, 2014"}
,{"reviewerID": "A1CSXI7MKL6UKR", "asin": "B00KJ0QV9K", "reviewerName": "Kimberly R. Norton", "helpful": [1, 1], "reviewText": "This is a 5 in 1 full sized USB wall charger.  That means that you have one unit which will accommodate 5 USB devices.Three of the USB inputs accommodate smaller electronic items that use only 1 amp.  Two of the USB inputs, at the end of the device, accommodate larger amperage consumption electronic items like an iPad or iPhone.  At the back of the device is an ON/OFF switch.  When the product is turned on, a BLUE light will display.The build quality of this product is great, and at the current amazon price - this product is a give away.Based on the good price amazon is selling this product for, I must say that this is a winner.  Just remember that amazon&#8217;s prices are violative, and their prices can change daily.~Product received by seller/vendor.If a seller/vendor sends a product, I will not review that product if it falls below 4 stars.  The seller/vendor will be contacted with an explicit explanation as to why the product was rejected for a public review.Understanding star rating:5 stars = I love it.4 stars = I like it.3 stars = It is OK.2 stars = I do not like it.1 star_ = I hate it.", "overall": 5.0, "summary": "Useful device", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KJ0QV9K", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [0, 0], "reviewText": "Comdet's very helpful June 5, 2014 review covers most of the characteristics of this charging hub. I want to add a few features that I personally love, and why I awarded my review sample a solid five stars.The first feature that means a lot to me is the extra long power cord assembly. At close to eight feet it stretches from my living room wall to an end table that is a good six feet from the nearest outlet. I am not wild about the transformer part of the power assembly, but on the other hand it keeps the hub itself small.If you do not care about the long power cord feature there are a few more that may be meaningful to you. One that is at the top of my list is this hu has a built in surge protector that prevents it (or devices attached to it) from frying. Where I live this is a big plus because we have electrical issues from storms and the grid itself.Another feature that I like is on two of the ports that are designated as super chargers the is an extra level of protection and intelligence. Each of these ports are for high output devices that draw up to 2.1 Amps of current when being charged. These ports have auto detect circuits that sense the device being charged and adjust accordingly. This prevents overcharging, and also resolves compatibility issues that some devices have. Samsung tablets, in particular, are finicky. I tested these ports with my Samsung Note 3 phone and Tab 3 10.1, as well as an iPad 2 and they worked perfectly.The remaining three ports are generic and put out 1.0 Amps each. I use these to charge the bluetooth speakers and other devices that I seem to accumulate.One final feature is this hub will operate on AC voltages ranging from 100 to 240 volts at 50 or 60 cycles. That means that if you have the proper adapter you can use it in practically any country if you travel.", "overall": 5.0, "summary": "Excellent features, some of which are very handy for me", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
,{"reviewerID": "A22CW0ZHY3NJH8", "asin": "B00KJ0QV9K", "reviewerName": "Noname", "helpful": [2, 2], "reviewText": "This little charging station boasts five ports.  Two of the ports are 2.1 amp ports, and the rest are 1 amp ports.  I've used up to four devices at a time - four, because one port is inevitably blocked by a large USB cable head.  Right now, it is busy charging an iPhone, a power bank, a Kindle Fire HD 8.9\" tablet, and a 9\" Android tablet.  So far, there have been no problems.I like that it can sit on my desk, away from the outlet.  The cord is nice and long, but there is a large AC adapter at the end of it.  It isn't a wall wart which I'm thankful for.  It's more like a floor wart.This product was provided for review by BlueMall.", "overall": 4.0, "summary": "Small Charging Station", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}
,{"reviewerID": "A2LTYEYGKBYXRR", "asin": "B00KJ0QV9K", "reviewerName": "Zachary S. *Tech Reviewer* \"zmanbaseball2@gma...", "helpful": [2, 2], "reviewText": "The EZOPower 5 port 7.2 amp wall charger is one of the most powerful wall chargers I have ever received.Pros:-7.2 amps of output power to the USB&#8217;s which is a very high output-5 USB ports (2 of the USB ports are &#8220;smart&#8221; and can charge any device/tablet at a max of 2.1 amps and the other 3 USB ports have a max output of 1 amp)-Small and portable-Uses a power cable and a power brick to power the wall charger (it is powered by a kind of laptop charging supply)-Has overvoltage, overcurrent, overheating and short circuits protection (built in surge protector in other words)-Can charge an iPad Air, iPad 3, iPhone 5, iPod touch 5 and a Galaxy S4 all at full speed-Works with all USB chargeable phones, tablets and other USB chargeable devices-LED status light that is not annoying-Power on/off button on the back-Ideal for a family/person who has many tablets and smartphones (I have an iPad Air, iPhone 5 and an iPod touch 5 that works great with this wall charger)-UL listed!-Makes an excellent gift-Looks great-Excellent price-Well designed-Good quality constructionCons:-Slides easily-Power brick can be annoyingMy wishes to make this product better:-Add more power so more tablets can charge-Get rid of the power brick-Add grip pads on the bottomThis is a very powerful and well-designed wall charger and I highly recommend it.I was supplied a sample for test and evaluation, for free to keep, and I promised that my review is fair and honest.", "overall": 5.0, "summary": "Powerful wall charger with 5 powerful USB ports and is UL listed!", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
,{"reviewerID": "A2XIOXRRYX0KZY", "asin": "B00KJLMBQQ", "reviewerName": "B.L.", "helpful": [0, 0], "reviewText": "I've been using these for a couple of weeks and I've been very pleased with the experience. For something to wear while outside, they're the best option I've used.It's not that they have better sound than anything else I've ever tried, or that they're far out ahead in staying in place, or that they have the best safety features, or that their battery life knocks it out of the park, or that they stay out of the way the best, it's that I feel Plantronics did a great job of taking all of the conflicting priorities it takes to make a really good bluetooth headset for outdoor exercise and deciding how to balance them.These are comfortable enough that I rarely think about them once they're on.The sound quality is quite good. It's not as good as options I've tried that are designed to be noise isolated and to sit inside my ear, but those qualities aren't always the priority. I have another bluetooth headset that I sometimes wear and only put one earpiece in, so that I can keep enough of my hearing for basic safety (such as being able to hear when a car is approaching). I can wear these in both ears, and still hear what's going on around me just fine.The pouch that comes with them is nice, and the fact that it can be turned into an armband is an interesting touch, but it's worth noting that it'll mostly only end up holding midsized to smaller devices. For smart phones, I can jam something with a 5&#34; screen in there if I really want to, but it certainly doesn't fit really well, so I prefer to just treat the pouch as a holding pouch.They've been doing a very good job of holding their charge, and I can use them to walk my dog several times before I worry about plugging them in again.These would probably not be my first choice if I were heading to the gym or hopping on the treadmill in my own home (unless I was wanting to make sure that I'd hear easily if someone was talking to me or something on that particular day). I prefer to block out the world a little more when I'm doing those things.I think it's reasonable to assume that these are much safer for older children and teenagers (those who are big enough to wear these, basically) vs headphones that sit inside the ear, since they're not just blasting sound directly at the ear (there are a lot of warnings out there about not letting kids have the headphones that go into the ear, because they tend to turn the volume too high and damage their hearing).When I'm in a situation where I need to be able to hear what's going on, I feel far better going out wearing these than I do in noise-isolating headphones. I've walked around with music playing and have still been able to hear cars, and the air conditioning units on nearby houses as they're running, and dogs when they see me from their yards, and that kind of thing.", "overall": 5.0, "summary": "Great Outdoor Headphones", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2OMQEK9OW2FY6", "asin": "B00KJLMBQQ", "reviewerName": "Brad B", "helpful": [0, 0], "reviewText": "I own more headphones than I care to admit.  I currently use a pair of LG Tones that I really like. They are lightweight, sound good and I don't mind the collar.So going into reviewing these that was the baseline.I really like how these stay off my neck.  I never really had a problem with the weight of the LG's but if its hot out or Im exercising, the contact of the collar and my skin is annoying.  These are about half an inch from my head when I wear them.  The skin touching problem is taken care of - but replaced with the bouncing problem.  If I am running I can feel the band in the back of my head moving up and down.  It's also annoying.  So I guess I get to pick which annoyance I want to deal with.Other than that - I really like the sound quality.  They are comfortable to wear, even though the ear buds are a different style (harder plastic) than the LG's (squishy rubber).They paired with my phone very easily.  They look sporty.  The controls are a little annoying to use because of how hard you have to press the button it hurts my ear.  Maybe hurt is too strong - it is momentarily uncomfortable.I have no complaints about them. If I had to choose between these and my LGs I will choose these purely on comfort.", "overall": 5.0, "summary": "Comfortable and Sporty.", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2SZLNSI5KOQJT", "asin": "B00KJLMBQQ", "reviewerName": "Carrie", "helpful": [0, 0], "reviewText": "Plantronics BackBeat FIT wireless headphones have accomplished what other wireless headphones couldn't - they fit a small head/ears, are comfortable & stay in place!Syncing to my Windows phone was easy and the sound was clear (I can still hear street noise).  The only problem I had was with the buttons, which are small. I also had a problem with the diagram & labeling, but once I figured out the buttons (the diagram didn't help much), the headphones were easy to use.The case is nice in that it turns inside out to make an armband for my Windows Lumia phone (which stays in place). Charging is pretty quick & the battery life is very good.  I did not try to make/take phone calls, so cannot comment on this feature.Because of the fit, these are my go-to headphones.", "overall": 4.0, "summary": "Finally, Wireless Headphones that FIT!!!  (small head/ears)", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A3KPJ1MOGTZVGC", "asin": "B00KJLMBQQ", "reviewerName": "Catfish Kozmo", "helpful": [0, 0], "reviewText": "I'm a huge fan of Bluetooth headsets for working out.  And I think I've gone through my share of them.  The vast majority don't seem to handle the sweat or the jostling.  Or have a decent battery life.  My current headset has been a Motorola SD-11 which has gone through 2 returns via warranty back to Motorola.  I seem to get about 6 months out of them before they die.  But enough about that.The Plantronics BackBeat FIT were super easy to get opened and get going.  The odd part about these is that the back band is floppy and very light weight.  The charging port is a little bit tricky to find.  You have to use a finger nail to gently slide back the cover.  The nice part though is that the charging light changes color when they're fully charged.Also, the on/off button is slightly tricky the first time.  I am particular about always turning off my headset after a workout to conserve the battery life.Fit is spot on.  These are very light weight and fit just perfectly over my ears.  Because they're so light weight, I don't have a problem wearing them for hours.Sound initially was a problem.  That was because I was in a crowded gym and I had trouble turning the volume up on the BackBeat initially.  I've got the BackBeat volume on high and volume on high on my phone for the most part to block out all background noise.  If I turn down my phone volume, you will still have situation awareness as the headset still lets outside noise in.  I'm comparing this to other headsets where the earpieces go completely in your ear and really block more noise.  These don't go all the way in your ear but pretty close.  I was able to jog outside and still hear cars.Battery has been pretty good thus far.  I've had about 4 or 5 runs in and they're still at &#34;medium&#34;.  The battery is only reported as high, medium and low but that is good enough.Overall, these are my new favorite pair.  I'm not sure if the tsunami of sweat that pours from me will eventually kill them but I sure hope not.  I'll update this review should something change.", "overall": 5.0, "summary": "The Plantronics BackBeat FIT were super easy to get opened and get going", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A3NPETMZXGIG65", "asin": "B00KJLMBQQ", "reviewerName": "C. Dooley", "helpful": [1, 1], "reviewText": "I have owned a different pair of BlueTooth ear buds from this brand before that I didn't like at all, but I was very surprised that this pair is great!  This set is NOT noise canceling, but that is on purpose - it's for safety so you can hear you surroundings while exercising outside.  But honestly, the sound is so good, it was ok with me that I can hear my background slightly.  Love the reversible arm band / headphone storage that comes with it!  Nice color, has reflection on it for safety walking, jogging at night!  And it is even roomy enough to hold my iPhone with Otter cover on it!  Comes with charging USB cable - but not a wall outlet (but most don't these days).  I  very pleased with the design!  No tangled cords, fits comfortably in the ears, looks sporty, easy to operate.. What's not to like?!", "overall": 5.0, "summary": "Surprisingly Nice!", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "A2C3VC5JTYVRCL", "asin": "B00KJLMBQQ", "reviewerName": "Christopher Scott", "helpful": [1, 2], "reviewText": "I've been using these headphones during workouts for about a week and I am very impressed. They are so light and comfortable I don't even notice them, and once you have them on they stay put. I mostly listen to podcasts while exercising, so I can't really speak to the audio quality other than to say it's plenty good enough for me. Other than the relatively high price, I don't have any complaints.", "overall": 5.0, "summary": "Light, comfy, and secure", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
,{"reviewerID": "AVPNQUVZWMDSX", "asin": "B00KJLMBQQ", "reviewerName": "esanta \"esanta\"", "helpful": [4, 5], "reviewText": "The BackBeat FIT are entirely made of a rubbery, material in a snazzy two-tone matte finish (black and green or black and blue).A built-in loop fits around your ears and holds the earbud in place.The controls are intentionally limited and simple: each earbud features a large round button and a small button right next to it. The benefit is that it's extremely easy to remember: press the left ear to pause or play, the right ear to answer a phone call. Two presses on the left ear to skip to the next track, a long press to go back. A short press on the secondary button on the left ear increases the volume, a continuous press lowers it; a short press on the same button on the right ear reports the battery life remaining, and a long press turns the headset on or off.The FIT charging port is a microUSB connector hidden behind a little hinged cover; charging can take up to 2 1/2 hours if the battery is completely depleted. Plantronics claims a battery life of 8 hours for music playback, 6 hours talk time. In my informal tests, I think it might be closer to 10 hours continuous playback (at reasonable volume). You have a full day of work plus commute and gym time. Nice!The audio quality is excellent. While they're obviously no match for expensive headsets, keep in mind they're exercise headphones meant to withstand lots of sweat and abuse, and they're definitely all the way at the top of that category when it comes to sound.The box contains the headphones, a small manual, a very short USB to microUSB cable (no charger, probably to conform with recent European regulations) and a clever neoprene carry case which can be turned inside out and becomes an armband case.When you first pair the headphones with an iPhone, you are notified that a free Plantronics firmware app is available and asked if you want to download it from the Apple store. I did, and the app told me I needed to upgrade, which I did... and the upgrade failed. Again. And again. That's when I called Plantronics tech support, which determined something was probably wrong and said they would send me a prepaid return label, and ship a replacement as soon as they were notified of the pick up -- amazing service!I then realized I had been using a third party charger (the upgrade process requires the headset to be plugged into a charger and that's what I had handy). Out of curiosity, I used the cable supplied by Plantronics plugged into my monitor's USB port and what do you know... the update completed successfully (I called Plantronics immediately to let them know and cancel the replacement) so if you have the same problem make sure you're using their cable and a quality power adapter.On the iPhone/iPad, a small indicator next to the bluetooth icon in the status bar indicates the remaining power; on Android phones, a free Plantronic app performs the same task. Both apps notify you of available firmware updates.I LIKED------------ Excellent sound quality, and they don't completely cut out all ambient sound- Very limited sound leaks (people around you won't hear what you're listening to)- Convenience -- best gym headphones ever, even better than my go-to LG HBS-730- Bundled neoprene case -- but it's the size of an iPhone 5, good luck sticking a phablet or even a Galaxy S3 into it- Comfort -- they're really pleasant to wear even for extended periods of time- Battery life -- better than the 8 hours advertised- Simple controls- Absolutely stellar customer support.I DISLIKED----------------... nothing. The only slightly irritating thing is that FF/REW is a little tricky to get used to, and good luck doing it while running. On the other hand, it's not like there's that much space on there for buttons, and having only two buttons per side, both very easily identifiable by touch, is a good compromise.In conclusion...If you exercise with music, whether it's running, lifting weights, doing cardio on a treadmill, the FIT are one of the best headphones you can get -- but they're also good enough to be the headphones you wear on public transportation or in your cubicle at work.Very highly recommended.", "overall": 5.0, "summary": "Good sound, best-in-class battery life, comfortable to wear", "unixReviewTime": 1403740800, "reviewTime": "06 26, 2014"}
,{"reviewerID": "A20OBCQWBKCGZT", "asin": "B00KJLMBQQ", "reviewerName": "Flaherty", "helpful": [0, 0], "reviewText": "I was really surprised that this bluetooth headset was as good as it is. It fits my ear fairly well, it stays on 100%, it is easy to locate (nice bright blue) and is very well made. The sound quality on my end has been superb, but I occasionally have complaints from one person that the sound quality is not good for them when I'm talking on this.I can leave it off when I'm driving and it's easy to put on my ears to take a phone call. This charges fast as well and maintains a long battery life. The controls are easy to operate. One of the things I like best about this headset is the ear insert. This is far superior to the same price range single ear bluetooth headsets that have a foam covering that gets lost or a removable plastic ear loop that falls off. This is all in one piece and very high quality. Music sounds amazing as well!I would definitely buy another should I lose this one, and am very pleased in every aspect with this headset.", "overall": 5.0, "summary": "Excellent quality and design", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A3BY9B9YM6HUEJ", "asin": "B00KJLMBQQ", "reviewerName": "Foye", "helpful": [0, 1], "reviewText": "These are by far the best bluetooth headphones for exercise that I have had!  I have tried the Plantronics Backbeat Go and liked the lightweight/slim design but you had to shove them in your ear to make them fit and then they were uncomfortable after about an hour.  I've also tried the Plantronics Backbeat 903+ and they were more comfortable on your ears but were too loose around the ears and I had to constantly push them back in.These headphones are extremely lightweight, streamlined, and easy to use.  I almost forget that I have them on my head, the sound quality is great, and they connect every time without problems.  I read a couple reviews where they said the strap in the back was irritating on their neck while running but I haven't experienced that at all, I don't even feel the strap.  Overall they are great headphones and I think I can finally stop looking for the right headphones to use when exercising.", "overall": 5.0, "summary": "These are by far the best bluetooth headphones for exercise that I have had", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "A1PB9XZDJNY3YR", "asin": "B00KJLMBQQ", "reviewerName": "fredyt123", "helpful": [0, 0], "reviewText": "Plantronics has really improved their wireless headphones.  The sound is exceptional and the look is similar to the one's made by Motorola, but these are very functional.  Easy to pair, easy to operate and sufficient wireless time.  Like many popular headphones these offer several ear fitting options.This product is great for the person who wants to advance beyond the wired headphones and is seeking a quality product from a company whose primary business is headphones.", "overall": 4.0, "summary": "Plantronics BackBeat", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A3QJU4FEN8PQSZ", "asin": "B00KJLMBQQ", "reviewerName": "Grimmy \"Grimmy\"", "helpful": [0, 0], "reviewText": "These headphones stay on the head relatively easily, are light and unobtrusive. Bright, reflective color for safety and, well, fun.Sweat and moisture repellent for durability. Includes smartphone armband for workout use.It was hard for me to evaluate the sound because I couldn't get a good fit. The earpieces pushed forward against the inside of my ear, and after a while causes some discomfort. Due to this fit I also couldn't get good sound isolation. However, many reviewers here seem to have gotten it to fit their ears, so maybe it's due to my misshapen head.Assuming you have normal ear canals, it seems these might work for you. I'll be trying them more to see if there are adjustments that will make them work for me.", "overall": 3.0, "summary": "Depends on how they fit inside your ear", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A1A027UELK4JZC", "asin": "B00KJLMBQQ", "reviewerName": "Jami Garrison \"JamiRae\"", "helpful": [0, 0], "reviewText": "These are great headphones.  They connect/pair to my iPhone 5 quickly and easily and fit securely on my head.  I would like them to be just a bit snugger at times, but honestly they have been great during runs and walks.  I've sweated in them and they are still working.  This is huge for me as the last pair of Plantronics bluetooth headphones I had got damage due to my sweat from my intense workouts.  This one so far has lived up to its &#34;waterproof&#34; claim.The controls are easy enough to work.  It took me a bit to figure out that i had to use the little tine nobs/buttons above the round button (yea, I dont like to read the directions), but once I got that figured out, I was all set.  The sound is good, though if the fit was a bit snugger I think I could get some of that high energy music to blast me better.  (yes, I like it loud sometimes when I'm exercising).  I only wear these to exercise with so fit is really important.  The way these go over the ears keeps them on my head and the little piece that holds them in your ear works well too.I have a pair of Jabra bluetooth earbuds too and the sound with those is a little better, but they dont have an over-ear part so I struggle a bit with keeping those one on my head.  If you run or do other high intensity workouts with music, these Plantronics earbuds are a good choice.", "overall": 5.0, "summary": "Stay put, sweat proof, and decent sound", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
,{"reviewerID": "A2GVVAO242EK1D", "asin": "B00KJLMBQQ", "reviewerName": "J. W. Mullins", "helpful": [0, 1], "reviewText": "I'm really digging these. This is my fourth set of Bluetooth headphones and my third for workout specific ones.Pairing was super easy and the headphones have good sound. They also have much better battery life than any except my none workout ones. Even better range is at least twice the distance as the least set of Jabra workout specific ones I bought. I also don't have any issues with voice cutting in and out with these.The controls are sparse and easy to use. Sound is good, but nothing Boise like. The ear pieces aren't too bad, but they chafe me after awhile if I 'lock' them in. Unless I'm doing something with a lot of movement like Burpees I just leave them a little lose. I've had this issues with all the in ear plugs like this so its probably just me. The headband around the back for the wires is stiff. Its not annoying but its a bit thicker than I'd prefer, but I'll take it for its toughness.I've also had these puppies out on my beach runs and some water work and they keep chugging along. No issues with water and no issues with salt water specifically. At this point I'd highly recommend them. If I find something else to add, good or bad, then I'll update this. But so far so good.", "overall": 5.0, "summary": "Bluetooth headsets evolving", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "AQIJ3ZEEVCIKU", "asin": "B00KJLMBQQ", "reviewerName": "Kaio", "helpful": [2, 2], "reviewText": "I have tried many a bluetooth headset. Here's the basics of what Plantronics got right with this one:> Pliable - don't let the photo fool you into thinking this is one of those uncomfortably rigid headsets that you can't rest your head back if you're wearing them. The 'cord' that goes around the back of your head is rubbery and soft. It's firm and holds its shape when it needs to, but it's also bendy and pliable, so you can lay on the sofa or your fave comfy chair while listening to your tunes.> Built for Activity - nice as it is to kick back and enjoy some tunes, BackBeat Fit was built for activity. The rubbery coating ensures these will survive sweaty workouts. Even better, these actually stay in your ears!! Huh; go figure! So many headsets get this flat wrong, and I'm constantly futzing with keeping the buds in my ears. But Plantronics did an exceptional job at designing these to stay in place, where they belong. So do all the jumping, bouncing, running and iron pumping you want, these ain't going anywhere.> Excellent Fit - They're so comfy, I barely even notice I'm wearing them. I love that Plantronics didn't waste any thoughts on the redundancy of extra ear gels. Why? Because they made it right the first time. These ear inserts can be easily rotated and tweaked to fit most any ear comfortably. No extra parts left over, or wondering what to do with them.> Excellent Sound - the audio quality of these are great. They certainly don't compete with top notch over the ear phones, but for buds, the sound is excellent. Rich and deep, though I wish it went just a little bit louder. However, these are much better than any of my Jabras, which are notoriously 3-5db too low in volume, no matter which model you buy.> Easy Controls - just tap for volume up, and hold for volume down. Call and track select buttons all works great too. Love the vocal cues too, alerting to battery level, volume, etc.> Call Quality - stereo headsets aren't always the best for calls. These work fine and people said I sounded good, but I think this feature is best looked at as a convenience. It doesn't compete with the best of the best headsets out there. But for a stereo headset, and the occasional call while jamming or working out, these are one of the better ones I've tried.Bottom Line - fantastic sound, excellent fit, stylish color, velvety feel and volume that should drown out ambient gym noise. These are one of the best athletic bluetooth headsets I've tried. Very nicely done. I'm impressed.", "overall": 5.0, "summary": "Comfy - Loud - Pliable", "unixReviewTime": 1403395200, "reviewTime": "06 22, 2014"}
,{"reviewerID": "A1B2HEXUQTP8GR", "asin": "B00KJLMBQQ", "reviewerName": "Leon", "helpful": [0, 0], "reviewText": "Years ago, when I began my search for a Bluetooth headset I had some specific criteria that has provided to be difficult to fulfill.  Prior to the purchase of the BackBeat FIT headset I've purchased several other brands of various design.All have had their short-comings.  In one area these do, too.  In a noisy environment they do not seal in my ear well enough to overcome the ambient noise regardless of the volume set.  Also, because of the poor seal the bass response is nearly nonexistent.  In a less noisy environment they sound very good although, I'm left wishing for better bass.  If there were a way to improve the seal I'd have no complaints.  My spouse (smaller ears) does not share the same complaint in regard to the seal.  Should you be fortunate enough to have the proper design ear canal you'll be very happy with the comfort and seal of these.My main hope with these were a great improvement in battery life.  No disappoints here.  Depending on the media you can easily obtain the promised run-times.  For instance, audio books will play much longer than highly driven music.  It helps to have the volume on your music player high and adjust the volume on the FIT to your preference.I have a set of Plantronics BackBeat Go 2's to compare.  For me those are perfect except in the run-time department.  If you'd like to save some money I recommend the 2's over the Fits, if you can live with the battery life and troublesome fit some have reported.The Fit's have the most impressive Blue Tooth range of any wireless headset I've ever used.  It really is surprising better.Call quality is very good both receiving and transmitting.  No complaints from any callers at all on either end.They are also very secure.  If these things come out during the normal course of your activities I suspect you'd also be on the way to a hospital.I consider these to be Plantronics best effort and recommend them", "overall": 5.0, "summary": "Plantronics best yet.", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "AYU9EB9W3MWBG", "asin": "B00KJLMBQQ", "reviewerName": "Luis Amendola #TechJunkie \"Luis\"", "helpful": [0, 0], "reviewText": "Absolutely love them .I've gone through many different wireless headphones this year Sonys, BackBeat Go 2, Motorola SD 11 but this one is amazing great sound even in a loud gym, I workout in a warehouse gym thats always packed and music is turned up to ungodly levels yet the audio on these does not dissapoint.For me they are perfect. Thank you Plantronics.", "overall": 5.0, "summary": "Gym rat approved.", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A26SO3TOT2TLJE", "asin": "B00KJLMBQQ", "reviewerName": "Marla", "helpful": [0, 1], "reviewText": "Plantronics Wireless headphones are truly impressive with their excellent design and quality. The sound quality is exceptional and the fit was perfect for me although it could be too small for some people. The pairing was super easy but the power button was hard to find since it's a tiny black button on the right headphone which is also black. The charger is a USB cable which you can either plug into your computer or hook the USB cable up to your phone wall plug. Again, the design is very sleek and you simply pull a little green tab one of the headphones. It charges fast and the battery lasts a long time. Great product for a great price!", "overall": 5.0, "summary": "Great sound and design!", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A3PPXVR5J6U2JD", "asin": "B00KJLMBQQ", "reviewerName": "Michael J. Tresca \"Talien\"", "helpful": [0, 0], "reviewText": "I&#8217;ve been sadly behind the times when it comes to wireless headphones for a few reasons: my inner ear is a weird shape that doesn&#8217;t fit well with ear buds, and I have big ears. This means that earbuds fall out of my ears and I have a headache after wearing headphones. The Backbeat FIT are the first headphones that stayed on my head and didn&#8217;t hurt.There&#8217;s so many things these headphones get right. They&#8217;re light. They adjust to your ears, bending so that they fit perfectly.  They&#8217;re so light that I don&#8217;t notice they&#8217;re on.  And the stereo quality is fantastic &#8211; at least to me, but I&#8217;m no audio expert.There are a few flaws, one being the buttons.  You might think that you would turn the headphones on and off by pressing the button on the center of the headphones.  You would be wrong &#8211; you actually press the raised edge of one of the buttons. Also, it&#8217;s a bright &#8220;alien goo&#8221; green, but this is really for folks who want to be seen from a distance when the jog (I run on a treadmill).Even the case is awesome.  It turns inside out to be a container for the headphones as well as the charger, and straps neatly around your bicep or leg to hold your iPod.  If you buy one set of headphones, these will do nicely.", "overall": 4.0, "summary": "Everything is awesome", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A22IDP8YERZ79X", "asin": "B00KJLMBQQ", "reviewerName": "MicheleLK \"Michele\"", "helpful": [0, 1], "reviewText": "These are so much better than I expected, honestly.  First off - looking at the photos I thought the neck band would be stiff, but it's not! It's super soft and wraps nicely around my head.  Honestly, I fell asleep with these on laying on my back!The sound is AMAZING for how they are shaped.  I thought for sure they would sound strange because of the way the ears are shaped, but they are so crystal clear and make my music sound even better.They're really easy to use. Just hold down the button to turn it on and then use the little buttons on the ears to make it go.  There are these little black tabs on each ear to help you identify which ear does what.  I found this very useful.The battery life exceeded the stated 8 hours of music play. I fell asleep for about 9 hours and woke up with them still playing from a full charge.These headphones have changed my life. In fact, I am now selling my Bose headphones on eBay because I love these so much.  They are so soft!", "overall": 5.0, "summary": "So much softer than I expected - very comfortable and the sound is crystal clear!", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
,{"reviewerID": "A190AUMNV44H97", "asin": "B00KJLMBQQ", "reviewerName": "mmmmpppp \". .  adrift . . .\"", "helpful": [1, 2], "reviewText": "I am a runner, gym patron, and longtime Plantronics bluetooth customer: I've had several 903+'s and a Go 2.  The Go 2 doesn't stay in my ears and is on the large side for exercising, but it seemed like the best thing available last year.The Fit is disappointing in three ways: 1)  It's not loud enough, 2) the ear pieces hurt my ears due to their hardness, and 3) the phone functionality is the worst of the Plantronics I've had, and the call quality isn't very good with the other Plantronics headphones I mentioned above.1) Not loud enough -- The is a big problem.  I like to download movies to my Note 3 and watch them in the gym as I work out.  These movies typically play more quietly than other videos.  The Go 2 plays the movies just loud enough for me to hear and enjoy them in my noisy gym.  The Fit plays the very same movies just quietly enough that I can't hear them in the gym.  Music and other videos that play louder sound excellent.I have a speakerboost application that doesn't seem to make any difference to the Fit volume, but they have a feature that Plantronics should use.  Namely, they only boost to 60% unless you go into settings and allow them to boost more, which requires acknowledging that you are making this change.  If Plantronics is so worried about lawsuits if they make the headphones loud enough to hear in noisy places, they should use this feature to allow people to choose a higher volume.2)  The Fit doesn't fit --  The Fit earphones do stay in place no matter what I do.  I think it may also be possible to find positions for each ear that don't hurt, but so far, I have either failed to achieve that or I may have succeeded once.  They take me a lot of fiddling with them to try to find a position that won't hurt.Why it would have been so hard to make the earpieces softer is anyone's guess.3)  Call quality is bad -- I've made five calls with the Fit.  Three were so bad on both ends, it was almost pointless.  Two were good on both ends.  The three that were bad were with the same person, someone with whom I had spoken on the Go 2 as well.  On the Go 2, the other party sounded fine but complained about background noise.  With the Fit, both sides break up terribly and the person on other side hated the noise far worse than with the Go 2.It's nice to have earphones that stay in place--I bought a pair of wired earphones 7 years ago for under $5.00 that had an over-the-ear component that kept them in place, but they weren't waterproof.  It's nice that in 2014 Plantronics had the breakthrough of waterproof earphones that stay in place.  Now if I could only hear them without ear pain and make calls, they'd be perfect.  Perhaps Plantronics will resolve one of these issues next year and soak me for another $150, then resolve another one in the following year for, say, $180, and maybe they can do the last one in three years for, say, $210.UPDATE:  I exchanged my pair in hopes that my complaints were particular to the unit I received.  The connecting chord in back on the new one is slightly longer, within a margin of manufacturing error.  With the new one, I can get a more or less comfortable fit.  Unfortunately, the volume level and call quality are precisely the same.", "overall": 1.0, "summary": "Disappointing", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1KPFZCS71QKW5", "asin": "B00KJLMBQQ", "reviewerName": "nycebo", "helpful": [12, 12], "reviewText": "Well, it took a little time to get used to both the fit AND and the interface, but I finally feel ready to properly review the Plantronics Backbeat Fit headphones. Previously, I have been using the Jaybird Bluebuds X. As many reviewers of the Jaybirds have indicated, they are pretty nice earphones that sound more than acceptable when inserted correctly. But, I've had a lot of issues getting them to stay in my ears despite trying many of the varying adapters and different-sized earbuds. Unfortunately, if a good seal isn't maintained, the sound quality of the Jaybirds deteriorates dramatically. Lastly, I don't really love the the long neck strap/cord on the Jaybirds. It bounces around regardless of whether place in front of or behind my neck, or even inside my shirt. I tried the cord fasteners but they didn't really resolve the bouncing issue.So, that brings me to my quest for an alternative. Enter the Plantronics Backbeat Fit. Let's get right down to it....FORMThe entire headset (note, they are not earphones) is molded from a very flexible, rubbery material. It looks exceedingly durable and is nicely accented with reflective blue to aid visibility while running while dark out. The Backbeats are a little tricky to put on, though, because the ear supports are somewhat snug and I found it difficult to get them on around my ears. Who knows, perhaps I have bigger ears. However, after doing it a few times, it got easier and I can now throw them on and off without thinking about it. Moreover, the headset stays comfortably in place while exercising (running, lifting, etc). The individual earpieces also have a small rubber wire that's used to help keep the speaker snug next to the auditory canal. It's not sealed as with earphones but it keeps the speaker close. Plantronics indicates that the design was chosen in order to allow some outside noise (sirens, people yelling, horns, etc) to be heard while listening to music, thus reducing the risks of an accident while out and about. All in all, it's a very handsome design and I likeFITAs noted above, the headset stays in place well and has been very comfortable for the several times that I've worn them. The previously mentioned over-the-ear supports and canal wire stays definitely help to keep them in place while running around. It's something that I could not say about the Jaybird earphones. Moreover, because there is no loose support cord bouncing around, I really felt completely free while listening to my music. It's a cool experience and I like that I don't have to constantly adjust the headset while on the go.SOUNDHere's the million dollar question: how do they sound? I guess they are alright. But first, let me preface that after years of listening to in-earphones, I'm pretty spoiled by what headphones should sound like. The key, though, is that earphones only sound excellent when a solid seal is maintained. In all my years of using them while exercising, I've never been able to achieve that because of either sweat or poor fit despite trying numerous earbuds. Also, I will admit that a fully sealed earphone leaves one pretty isolated from traffic and people around me. The Plantronics take a different approach. They have gone with a headset that lets some sound in for safety. In the process, the sound is somewhat diminished. To compensate, the highs and very lows have been boosted pretty aggressively (almost obscenely, candidly). Since it's a headset, however, it's not too bad unless the earpiece sits very close to the canal. At that point, the harsh treble and overly explosive bass become annoying. Curiously, the upper bass and midrange suffer a bit. They sound a hint flat and quite lackluster since they are overshadowed by low bass and treble. While the Backbeats are NOT what I'd want for my walk-around or at-home listening pleasure, they are perfectly adequate for exercise. First, they stay in place exactly where I put them. It's a relief to go for a run or lift weights and not have to constantly adjust the headset for a better fit and accordingly, better sound. The Plantronics just stay consistently average and acceptable...which is MORE than fine for their purpose. So, while the sound isn't the best, it's works well for its state use...and for that I'm greatly and finally relieved.OTHER FEATURESWhile I don't use the telephone functions much, I'll state that they work very well. Calls from my wife never resulted in any complaints other than that fact that she said I sounded like I was breathing heavily. I indicated that I was breathing heavily since I was running. So, the mic quality is clearly good enough to pick that up. For my part, call quality on my end was quite good and without any major or minor complaints.The controls, on the other hand, are a bit tricky. While calls and music are easily operated (calls are easily answered and ended by tapping on the right earpiece; music play and pause is controled by tapping on the left earpiece). Nevertheless, it turns out that Plantronics made a quirky design decision with the volume, skip and power buttons. On the top of the round central buttons used for calls and music are much smaller 'ledges' that are used. This was not intuitive out of the box; indeed, I struggled for quite a bit trying to find out how to power the headset on. The right upper button 'ledge' is tilted/pressed down in order to power them on and off. Trying to describe it better, it's not the round button center that is pressed, but the top 'edge' or 'ledge' of the button that is pressed/tilted to activate these other features. It's simple after you do it once (indeed, I felt like an idiot for not noticing it sooner), but I thought to highlight it for people who have had similar issues. Meanwhile, the left 'ledge' is used to control volume (click once for louder, hold down for quieter). And that's it, you should be good to go.FINAL THOUGHTSSo, are these the greatest headphones? No. But, for exercise, they sure come close. would I like them to sound better? Yes. But, if it comes at the cost of having to constantly adjust and insert/reinsert earbuds, then No. While I started off thinking I wouldn't really love the Backbeat Fit because it wasn't an earphone design, I've been pleasantly surprised because of how well they do what they are supposed to do (once you figure out the interface). And for that, I'm giving them 4 stars. I know some will criticize because of the sound quality, but for what I use them for and for how well they stay snugly in place, the music is good enough for what I need them to do.", "overall": 4.0, "summary": "A good headset with acceptable sound that stays in place during workouts", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "A3RC8FXY6QBPAZ", "asin": "B00KJLMBQQ", "reviewerName": "rightmuch", "helpful": [0, 0], "reviewText": "Fit and sound are great. Best BT in-ear headphones I've found thus far, and I've tried them all. Big improvement over the 903+. The only negative is the arm band. Clearly, Plantronics was catering to the iPhone folks because my Galaxy S5 will not fit. So when the iPhone 6 comes out with a larger screen, they'll have the same issue. Dumb.", "overall": 4.0, "summary": "They almost got everything right.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2QRXQPHDMFCQV", "asin": "B00KJLMBQQ", "reviewerName": "SanjeevP \"Bottom Line\"", "helpful": [0, 1], "reviewText": "These lightweight headphones are easy to pair with mobile music device. Sound quality is very good and they do not completely block the outside noise so you can still hear the traffic. They sit on the ears and do not go all the way in. Controls are easily accessible. Also nice is that you can see remaining battery life on iPhone. Generally they can tolerate the exercise movement well  and stay in the ears although may require some adjustment during prolonged exercise.The cons that I can find are that they are relatively expensive, and after using them for a while, they become uncomfortable to wear. And if you exercise on a treadmill at home and want to completely block the outside sound then they are not for you.So they are primarily outdoor exercise headphones.", "overall": 3.0, "summary": "Expensive Outdoor Exercise Headphones", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A66XJOWNNVFMX", "asin": "B00KJLMBQQ", "reviewerName": "sinerge", "helpful": [1, 3], "reviewText": "I have the Backbeat Go and love those, which is why I got these for my wife and since the in-ear only buds don't work well for her.  Part of the reason I got these was because the storage case/arm band is a great idea and BUT it's obvious they designed the dimensions with an iPhone 5/5s in mind (they even have a picture of an iPhone in the case on the back of the box), problem with that is many other popular phones are bigger and the next iPhone out in 3-4 months will be too, so that basically makes the arm band useless if it doesn't fit.  No foresight by releasing a product designed around another product at the end of it's life cycle.  More later on sound and battery life, but expect both to be on par or better than the Go model.", "overall": 3.0, "summary": "Okay for now", "unixReviewTime": 1403308800, "reviewTime": "06 21, 2014"}
,{"reviewerID": "A11I1I9QLMAM1A", "asin": "B00KJLMBQQ", "reviewerName": "S. Power", "helpful": [0, 0], "reviewText": "Over the years I've tried a lot of different Bluetooth headphones for running and have always been pretty disappointed.  Some would lose their connection, others were bulky, and a couple sets stopped working after just a few months.  I'd always end up going back to a cheap pair of wired headphones because Bluetooth just didn't seem to be ready for running the the hot Texas sun for an hour a day on an excessive sweater.These headphones might be the first that will prove to be a permanent replacement for my wired headphones.  They are light-weight, sound great, remain connected, and so far seem to be very durable and water proof.  They work great for calls, sound wonderful with music, were easy to connect to my Nexus 5 phone, and are super-simple to operate.I have no complaints and am very glad to finally have some wireless workout headphones that aren't more hassle than they are worth.", "overall": 5.0, "summary": "The best Bluetooth Headphones so far for running", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "A1YM3BZ2FO1JYI", "asin": "B00KJLMBQQ", "reviewerName": "S. Schmidtke", "helpful": [0, 1], "reviewText": "I need to start out with I'm not a fan of headphones in my ear.  These were tolerably uncomfortable in the ear  Around the ear was great, and I've had reconstructive surgery on one ear after cancer surgery.  It's a bit misshapen.So, why the 4 star and not lower? The sound quality was great. Pairing to my android phone, ipad, and ipod was extremely easy.  Ease of use on a call was too easy.I purchased this for when I work at home. I easily got 8 hours of listen/talk time. And, I listened to music when I was not on a call. Talk was clear on both sides of the discussion.I just wish the were more comfortable in the ear.", "overall": 4.0, "summary": "Love the sound quality. Wish the in ear fit was more comfortable", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "AUBAYRC0HRBSS", "asin": "B00KJLMBQQ", "reviewerName": "Steven Schumacher", "helpful": [3, 5], "reviewText": "Had the original Plantronics Backbeat for almost 5 years. They finally ran their course & had to be replaced. Since the majority of the time I used my old ones for running, these FIT headphones made the most sense. They had rave reviews on Amazon & I was very excited to get them in my ears! I am sad to say I was let down...The design is very poor. My previous Backbeat's had rubber buds that are very flexible & adjust to the ear canal quite easily; these have the antithesis.  Extremely hard buds with little rubber movement caused an uncomfortable fit in my ear, especially in my right ear which (I am now finding out) has a deeper canal than my left. I never noticed this in my previous headphones because the bud was rubber & easily adjustable. Because these buds on the FIT are hard, the sound quality is different in each ear, which is super annoying.The sound, in general, is fine but again, because of the poor design, I could never have the full listening potential I want, as they do not sit right in my ears.I cannot explain how excited I was for these; if they were just like the original Plantronics but with an athletic twist to them, 5 stars would be given right now...instead, I have to blast the design & return them today; I would get the 903+, but I already purchased them months ago & had to return them due to the poor range on Bluetooth, compared to the original ones I have been using for years. You will notice a bunch of people say the same thing on the 903+ with the range being horrible & almost unusable.Truly disappointed.", "overall": 2.0, "summary": "Extremely Dissapointed", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
,{"reviewerID": "A1HBI9BBQIG1NH", "asin": "B00KJLMBQQ", "reviewerName": "Ward J. Lamb", "helpful": [0, 0], "reviewText": "At first I had trouble figuring out how to turn this head set on and start using it. The battery was not charged enough and no blinking light ,blue to red appeared. I then hooked up the USB charger into the charging compartment and I was on my way.It attaches to the back of the head and loops over the ears. I use it indoors mostly so I have not really taken advantage of the phone sleeve for the arm,which I plan too.There was a software update online which I took advantage of right away.It connected to my memorex speaker system with amazon blue tooth box.It is true that it does allow you to hear things in the environment,making it almost safe to use it outside. I always think that is not the best way to compromise safety. I use it at home while others do not want to listen to my music.The unit is modern flexible with barnacle shaped ear buds.I had to laugh at myself trying to put it on top of my head instead of from the back-oh well...", "overall": 4.0, "summary": "I like this product", "unixReviewTime": 1403740800, "reviewTime": "06 26, 2014"}
,{"reviewerID": "A28X31ZK2LK1YB", "asin": "B00KL806PK", "reviewerName": "Amazon Customer \"Laguna Niguel mom\"", "helpful": [1, 2], "reviewText": "This is a nice size charger cube that works well with my iphone.  I travel a lot, so I appreciate the small size and the retractable plug.  I lost my old charger, but like this one so much better.  The old one was bigger and could break into two pieces.Pros:~quick charge~ducl plug, so I can charge my phone and one other electronic device when I'm on the road~small size fits easily into my bag when I'm traveling~the &#34;plug&#34; folds in so you have a nice cube that doesn't catch on things in your bag~great priceCons:~", "overall": 5.0, "summary": "Does the job well.", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
,{"reviewerID": "A3NHUQ33CFH3VM", "asin": "B00KL806PK", "reviewerName": "Citizen John", "helpful": [1, 1], "reviewText": "This wall charger provides a fast charge for two devices at once. It's much faster than using a laptop to charge another device. The prongs fold so it's easy to stow.It runs pretty warm, but I think they all do.Wall charger by Vinsic.", "overall": 5.0, "summary": "Fast charge for 2 devices at once", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
,{"reviewerID": "A2BLDAYY9Y9EYH", "asin": "B00KL806PK", "reviewerName": "CRB", "helpful": [1, 1], "reviewText": "What more than that can you ask for?  I'd buy this again.  It has total output of 2.4 amps so you can't charge two devices at high rate at the same time.  But I knew this before I purchased it and this meets my needs.", "overall": 5.0, "summary": "Works great, delivered on time, great price", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
,{"reviewerID": "A1EVV74UQYVKRY", "asin": "B00KL806PK", "reviewerName": "K. Groh", "helpful": [0, 0], "reviewText": "This is a small but solidly built two USB wall plug. What I like about it is not only tiny but the prongs fold in for storage. It has smooth, rounded edges as well so tossing around a purse or briefcase and it won't scratch other things.It worked well for charging most of my devices. It did my Samsung Galaxy S4 phone, Kindle Fire, another regular phone, and speakers. It did not charge my Samsung Galaxy Note 10.1 tablet but that is not unusual. It is pretty proprietary in the plug.Small and nicely built, a good product at a good price. I was provided a unit for testing and review.", "overall": 5.0, "summary": "Compact, Works Well", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
,{"reviewerID": "A1RPTVW5VEOSI", "asin": "B00KL806PK", "reviewerName": "Michael J. Edelman", "helpful": [2, 3], "reviewText": "Switching-mode USB charges just keep getting smaller and smaller. When my new iPhone arrived last year I was struck by how tiny the charger was, but now here's a charger about the same size, with the same capacity, for a quarter the price.My iPhone charger died a week after I got it. This charger has been charging my iPhone for half an hour, and it hasn't heated up at all. Is it better than the Apple charger? I don't know, but it seems every bit as good, and at a faction of the price, it's a much better deal. (Disclosure: I received mine as an unsolicited sample from the seller.)", "overall": 4.0, "summary": "Tiny, cheap, functional", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
,{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00KL806PK", "reviewerName": "Nuknuk", "helpful": [4, 5], "reviewText": "The Vinsic cube is almost identical to the size of the original Apple iPhone charger, except for a little chamfered edge on the bottom.  There are two main things it is better than Apple's own cube.  For one, it can charge two devices at the same time with the two USB slots.  The second, it has foldable prongs which is handy and ideal as a portable charger. Fold the prongs and throw it in your purse.  No annoying prongs.I notice it is becomes warm while charging.  So, far not really hot to alarm me.  The only remaining question is how durable will it be.A sample of this product was sent to me for review purposes.", "overall": 5.0, "summary": "Two advantages over Apple's own cubee.", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A17V9XL4CWTQ6G", "asin": "B00KMBM9T2", "reviewerName": "Chandler", "helpful": [0, 0], "reviewText": "Literally this little speaker can go anywhere--use it in the shower as the ultimate invigorating wakeup to hear your favorite tunes each morning (better than coffee!), take it with you camping or to the beach, put it on your bathroom mirror, use it in the car--you name it.Where you need a bluetooth speaker, you now have one.More importantly, the sound is clean and clear, even above a loud shower or outside, it's intuitive and easy to use so it makes a great gift.  The shape is unique as well, being a triangle--adds a modern flair.Speaker provided by Shop Smart", "overall": 5.0, "summary": "Waterproof bluetooth speaker with suction cup goes where you go, no wires", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}
,{"reviewerID": "A36K2N527TXXJN", "asin": "B00KMBM9T2", "reviewerName": "Dr. Bojan Tunguz", "helpful": [0, 0], "reviewText": "I have never been one to enjoy singing in the shower, but I always appreciated being able to listen to the music on the beach. This small and effective portable Bluetooth speaker enables me to partake in both of those activities, and so I&#8217;ve discovered the pleasures of listening to the music in my bathroom.The speaker is very well built overall, with the rubberized outer shell covering most of its top and bottom. It has a big suction cup on the bottom that allows you to attach it to the shower walls or other smooth surfaces. The suction cup works well for the most part, although you will need to keep reapplying some pressure to it over time in order to keep the speaker in place.The speaker was easy to pair up with my iPhone. Once it is turned on it becomes visible in the list of Bluetooth devices. I am not sure how easy it is to pair it up with other smartphones, tablets, and computers but my guess would be that it should not be much of the problem either.The sound quality was pretty good, especially for a device of this size. If you end up mostly using it in the shower room then there will be some entirely expected audio distortions due to the small size of the surrounding space. There are also limitations to the sound quality of any device that uses Bluetooth standard for the signal transmission, but unless you are a very strict audiophile this will not be much of an issue for you. The speaker is also not very loud, so if your shower tends to give off a lot of noise then the speaker's volume might get drowned. (No pun intended.)I&#8217;ve used this speaker in the shower for a few weeks and so far have not had any problem with the water damage. If, however, something does go wrong at some point I will make sure to update this review.Overall I am very pleased with this speaker. I would recommend it to anyone looking for a small and convenient speaker to be used in the very wet spaces.**** Product sample provided for review purposes. ****", "overall": 4.0, "summary": "Pretty Good Waterproof Bluetooth Speaker", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}
,{"reviewerID": "A2BYV7S1QP2YIG", "asin": "B00KMBM9T2", "reviewerName": "Dr. Oceanfront \"Oceanfront\"", "helpful": [1, 1], "reviewText": "The first thing I noticed about this speaker, is the shape. It looks a bit like a flying saucer, and high tech. It is one of my favorite looking speakers that I have received recently, because it has a low profile, and sharpe modern look.The packaging says the unit is waterproof to 10 meters, but I am not going swimming with it. However, if it falls into the bath tub by accident, it is good to know it will not die. :)The controls could not be simpler, and the sound is good. Playback time is 6 hours, the charging time is 3 hours.This is a great deal at this price point for a waterproof speaker, and I was pleasantly surprised.I recovered a test sample to review, but the opinion is all my own.", "overall": 4.0, "summary": "Nice little speaker..", "unixReviewTime": 1402704000, "reviewTime": "06 14, 2014"}
,{"reviewerID": "A1CSXI7MKL6UKR", "asin": "B00KMBM9T2", "reviewerName": "Kimberly R. Norton", "helpful": [2, 3], "reviewText": "This is a blue tooth speaker that is waterproof and designed to play while in the shower.  The speaker has a suction cup on its bottom that allows it to stick to the shower walls (or stick to just about anything).  The volume of these speakers, in my opinion, is not loud enough to be heard over the shower water.  I tested these speakers in the shower while listening to an audio book from audible streaming from my Samsung Note 2 phone.  Yes the volume can get loud but a shower can also be loud.Aside from using the product in the shower, this is a great product to carry around with you and use where ever you want to use it.  If you are outside and it starts raining, just put your phone in your purse then stream your phone's audio through these speakers and not worry about the water.  Of course you should not immerse this product in water but if a few drops hit it then it should be fine.The product comes with a 5V full sized USB cable (the other end is smaller and goes into the unit.  Once the unit is fully charged, remove from the power source.  Its build quality is pretty good too.  The speaker is extremely compact.  To power on the device you will need to hold down the ON/OFF switch for about 5 - 6 seconds.This is an excellent blue tooth speaker, just realize that the audio might be drowned out while the shower water is running.Based on the good price amazon is selling this product for and the fact that it ships Prime, I must say that this is a winner.  Just remember that amazon's prices are violative, and their prices can change daily.[sample provided]", "overall": 5.0, "summary": "Waterproof, but may not be loud enough while in the shower", "unixReviewTime": 1402704000, "reviewTime": "06 14, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KMBM9T2", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [1, 1], "reviewText": "Like the other reviewers before me I received one of these speakers as a review sample. Given the glowing reviews from folks whom I trust I am going to chalk mine up to a fluke. However, even though I am willing to give benefit of the doubt there are a few issues I have with it anyway.Here are the design errors that I have found and I do not attribute these to a lapse in manufacturing. First, the documentation is truly confusing. I did not need the instructions since I have used literally dozens of bluetooth devices, but a first time user is going to be frustrated. One example is the instruction that tells you to turn on the pairing button. There is no pairing button. It's a quick fix to correct that.The charging port is not waterproof by any stretch. In fact, I seriously doubt that it's moisture proof because the flap that covers the charging port is not a tight seal. Most waterproof charging port flaps on competing brands have a protruding rubber piece that inserts into the port, providing a dual layered seal. This has one too, but it's not tightly fitted to seal the port.Where I think mine may have been the victim of substandard parts and/or manufacturing are: the barrel connector does not stay in contact with the charging port. Any movement, however slight, will stop the charging process. Plus some of the buttons do not provide the level of tactile feedback that waterproof ones do. Some on this device do and some do not.General operation: it's not loud enough to compete with my shower, but the sound is very clear and the high, mid and low range frequency responses are very respectable.Bottom line: I am willing to concede that the manufacturing issues I listed are one-off flukes. However, there are some design issues that need to be corrected. When those are addressed this could be a five star speaker. As it stands, though, I cannot award it more than the three stars I gave (something I hate to do.) Hopefully version 2.0 will be significantly better.", "overall": 3.0, "summary": "Mine may have escaped QA, but it is needs improvement", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "ARBKYIVNYWK3C", "asin": "B00KMBM9T2", "reviewerName": "RST10", "helpful": [0, 0], "reviewText": "When it comes to Bluetooth speakers, 5 years ago you'd struggle to find one at any price. Now they are everywhere, at very attractive price points. This one is one of the most attractively priced, and it's functionality reflects that as well.Charging was not difficult, but it uses a proprietary USB cable that is not a standard micro-USB. It's a pain to keep a proprietary cable around for all the devices that decide to go non-standard. I was not pleased with this.Pairing was not difficult, though the name of the device was 4 numbers, no name or anything. I thought that was odd, and something simple that down-marketed the device in a way that was unnecessary and probably nearly free to correct.The speaker did play and operate easily and properly with a voice included in the unit to instruct you when to pair, when actions are happening or waiting, etc.The volume of the speaker wasn't as high as others I've used, and when the volume is near the top end it gets to a slight blare. This wasn't very pleasing.So in the end, is it a value that functions? Yes! But is there also some room for improvement? Absolutely.", "overall": 3.0, "summary": "Functional & affordable with room for improvement", "unixReviewTime": 1404604800, "reviewTime": "07 6, 2014"}
,{"reviewerID": "A3NEAETOSXDBOM", "asin": "B00KMBM9T2", "reviewerName": "Stephen M. Charme", "helpful": [1, 1], "reviewText": "I received this at no cost in exchange for writing a review. I like everything about this product. Here are my comments.1. This is a compact (each side of the triangle is 3 1/2 inches) and lightweight speaker that is perfect for use at home or on the road. It comes with a 2.0mm pin charging cable, which is becoming more common. I already have several so no worries if I misplace this one. It looks good, better in person than in the picture on Amazon.Note: There is no manufacturer's or seller's name on this product. Sometimes that indicates a mediocre product that nobody wants to put their name on, but that's not the situation here. To the contrary, this comes nicely packaged in a hard clear plastic case that can be used to store this product as well as the included directions and charging cable. This would definitely make a nice gift.2. This has a suction cup that is very convenient for attaching this speaker to a shower wall or bathroom mirror or any other surface. The suction cup holds this firmly in place but is easy to remove from the surface it is attached to.3. Pairing this could not be simpler. Press the power button and a voice announces that this is entering pairing mode. I found it immediately on my iPhone bluetooth menu. Once paired a voice announces this.4. The controls are clearly marked, large and easy to use. A short press is used for forward and reverse when playing music, and a long press is used to lower and raise the volume. There is also a play/pause button as well as a button to answer the phone.5. The sound is really good for a speaker this size. Very clear and distinct, no tinny treble and no muddy bass.6. This passed my waterproof test with flying colors. I put it on the shower floor directly under the shower spray for 10 minutes while I showered, and for good measure poured several cups of water right on it. It continued to work just fine.7. At this price point this speaker is an excellent value. It works just as well as more expensive waterproof shower speakers that I have tested.Bottom line: This speaker is an excellent value. I'm going to use it on my boat this summer because I won't have to worry if it gets splashed. This will be a lot more convenient than what I have been doing, which is connecting a cassette adapter to my iPhone and inserting it in the tape deck of my marine radio.", "overall": 5.0, "summary": "First rate waterproof speaker", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A3IL4WNBMGBJRY", "asin": "B00KMD91KK", "reviewerName": "Brian Smith \"Tough But Fair\"", "helpful": [0, 0], "reviewText": "The portable charger seems to be a growing category (are you listening cell phone manufacturers). As cell phones have gotten thinner and lighter, the battery life is just not what we need it to be. So, there is a need for a supplemental charge sometimes when you're out and about.  The Lifecharge Juicypack 2600 mah portable charger fills that need, but so do a slew of other &#34;lipstick&#34; chargers on the market.The device is simple and easy to use.  Mine is exactly opposite in color than the one pictured on Amazon (if that matters to you). It's blue on the outside and white on the inside.  It only has one port going out which is a low capacity, 1A port.  You cannot use this to charge a tablet like an iPad.For the simplicity, you give up some functionality. Given that these devices are used in &#34;emergency&#34; situations, you're not likely to use them often. Since they don't hold a charge forever, it's important to know when you throw it in your pocket how much of a charge it has. The problem with all of the lipstick chargers, not just this one, is they don't have a battery gauge on them.  So, you're likely to get out somewhere, plug this into your phone and find it has no charge.The product description on Amazon starts off listing Apple devices that this will charge. That is true. But, it will not charge them with the included cable. Apple devices have lightning connectors and this comes with a micro USB cable (as do most of these devices).  Someone needs to make one of these that comes with a lightning connector for Apple devices.", "overall": 3.0, "summary": "Meh.. it's OK", "unixReviewTime": 1402963200, "reviewTime": "06 17, 2014"}
,{"reviewerID": "A1U5XB6PCIDLIK", "asin": "B00KMD91KK", "reviewerName": "Dennis Waller", "helpful": [0, 0], "reviewText": "I worked in the field and require power for all the devices I use. Sometimes, I'll be miles from any power source and need backup external batteries that I can depend on. The external battery packs by Lifecharge have never let me down. In addition their versatility is as important as they work with all my devices, from cameras, laptop, to iPhones.I use the 2600 for keeping the iPhone and IPod charged and is powerful enough for me not to worry about them going dead. I use the 10400 for the more demanding devices like the laptop and cameras. Lifecharge external battery packs are an important part of our arsenal.Tough, rugged, durable are just a few of the words I can use to describe the device besides delivering the power when I need it the most. As an Author and Indie film maker, it is critical to have these on hand when working in the field and can testify that the battery packs by Lifecharge deliver when it counts", "overall": 5.0, "summary": "External battery packs by Lifecharge deliver when it counts", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "A18U49406IPPIJ", "asin": "B00KMD91KK", "reviewerName": "Deon", "helpful": [0, 0], "reviewText": "This battery pack might be small, but big enough energy to power any mobile devices.Having a 2600mAh battery places this battery pack in the lower range of battery packs. There is enough power to charge most cell phones once. I use it to charge my Note 2 and get three quarters of a full charge. Some might want more, but for its size it can not be beat.The size is very portable and can be easily slipped into a pocket or purse.The layout is very clean and simple with no moving parts. The design is great with two complementing colors of line blue and white. In the hand, it has a very solid feel, nice and sturdy. The size is similar to a large tube of \"Lipstick\".This battery will do the job to charge whatever you throw at it, and does it well. The best part is how small and powerful it is.I was supplied a sample for the purpose of review.", "overall": 5.0, "summary": "Powerful & Pocketable", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
,{"reviewerID": "A36K2N527TXXJN", "asin": "B00KMD91KK", "reviewerName": "Dr. Bojan Tunguz", "helpful": [0, 0], "reviewText": "There are many external batteries out there that can help you recharge your portable devices, and which one you choose will depend on your particular needs. This LifeCHARGE 2600 mAh external battery/charger is one of the smallest I&#8217;ve seen, both in terms of physical size as well as charge capacity. The battery looks similar in shape and size to an elongated lighter. The battery is charged from an USB port, and it comes with its own micro USB cable with several different charging attachments. You can charge it by plugging it into a spare USB outlet on your PC (slow), or by using one of the wall USB outlets from your cell phone or a similar device.I&#8217;ve been able to use this battery to fully charge a Samsung Galaxy S3 phone and iPhone 4S. It took me a few hours to charge both of those devices. In order to charge an iPhone I had to use my own iPhone cable &#8211; Apple is very restrictive when it comes to allowing third party manufacturers using their proprietary designs.Since this battery is very small it is ideally suited for an emergency backup charging. It can easily fit in your pocket along with your smartphone, although I wish that it came with a small bag into which to put it.This is neither a particularly stylishly designed nor remarkably well built external battery. It has a very utilitarian look and fee to it. It gets the job done, at least for now. I have not tested it long enough to see how durable it is in the long run, and if I discover anything noteworthy about that I&#8217;ll update my review.Decent small external charger, especially for the price.**** Product provided for review purposes. ****", "overall": 4.0, "summary": "Decent Small Emergency Battery Backup", "unixReviewTime": 1402099200, "reviewTime": "06 7, 2014"}
,{"reviewerID": "A2DG63DN704LOI", "asin": "B00KMD91KK", "reviewerName": "ESlayd", "helpful": [0, 0], "reviewText": "If you need a tiny battery pack, this is a good choice. It does the job fine, but you'll need the Apple cables because it doesn't come with them. Also note that it doesn't have LED indicators for the battery power. Both of these things being said, it is pretty inexpensive and did the job for me, so I'm happy with it!", "overall": 4.0, "summary": "Tiny power!", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "AT53ZTTO707MB", "asin": "B00KMD91KK", "reviewerName": "I Do The Speed Limit", "helpful": [0, 0], "reviewText": "Just what you need to fully recharge one phone, one time.  No bells, no whistles.  But you are not paying for any features that you won't use, either.  One feature that a 5-star, simple, convenient charger would have (and this four-star charger does not have) is a built-in USB cable.  With this portable charger, you will still have to lug around a cable.  Too bad:  A rubber band is so un-cool, but what else to do?It has two basic LEDs:  One is red and shows when the battery pack is charging.  One is blue that shows a fully charged battery pack.  Really, that's all you need if you are dealing with only one phone or small device and can get to a wall outlet or car charger before you need another fill-up.One tiny feature that I really appreciate, but don't often see on a charger:  It has holes at one end (not shown in any picture on this product page) so that you can insert a loop, so you can hang it.Now, if you need to recharge more than one phone at a time, buy a bigger unit.  A bigger unit will have a bank of four LEDs that will give you the status of how much charge is left for the next device that needs a fill-up.  A bigger unit will also weigh more.For those of you who do not like in-your-face logos marring the fronts of your possessions:  Notice that the Lifecharge logo is very big and bold and black.  It definitely detracts from the smooth lines of this design and the black ink on the bright blue plastic cheapens the look.One thing I noticed that was interesting--and may be why different people get different test charge results:  I charged it up the first time, until I got.the blue fully-charged light, then unplugged it, but did not use it.  Plugged it in a few hours later, and it showed a red not-fully-charged light.  So I left it plugged and in an hour it showed blue again.  I unplugged it and did not use it.until the next day.  I checked the charge, and it still showed blue.  So, for some reason, when charging for the first time, it did not accept a 100% charge.  The second time it did.  I'm no electrical engineer, so I don't know why.*I received a sample product from Lifecharge.", "overall": 4.0, "summary": "Basic, light-weight, simple", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A1M1Y5UGONAW06", "asin": "B00KMD91KK", "reviewerName": "Jody", "helpful": [0, 0], "reviewText": "I don't use my cell phone every day, and  I've pulled it out of my purse several times to find it dead.  A portable charger has become an indispensable accessory.  I won't be without one.The Lifecharge 2600 Mah Portable Charger means I won't be stranded anywhere.  Since I live in a small rural community, that's invaluable.  Flat tires, winter's icy roads, dead batteries are not things I ever have to worry about, as long as I have my Juicypack and AAA.It takes the charger about three hours to fully charge.  There are flashing lights that stop flashing when it's fully charged.  There is a USB cable included which will serve to charge the charger by way of a wall outlet charger, and will serve to charge an Android phone with the charger.  You'll need an Apple cable for an Apple device.  That should be no problem as most of us have way more charging cables than devices to charge.There's no way to tell how much juice is left in the charger, so you'll need to plug it in every so often to make sure it's fully charged.For less than $20, this gadget could mean the difference between life and death.  This is not a keychain gimmickry gadget.  I was provided a sample for review, but if Lifecharge wants it back, I'd purchase one.  It's well made, solid, and makes me much more confident about traveling lonely country roads.", "overall": 5.0, "summary": "Peace of mind in a small device", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "AYB4ELCS5AM8P", "asin": "B00KMD91KK", "reviewerName": "John B. Goode \"JBG\"", "helpful": [0, 0], "reviewText": "This 2600mAh charger is lightweight and handy. It will charge an iPhone more than once with a full charge. Because it's so small and light, you can slip this into your backpack or bag and have at least a full charge in case you run out. This is one of those new chargers that have protection against over charging and over heating. Overall a very useful external battery pack. Sample was provided for review purposes.", "overall": 5.0, "summary": "Nice!", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A2R1HUYHXV7H18", "asin": "B00KMD91KK", "reviewerName": "Kristi Gilleland", "helpful": [0, 0], "reviewText": "This is a cute charger that fits easily into a purse, without taking up a lot of room, or perhaps a dash or console in a car.  It's convenient if you are at work or on the go and your phone needs a charge.  I charged it completely for about a day, then later used it with my Kindle to take it from hardly any time left to a full charge. I used it to surf a bit while it charged and it took about two hours to get a full charge, which was about as fast as the wall for me, though my battery is getting older.The blue is a cute color and it does exactly what it is supposed to.  It's very basic- there's no flashlight on it and there's no charge indicator.  It would be nice to know how much of a charge is left - that is a feature on more expensive chargers that I have, but it's affordable and very mobile if you want to just be able to charge back up during the day.  It comes with a USB to micro cable.I received this as a sample for purposes of review.  I would recommend it if you need an affordable, very mobile, portable basic charger.", "overall": 4.0, "summary": "Fits into purse, good for a complete charge", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
,{"reviewerID": "A1UQBFCERIP7VJ", "asin": "B00KMD91KK", "reviewerName": "Margaret Picky", "helpful": [0, 0], "reviewText": "This nominal 2600 mAh power bank is small and easy to use.  It is only 3 1/2 in. long and has an eyelet that can hold a ring so it can be attached to a lanyard or keychain.  It is 2,600 mAh and will provide a practical 2,000 mAh,  more than enough to give a full recharge to a 1,440 mAh iPhone 5 or a 1,470 mAh Kindle Paperwhite. The body is tough plastic and a USB power cable and legible user guide are included.It is the most uncomplicated power bank that I have tested.  There is a red LED indicator while charging and a blue LED indicator when fully charged.  There are ports for power in and out.  There are no buttons or other complications:  just charge it by plugging the cable into the micro USB port and then plug an electronic device into the larger USB A port to automatically charge it.  This makes it ideal for youngsters or anyone who is not technically inclined.LifeCHARGE provided a power bank for evaluation and review.", "overall": 5.0, "summary": "Small, lightweight, and easy to use", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KMD91KK", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [0, 0], "reviewText": "This is more of a convenience than a tool for power users, but is still a serious tool. It has a relatively low capacity by today's standards, and is strictly a battery back up. Some brands include a built in flashlight, but those can be a two edged sword because it's easy to deplete the charge using it as that and not having back up for your phone when you need it. This model eliminates that.When I mentioned that this is relatively capacity I am putting it into the context of the high capacity batteries that seem to have flooded the market this year. Although it's low it can still add a lot of use time to your phone (or even tablet). I usually multiply claimed capacities of these batteries by .9 to get a more realistic charging capacity. That makes the review sample that I received is actually about 2340mAh. This accounts for losses from heat, charging cables and the charging process itself. Even with that you still get an additional 150% use time on an Apple iPhone 5S that its 1560mAh internal battery provides. I tested this on that phone, a Samsung Galaxy Note 3, and an iPad 2. This charger is about as fast as the OEM wall chargers that come with those devices.These batteries come with a charging cable and a no-frills indicator comprised of LEDs that simply indicate when it's charging and when charging is complete. It took me about seven hours to fully charge mine. It does come with a cable for charging the unit itself, and the cable can be reversed to charge any device that accepts a micro USB connector.Power users will probably scoff at this battery, but if you are among the 95% of use who need extra capacity only occasionally this is not only more than adequate, but compact enough to fit a purse or pocket. If you need something with more capacity I suggest checking out theLifecharge Juicypack 10400mAh Portable Charger.", "overall": 5.0, "summary": "A major convenience with no frills", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "A1ODOGXEYECQQ8", "asin": "B00KMD91KK", "reviewerName": "Nuknuk", "helpful": [0, 0], "reviewText": "If your cell phone battery seems to be running out of juice faster than it was before, an external battery pack can be a great immediate solution.  The Juicypack 2600 is one of the lipstick types, pretty small and extremely portable but can provide a full charge of emergency battery when you need it.  Just do not forget your phone's cable.You can recharge it in two ways.  Using an AC USB adapter, which is the faster way, or through your PC's USB slot.  To charge your phone, simple plug your phone with its USB cable the the battery pack's USB slot.  No need to press a button as it automatically starts charging once connected.It is interesting that this battery pack has a lanyard hole but no lanyard included.The Lifecharge 2600 comes with a white microUSB cable and a short user's guide.", "overall": 4.0, "summary": "A full days charge in your pocket", "unixReviewTime": 1402704000, "reviewTime": "06 14, 2014"}
,{"reviewerID": "A1CMD08Z49PGKQ", "asin": "B00KMD91KK", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "A useful emergency power backup for your cell phone.  My wife is using this as an emergency backup for her Nokia.  Kept in the purse it provides backup while she is at work.  She can plug her phone into this as she continues to make her rounds.  With a mobile work life she can not just sit down and plug it into an outlet.I received this for free.", "overall": 5.0, "summary": "Useful backup for your cell phone.", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "AQ2FC1DLKVD8H", "asin": "B00KMD91KK", "reviewerName": "P. McWhorter", "helpful": [0, 0], "reviewText": "I often find that if I am using my smartphone heavily, the battery will not last an entire day. I find myself no where near a plug and have a dead phone of my hands. In such cases carrying reserve battery power is a must. This LifeCharge 2600 mAh is a nice reserve battery to top off the charge on your smartphone. At 2600 mAh, it has the capacity to completely recharge many smartphones. The nice thing about this is that it is compact in size and will easily fit in your pocket. I like this for daily use, as it is easy to carry around in your pocket.If you are hiking, camping or other activity that would take you away from power for more than 1 day, I would recommend considering a larger unit, like the LifeCharge 10,400 mAh unit. However, if you just need to periodically top off your charge, then this 2600 mAh unit is just the ticket, as it is small, compact, and easy to carry.(NOTE: I was provided a sample for review purposes)", "overall": 5.0, "summary": "Compact Reserve Power", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A2NOW4U7W3F7RI", "asin": "B00KMD91KK", "reviewerName": "rpv", "helpful": [0, 0], "reviewText": "Lifecharge Juicypack 2600 mAH portable charger comes in a unique smallish design for everyday travel. The two charging indicator are great for charging and fully charged.I tried charging- Samsung Galaxy S4 phones- Olympus Voice Recorder- A 4.5&#34; SmartphoneThe microUSB is used to charge this powerbank and the USB itself to charge other devices. The charge will hold enough to power a Samsung Galaxy S4 once.I tried charging Samsung from no charge to 100% and following is time it took approximately for each of 10 minutes.10% = 7 minutes20% = 8 min30% = 9 min40% = 10 min50% = 11 min60% = 13 min70% = 14 min80% = 15 min90% = 19 min100% = 22 minSample provided for a fair and honest review.", "overall": 5.0, "summary": "Very portable and handy", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
,{"reviewerID": "A2NB2E5DXE319Z", "asin": "B00KMD91KK", "reviewerName": "S. Lionel", "helpful": [0, 0], "reviewText": "The Lifecharge Juicypack 2600 mAh charger is small and light enough to be easy to carry wherever you need it. There are no controls - just plug in a USB cord (a short one is included with a MicroUSB plug on the other end which can be used either for charging the battery or powering a device) and it turns on. I found it was rather slow in charging my iPhone 5S, at about 2W, but with the smaller capacity I would not expect a higher charging rate. It did the job, though I found it took a long time to recharge the pack itself. The manufacturer sent me the charger and asked for a review.", "overall": 4.0, "summary": "Compact power when you need it", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A3NEAETOSXDBOM", "asin": "B00KMD91KK", "reviewerName": "Stephen M. Charme", "helpful": [1, 1], "reviewText": "I received this at no cost in exchange for writing a review. Here are my comments.1. This is a basic \"lipstick\" charger that comes with a micro USB cable for charging.2. The back of the box says a full charge time is 6-8 hours, which is pretty long for a unit with such a small output.3. I fully charged this, then used it to charge my iPhone 4S from 70% to 96%, which took an hour. Acceptable, but not impressive.4. My main issue with this charger is that there is no way to know how much of a charge is left. There is no button to press to make the two indicator lights go on. Inf fact the indicator lights didn't go on at all while I was charging my iPhone.So after I charged my iPhone 4S I had no way to know how much of the charge in this unit had been depleted. To me that's a serious design issue. I'm not going to carry a charger that I can't randomly check to see how much of a charge is left.Bottom line: This works, but unless you charge it daily, you can't be sure how much of a charge is available should an emergency arise.", "overall": 3.0, "summary": "No way to see how much of a charge is left", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
,{"reviewerID": "A3F2VVIQIY6U64", "asin": "B00KMEPUI6", "reviewerName": "Armando N. Roman", "helpful": [0, 0], "reviewText": "Sometimes just having a charger cable for your phone or tablet just doesn't cut it. You aren't always near a wall socket or something else that can charge it, and if there's an emergency or you need to get something done, the situation seems hopeless. With a reliable external battery though, you're all set, and that's exactly what the Lifecharge Juicypack is. This is the first external battery I've used, and I've been impressed with how it's performed so far. The only device I've used with it is my Samsung S4 Mini, which went from 8% to 100% in a little over two hours. That's a huge difference from when I charge it through my computer, that's for sure.I'll be honest and tell you right now that I don't understand what all the numbers associated with this thing stand for. 16800mAh seems to be at the top of its game though. The charger features two USB ports: 1amp and 2.1amp. According to the instructions, one's for tablets and the other's for phones. Between the ports is a micro USB cable port for you to charge the unit itself. Also included on the same side as the ports is a little LED flashlight, activated by pressing the power button twice. It's not that strong, but still has its use like trying to find ports on a computer in a dark area or something.The LED display on the charger is great, and shows you how much power is left in the unit. This thing takes a while to charge. Right out of the box it was at 68%. I had it charging through a computer for 2 hours and saw that it was at 75%. Fully charging it once it's reached zero is going to take some time.Size-wise, the Juicypack is great. It's just 12 ounces, and isn't much bigger than the average phone. It's well-built and solid. The only concern I have is that mine was brand new, yet had scuffs all over the metallic border around the LED display. Maybe I just somehow got a refurbished one? It's also worth noting that you'll get over 500 recharge cycles with the unit. It might not sound like -that- much, but it's more than enough since, if you're like most people, you'll be charging your device the regular way. Don't use this just because it's convenient!All in all, I highly recommend this battery to anyone who's going to be going on a trip somewhere as an emergency backup option, or just to have in your car just in case. It's just a few bucks more than the standard version that doesn't have the display screen, so why not spend the extra money?", "overall": 5.0, "summary": "More useful than a pack of Juicy Fruit.", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "AVPNQUVZWMDSX", "asin": "B00KMEPUI6", "reviewerName": "esanta \"esanta\"", "helpful": [1, 1], "reviewText": "I travel a lot, and keeping power-hungry devices working during long international flights is always a challenge. Over the years I have purchased a wide variety of power packs, which all did a reasonable job at keeping my phone charged. The highest capacity ones were even able to recharge the iPad 1 almost fully. However, things got bad when I upgraded to the iPad 3, which is an incredible energy hog, so I was eager to see how the Juicypack performed.The Juicypack is a little bigger than a portable hard drive (3&#34; x 5 3/4&#34; x 7/8&#34;) and hefty (12.5 oz). The case is made of black matte plastic with a white edge surround. The top features two USB connectors (2.1A and 1.0A), a microUSB connector for charging, and a white LED. A power button on the right side turns on the power and toggles the very bright LED. Finally, a backlit LCD display in the front reports usage and percentage of remaining battery power. The package contains the battery pack and a USB to microUSB cable, which can be used for charging the Juicypack as well as powering a device.I ran a test by first fully depleting the battery on my iPad 3 (I played movies until I got successive low battery warnings, 20%, 10%, 5% left, and then the iPad shut itself down) and fully charging the Juicypack.I then plugged in the iPad into the high power charge port and waited until it reported 100% charge. When it was done, I was floored to find out that the Juicypack reported 48% capacity remaining. Looking at the numbers (the iPad 3 battery capacity is close to 12,000mAh) and taking into account the necessary loss of power during conversion and charge, it's likely that 48% is a little optimistic, still the simple fact that the Juicypack was able to give the iPad 3 a full charge and have power left to spare is extremely impressive -- none of my other chargers has been able to do that, except the amazing but much more expensive Zendure A6 (which is not yet available on the market anyway, I bought mine by backing the Kickstarter project)Now, you will be able to find here and on ebay battery packs that advertise much higher capacities (22,000mAh) for a third of the price of this unit. I urge you to pass up on these -- they do not deliver anywhere near the amount of power they advertise, and do not last.PROS---------- MASSIVE amounts of power on the go- quality construction- convenient numeric display of percentage of charge remaining- built-in flashlightCONS---------- Charging is slow, it can take up to 10 hours if the battery is fully depleted- Heavy (but it has to be to pack so much energy)THE VERDICT--------------------A very impressive and capable battery, one of the best out there. The iPad 3 test was enlightening! If you travel with power-hungry devices like tablets, it belongs in your gadget bag. Very highly recommended to all road warriors and nerds.(I was provided a free sample in exchange for a fair and unbiased review)", "overall": 5.0, "summary": "The first battery pack to tame my iPad 3 (with lots to spare)", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "A215WH6RUDUCMP", "asin": "B00KMEPUI6", "reviewerName": "Jamie Wilson \"Shilom\"", "helpful": [0, 0], "reviewText": "This is a super conveinant charger/battery that snaps right onto your phone, easy cheesy!  Fast charge and also doubles as protection should you drop your phone.  Highly recommended!I was gifted the above charger for my unbiased review.", "overall": 5.0, "summary": "Portable and Pops right on!", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AL5GX3Y4LRHK1", "asin": "B00KMEPUI6", "reviewerName": "Mr. Schnoodle", "helpful": [0, 0], "reviewText": "I can't comment enough on this.  Sooo many times have I found myself in a podunk pitiful airport that hasn't been updated to the 21st century and our electronic needs, to find my phone almost dead.  Either tripping over the folks sitting along the pathways who have discovered the 2 sockets just outside the elevator and finding myself desperately looking for another...This occasionally happens on road trips in the car as well.BUT I think you get the picture...HOWEVER, this is a lifesaver (conveniently named Lifecharge)!  It's holds a massive amount of charge.  I've charged my phone (Iphone) and a friends phone (Blackberry) several times, left it sitting for 2 weeks and it's still has 42% more &#34;juice&#34; in it.  Heck I could probably start my little car with it.Anyways...There are two USB out ports and 1 universal mini USB in port.  I would pack this in a backpack or briefcase as it's got a good weight to it so it's a no go for the handbag (unless your in a hurry).  Nonetheless, it's as versatile as heck.  I'm not a gadget collector and I don't have tons of electrical stuff, BUT when my phone loses it's juice, I will panic looking for a way to charge it.For those of you who use a menagerie of electronics, I would say this piece of equipment is worth every penny to keep you charged up and going.FYI...I received this product from the manufacturer in lieu of a fair consumer review.", "overall": 5.0, "summary": "Lifecharge can be a Lifesaver...A great gadget to invest in:)", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A3QVAKVRAH657N", "asin": "B00KMEPUI6", "reviewerName": "Orrin C. Judd \"brothersjudddotcom\"", "helpful": [0, 0], "reviewText": "The power pack field must be awful;ly competitive these days, because we're frequently offered samples to review.  But this is, hands down, the best we've ever tried.Our 12-year old son is the techie of the bunch and inquisitive as all get-out, so he's always the first to try new equipment.  Aftyer his first charge on this unit he came racing in to show me--on the very convenient and easy to read LED display--that the pack still had 90% of its power left and, in his words &#34;charged his iPod crazy fast.&#34;It is bigger than other units we've sampled, but no bigger than an old transistor radio or Walkman : about the size of your hand.  It's slightly heavier too, though nothing like to heavy for travel.  If you put it in a pants or jacket pocket you'd notice it.  Tuck it ion your luggage or backpack and you won't.It has two USB ports for charging your devices and you charge it off of your pc or plug in via an included micro USB cable.It's a winner.", "overall": 5.0, "summary": "The Standout in a crowded field", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A2Y1WSEDSXTYU6", "asin": "B00KMEPUI6", "reviewerName": "Richard Kenyada", "helpful": [1, 1], "reviewText": "Over the past few years, I&#8217;ve reviewed several external batteries &#8211; each with its own favorable features and power capacity. The LifeCHARGE Juicypack 16800mah should be considered at the top of the list. It&#8217;s LED power percentage readout sets it apart from other external batteries, because you can see in an instant your power reserve. That&#8217;s golden on the road. I also love the size of this unit. It fits the hand well, and it&#8217;s sleek enough to slide into a slim briefcase without looking like a smuggled brick. Granted, the Juicypack is not the most powerful external battery out there, but what it lacks in power it makes up with smarts, intuitive design and two outputs to charge the devices I use most often &#8211; my iPhone and iPad. Quality is built into this product with protection against overcharging, as well as 500+ recharge cycles over the life of the battery. Highly recommended!(A sample was provided for me to render an unbiased review)", "overall": 5.0, "summary": "Smart Power!", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
,{"reviewerID": "A3LBTC13EYE4MS", "asin": "B00KMEPUI6", "reviewerName": "Sinohey \"scribe\"", "helpful": [1, 1], "reviewText": "This dual port portable power bank is a beast that delivers 16,800mAh to mobile phones and tablets simultaneously through two ports (1amp & 2.1amp). It is sturdy, relatively compact, well constructed of aluminium in an elegant and attractive design. At 7.75\" x 3.1\" x 1\" (146mmx77mmx23mm) size and weighing 12 oz (340 g), it is more suited to carry in a bag/attache than in a pocket.A large clear LED display indictes the level of power within the unit, which takes 6 to 8 hours to full charge - my device charged to 100% after 6.25 hours when connected to wall plug. It took 4 hours to fully charge a Samsung Galaxy Note 3 and an iPad 2 simultaneouly. Only a 2USB to microUSB cable is included (in the easy to open clam shell box). An added bonus is a small narrow beam LED located between the ports that is activated by pressing the \"ON\" button n the side.Compared to similar power banks in its category it is heavier, priced relatively higher, and lacks different cords/adapters to fit the various devices it purports to charge. Personally, I like it enough to include it in my everyday electronic armamentarium.A complimentary sample provided for review.", "overall": 4.0, "summary": "It is sturdy, relatively compact", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00KMGHPYQ", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [0, 0], "reviewText": "Very nice, inexpensive screen protector for your iphone 4,4s. Can't tell the difference between my actual screen and this. Goes on easy and bubble free! Super easy to install and lays completely flat and stays where you put it! Hasn't shattered and protects my screen completely! Great product!", "overall": 5.0, "summary": "Best type of screen protector you can get for your iphone 4, 4s~", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A9PG9ODPPP31N", "asin": "B00KMGHPYQ", "reviewerName": "Beth Chrisinger", "helpful": [0, 0], "reviewText": "Fit the phone perfectly, Product was just as described. Would buy from again.", "overall": 5.0, "summary": "Great Product", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1YMNTFLNDYQ1F", "asin": "B00KMGHPYQ", "reviewerName": "eyeused2loveher", "helpful": [0, 0], "reviewText": "Love it, makes my Iphone 4s shatterproof, very useful when kids are playing with phone. Also it fits perfectly. love it and great value!", "overall": 5.0, "summary": "Nice tempered glass!", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A3JI7QRZO1QG8X", "asin": "B00KMGHPYQ", "reviewerName": "Joyce M. Davidson", "helpful": [0, 0], "reviewText": "Wow!  This is fantastic. I was a little skeptical when I ordered this because I have had several different screen protectors for my iPhone 4s and although they all protect my screen from scratches, I ALWAYS have at least a few bubbles and they drive me crazy. I know bubbles are better than scratches but I wanted clear and clean as well as protected and now I have it. This is tempered glass, it LOOKS and FEELS exactly like the real phone screen. It was the easiest screen protector to apply, I'm still amazed by it. I cleaned my screen with the microfiber cloth it came with and then used the dust sticker it came with to be sure it was really clean. I then applied the white raised button sticker as my iPhone is white(it comes with 2 a black one and a white one ,nice surprise)I pulled back the sticker half way and lined up the speaker hole at the top and slowly pulled the sticker down until it was off and right before my eyes instantly I could see the sealing occur from top to bottom. NOT one single bubble. Amazing!!!  I've used it all day today and my screen is so clean, sharp, clear and free from finger prints. The best part is this screen protector is shatterproof so the protection is at a much greater level than the plastic ones. Great protect. I absolutely recommend this to anyone with an iPhone 4, 4s or 4g needing a screen protector.", "overall": 5.0, "summary": "Fantastic", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2HT05OASZO53B", "asin": "B00KMGHPYQ", "reviewerName": "Margo J. Jablonski", "helpful": [0, 0], "reviewText": "This  screen protector works greatIt was very easy to apply ,fits great ...no  bubbles.....all I wanted  and more ....no more oily prints on my screen now...........shipping was very fast with my Amazon prime ,arrived packed well......", "overall": 5.0, "summary": "great product", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A1Y3FEUELH3FTI", "asin": "B00KMGHPYQ", "reviewerName": "Onlinesalesgirl", "helpful": [0, 0], "reviewText": "This is magnificent! Easy to install, Must have! Wish I had this sooner. Brilliant product, comes with everything to place perfectly and alcohol swab to clean so it attached perfectly!", "overall": 5.0, "summary": "A++ for Iphone", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A25C2M3QF9G7OQ", "asin": "B00KMRYSQ8", "reviewerName": "Comdet", "helpful": [0, 0], "reviewText": "This is a nice variation of the typical powerbank in that it can be recharged using solar power. It has its limitations, however &#8211; recharging only by solar is very slow and can take several hours to build up a decent charge level. But if you don&#8217;t have access to power, such as while camping or in an emergency situation, any ability to recharge can be hugely helpful.The overall build quality seems very good. It has a good heft to it, and it is encased in a water resistant frame that is also shock resistant. The input and output ports are covered with rubber flaps to keep out dust and moisture. I really like that the flaps are attached to the body to prevent me from losing them.The overall size is pretty compact. It&#8217;s just shy of 3 inches wide and about 5.5 inches long. It&#8217;s very thin (about  inch thick) making it pretty convenient to take along in a backpack or even a large pocket. It comes with a clip ring so you can hang it on a strap on a backpack.The output ports (2 of them) are located on the top on either side, and provide a 1A output. There&#8217;s also a micro USB input port for conventional recharging. It has a 4 LED &#8220;gas gauge&#8221; to show the power level remaining.No complaints at all regarding performance. It recharged my phone and mp3 player without a problem, and still had about 50% capacity remaining. The 5000mAh capacity means this is best for small devices but, in a pinch, you can also use it for a larger device, such as a tablet, albeit the charge speed will be slow and you probably won't be able to fully recharge the device before the powerbank is empty.While it&#8217;s priced higher than a conventional powerbank of the same size, the solar recharge option makes this a better choice if you&#8217;re looking for something that can be carried along for camping or hiking, and still maintain the ability to recharge it even when there&#8217;s no power.[Sample provided for review]", "overall": 5.0, "summary": "Good option for emergency situations", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
,{"reviewerID": "A2R1HUYHXV7H18", "asin": "B00KMRYSQ8", "reviewerName": "Kristi Gilleland", "helpful": [0, 0], "reviewText": "I like the way that my charger looks - the blue is a pretty light blue that matches several of my other phone accessories.  It comes with a 10 inch cable (not including the ports) and an adapter that you can use to make the USB mini-port turn into a USB to I-phone adapter.  I put it in the window and it charged up , to full, a little green light came on and when I plugged it into my Kindle, all 4 blue indicator lights came on and it charged my Kindle completely as fast as if I'd plugged it into the wall.The solar panel looks durable and nice - it's not shiny and cheap looking like some are- it's more matte and it's tight without a lot of cracks so it is rain-resistant.  This is actually the first solar cell I've seen out of a material that is matte like this - I like it a lot.  Most are shiny and a bit static-y and attract dust, this one doesn't.It comes with a hook so you can hook it on a backpack or purse.  It has 2 usb ports and a mini-port in in case you want to charge it with the wall.  I've only used the solar charge so I can't say how it works on AC.There's also a small LED flashlight.  It's not big, but it's helpful to find keys or unlock a door in the dark.  To turn it on, just tape the power button twice.  It turns off the same way.I was given a sample for purposes of review.  I do like and would highly recommend it.  It's very stylish and pretty, and it absolutely does what it is advertised to do, easily without any effort- just put it in the light, and it charges and works.  It's very simple.", "overall": 5.0, "summary": "Very pretty!  Working great!", "unixReviewTime": 1403568000, "reviewTime": "06 24, 2014"}
,{"reviewerID": "A35Q0RBM3YNQNF", "asin": "B00KMRYSQ8", "reviewerName": "M. Hill", "helpful": [0, 0], "reviewText": "This charger provides emergency solar charging when no other power source is available. The approximately 5.5 by 3 inch device is a 5000 mAh portable battery that is normally charged using its micro USB port and the included cable connected to any full size USB power port. It will take 5 to 7 hours to achieve a full charge in this manner, with the four blue LED lights showing progress in 25% increments. Once fully charged, the device can fully charge two USB devices at the same time using the two USB ports, one on each side of the handle. It charged my almost fully depleted iPod 5 in just over a half hour and showed 50% capacity remaining.There is a single green LED to indicate when the battery is charging from sunlight, which goes off when complete. When solar charging is used to recharge the battery, the matte finish solar panel that covers the front of the unit only generates 200 mAh which is about a 1/20th of what a normal USB connection would provide (4000 mAh), so it would take several days in the sun to achieve a full charge from a complete discharge. The solar capability provides an important backup lacking in conventional auxiliary battery devices.I actually had an occasion when I needed to make a call and found that both my phone and battery pack were out of juice. With this product, you can be sure that it will never be completely discharged by giving it time in the sun each day, and even if it is completely discharged, a little sunlight will get you enough charge to make a phone call. Don't leave it in a closed car in direct sunlight, however, because it will not work in temperatures over 113 degrees Fahrenheit (45 degrees Celsius).Along with its emergency solar capability, the charger has an attractive rubbery liner surrounding the solar pane l and covering the back. The USB ports are concealed behind rubbery hatches and contribute to making the device dust and water resistant. There is a small oval opening in the rounded top in which the included carabineer can be attached for ease of transport. The charger has a smart combination of handy features -- handsome, powerful, lightweight, water, dust resistant, compact, and rugged.A power cord is included (USB-A to micro USB) and an adapter was provided to fit iPhone 4/4S phones. Solar charger provided by eBoot.", "overall": 5.0, "summary": "eBoot 5000mAh Solar Panel Charger", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00KMRYSQ8", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [3, 3], "reviewText": "When I received a review sample of this battery pack I tested it out of the box. Mine arrived close to one hundred percent charged, so I was able to at least test the simultaneous charging capability by connecting my Galaxy Note 3 phone and Tab 3 10.1 tablet. Both were in the ninety percent charged range and both were at one hundred percent in less than thirty minutes.Of course, the key feature is the ability to recharge the 5000mAh battery in this unit using solar energy. After I discharged the battery to about fifty percent (indicated by two remaining lit LEDs) I tested that capability. Even on a slightly overcast day it took about ten hours to charge it up the remaining fifty percent. Not bad to be honest.There is a charging port that allows you to more quickly charge this from a wall or car charger. That process can take five to seven hours, but it's a major convenience when you are preparing for camping or otherwise going off the grid.Some of the features that impress me about this battery is it's designed to be water and shock proof. More importantly, the status lights show at a glance the capacity (in twenty-five percent increments), and the charging state from either solar or wall power sources. For me it's reassuring to see the light indicating that the unit is, in fact, charging up via solar.I will not say that it's indestructible, but it's definitely sturdy and will withstand a lot of abuse in a harsh environment. For that reason, and because it works per claims made in the product description, I am giving it five solid stars. It's in my vehicle as an emergency item just in case.", "overall": 5.0, "summary": "Well thought out design for camping and harsh environments", "unixReviewTime": 1403740800, "reviewTime": "06 26, 2014"}
,{"reviewerID": "A22CW0ZHY3NJH8", "asin": "B00KMRYSQ8", "reviewerName": "Noname", "helpful": [1, 1], "reviewText": "I took the eBoot solar charger power bank with me on a week long camping trip.  Our cabin was devoid of electricity, so I relied on this power bank.  Instructions note that the solar charging is just for emergencies, that it should not be left in the sun for prolonged periods of time.  I had to wonder what a consumer would expect buying a solar charging power bank if it weren't to be be left in the sun.  How long is too long?  So, I left it out to charge.  Seeing that the battery level was not moving up above one bar, I did what any normal person who doesn't read instructions would do and left it out all day, every day.  After a full day of bathing in the sun (sometimes shaded by trees but I tried to move it to full sun when I saw that), the power bank has enough juice to give my HTC One a 10% charge.I've had experience with larger solar chargers, so I didn't expect much more, though I did hope for it.  Even three and four panel fold-up chargers take a bit of time to fully charge a 5000 mAh power bank.  This power bank is the size of a large cell phone.  There just isn't enough surface area to catch the solar energy.  Instead, we can charge this power bank with a USB cable, which is what I do most of the time.  When it's fully charged, I can give my HTC One a 100% charge.This is a rugged power bank.  The ports are covered, and there's a carabiner for hanging off a backpack.  It's good for camping, but don't rely on the solar panel.  If you have an emergency and wait all day, you can get enough power from the sun to charge your phone, search for a signal and call for help.This product was provided for review by eBoot.", "overall": 4.0, "summary": "Real World Test on Camping Trip", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A390XPHE9J7DBO", "asin": "B00KN9UBYI", "reviewerName": "AIMEE A TAYLOR", "helpful": [0, 0], "reviewText": "I just put this in my keys and it works from a good area away from my phone", "overall": 5.0, "summary": "Easy To Use", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00KN9UBYI", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [0, 0], "reviewText": "This is such a fun device to have around. I hate having to contort or run to push to stinking camera button on my phone. This thing works like a dream, both on my Galaxy S5 and my Husband's iPhone 5c.  Fast and perfect and easy to see and easy to pair. Will be using this more and more and can't stop playing with it.", "overall": 5.0, "summary": "Great Portable Shutter for your phone! Works like a charm", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A1W9OSF4ZWL94R", "asin": "B00KN9UBYI", "reviewerName": "Beth Jenner", "helpful": [0, 0], "reviewText": "I don't know how I took pictures before I got this it is such a great product...would make a great gift for any picture takeer", "overall": 5.0, "summary": "... pictures before I got this it is such a great product.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A7WCB7DDU6J5Z", "asin": "B00KN9UBYI", "reviewerName": "Chelsea B", "helpful": [0, 0], "reviewText": "Such a fun product for selfies and group photos. I love that it can be used with a lot of iPhone models, even some Android models.  I got the blue color and I love it.  Overall, I am very happy with this product. Great price, quality and value.", "overall": 5.0, "summary": "Great for selfies and group photos!", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "A21T5C3KL41REL", "asin": "B00KN9UBYI", "reviewerName": "galbarran", "helpful": [0, 0], "reviewText": "This is such a cool little product!  My kids like to use this to take selfies on my phone.  Very easy to use, if my 8 year old figured it, anyone can.", "overall": 5.0, "summary": "Cool Product!", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A1XLK1JAEFAN9I", "asin": "B00KN9UBYI", "reviewerName": "jjdraheim", "helpful": [0, 0], "reviewText": "Great packaging! Nice quality remote. This was super easy to use with my iphone. We were able to take lots of group pictures at our family picnic without leaving anyone out. Genius!!", "overall": 5.0, "summary": "Genius!!", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A537XC69FAD3J", "asin": "B00KN9UBYI", "reviewerName": "L Green", "helpful": [0, 0], "reviewText": "What a really awesome little gadget - really easy to use and super fun!", "overall": 5.0, "summary": "very cool!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A1Y3FEUELH3FTI", "asin": "B00KN9UBYI", "reviewerName": "Onlinesalesgirl", "helpful": [0, 0], "reviewText": "This is really cool! super easy, works great coming from a photography buff, this is super cool and a must have!", "overall": 5.0, "summary": "Super cool, must have!!", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "AWHZOUIQ0VO7M", "asin": "B00KN9UBYI", "reviewerName": "Richard N", "helpful": [0, 0], "reviewText": "Very fun and easy to use - takes great selfies!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A1KQNP8MOJDJKC", "asin": "B00KN9UBYI", "reviewerName": "RS", "helpful": [0, 0], "reviewText": "I love this product. As somebody said necessity is the mother of invention. Being a fashion blogger myself & given the selfie trend, i can imagine how this product was much needed in the market. I love the blue color, now I can take a selfie with more perfection. The product is user friendly. arrived in no time & are very nicely made, very durableI'm also a fashion & beauty blogger at www(dot)letsdollup.com", "overall": 5.0, "summary": "Great product : necessity is the mother of invention", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A2I8KUDXTC9WYI", "asin": "B00KN9UBYI", "reviewerName": "theresa", "helpful": [0, 0], "reviewText": "This is really Cool! I love it.  It is so easy to use and now I am not let out of the family pictures anymore.  Great invention.  It was so easy to set up, it fits in the palm of my hand it is so easy to use.  It paired very easy with my phone and was ready to use in seconds.  I am very happy with this purchase and will be buying more for gifts.  I highly recommend this product.", "overall": 5.0, "summary": "This is really Cool!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A3AHOSISKNBLZ6", "asin": "B00KN9UBYI", "reviewerName": "Tonya S", "helpful": [0, 0], "reviewText": "What a great device!!  I am always taking family photos and now I can be in them.  I took a great picture with my kids yesterday.  I can also see me using this a holiday parties or even landscape pictures when we are camping!  Now I don't have to worry about camera shake when I take a photo with my phone.  I love it!!  Its a cool little device!!", "overall": 5.0, "summary": "Perfect for taking great photos with your phone!", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "AAOYA0DKWED4W", "asin": "B00KN9UBYI", "reviewerName": "WombatComputing", "helpful": [0, 0], "reviewText": "This is really a unique idea. To be able to take a photo from your phone when you're a few feet away. It's as good as a regular camera and works well. You don't install anything. It's simply a button like you would press if you were near your phone. It works over bluetooth, so easy to use and easy to pair. A really unique device.", "overall": 5.0, "summary": "An In genius Idea", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A3PC3AQ9M9TNRF", "asin": "B00KNOGK48", "reviewerName": "Al", "helpful": [0, 0], "reviewText": "I've been using this BT013 Aukey Bluetooth Speaker for about a week now and so far it is working wonderfully.I love how this speaker has a unique look compared to the every day round/hamburger speakers.Please checkout the pics I uploaded!Charging time only took an hour when I received the speaker. (charging by USB)The quality of this portable speaker is excellent. The bass is decent as well for it's size.I used it with my Samsung Galaxy S4 and iPhone 5 without any issues at all and easily paired.Sound quality wise, it was much better than my friend's SHARKK Portable Bluetooth 4.0 Mini Speaker.The packaging provides cushioning from all around the speaker itself.Contents:SpeakerCarrying PouchAux cableCharging Cable (micro usb tip)Manual (of course)The speaker itself looks great.It has rubber feet at the bottom to prevent slips.The volume button/pause/play buttons are easily accessed on the side of the unit.Power switch/Charging port/Aux ports are nicely hidden in the back.Blue led lights up in the front to show it is ready to pair with your smartphoneThe volume of the speaker allowed it to be heard even in the next room.Will be blasting music with this and watching movies/shows also.Overall, this speaker does great for it's size and works great.Hope this is helpful to ya!", "overall": 5.0, "summary": "Sounds great for it's price and workin well!", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A1D5R07XQ8ZQSB", "asin": "B00KNOGK48", "reviewerName": "Andrew W", "helpful": [1, 1], "reviewText": "When I first received this speaker I could not realize how small it was. The speaker comes with everything that is needed including a micro usb charging cable and an 3.55m auxiliary cable. It also comes with a nice pouch for traveling. The range and sound on this bluetooth speakers are amazing. I was able to move from my living room to the kitchen and the sound was not distorted. The sound for the size and price is great. Like other reviewers said the sound will not replace expensive wired bluetooth speakers but for the price you can not beat the sound quality. The speaker is able to hit all types of sound with pretty decent quality. The speaker plays a sound when you connect your phone to it so you know it is connected. The speaker itself also has a pause and previous and next button so you can control your phone's music directly from the speaker itself. Overall this is a good buy!", "overall": 5.0, "summary": "Great sounding portable bluetooth speaker", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "A14RPY0DV96EG4", "asin": "B00KNOGK48", "reviewerName": "Bob", "helpful": [0, 0], "reviewText": "I just got the Aukey Gemini Portable Bluetooth Speaker and I must say I really do like the design of it.  The speaker has an elegant classic looking design and blends in really well with its background.  The speaker offers versatility in connectivity with options of using a 3.5mm Aux port, cable included, or connecting via Bluetooth.  The speaker uses Bluetooth 2.0 technology, although Bluetooth 4.0 is the newest revision, no discernible impact is noticed.The speaker has an on/off switch so you can turn the speaker off when not in use.  I actually like the switch instead of having to hold in a button.  A lot of the Bluetooth speakers I have seen have a button you press to turn off and on but I find that a switch is more user-friendly and quicker.  When you turn the speaker back on the speaker will automatically pair with the last device, also a feature not all Bluetooth speakers have so this is great to see.  The speaker also has volume control buttons on the side of the speaker which can be used to adjust the volume or change the track from the speaker itself.Some specifics about the speaker itself:&#8226; Allows for distances up to 33 ft between device and speaker when using Bluetooth.  The distance before distortion is experienced will depend on obstructions between the devices. I have the speaker in the kitchen and play music from my phone with distances between 10 to 15 ft away and have yet to have any issues, sound is always clear and crisp.&#8226; Two 3W drivers.  The two 3W drivers seem to offer a noticeable difference in bass when compared to other Bluetooth speakers I have used.  You can hear a noticeable difference in the sound and can play the music at higher volumes without crackling.&#8226; Built-in rechargeable lithium battery offering up to 10 hours of usage&#8226; The speaker also has a built-in Mic for hands-free usage.  I tend not to use this feature as I am use to holding the phone when talking on it. But this option is an added benefit of this speaker.  When you get a phone call the speaker will pause and notify you of the call via a ringtone.&#8226; Non-Skid rubber pads on the bottom of the speaker&#8226; All required accessories included: carrying pouch to protect the speaker if using it when traveling, 3.5mm cable, micro USB charging cable.Overall, this is a great speaker.  The size of the speaker is not bulk and sounds great for its size.I was supplied a sample for test and evaluation, my review is fair and honest.", "overall": 5.0, "summary": "Great Sound and Low Price for a Bluetooth Speaker", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A25C2M3QF9G7OQ", "asin": "B00KNOGK48", "reviewerName": "Comdet", "helpful": [0, 0], "reviewText": "This is an impressive mini speaker for the price. The build quality is excellent &#8211; it looks and feels much better than I expected it would given the price point. It feels very solid to the point where it&#8217;s hard to tell if the case is plastic or metal. The seams are tight and the edges are all nicely rounded. All the control buttons have a good feel to them (although they could be better marked, as noted later in the review).The grill is gray which blends well with the overall black-on-black look. It has a nice overall shape &#8211; a curved top and a curved front which gives it a very elegant look. The only thing that I feel detracts from the overall look is that the top has a gloss finish. Looks great when it&#8217;s shiny; but it is a major fingerprint magnet.It has two large non-slip grippers on the base that are very effective in keeping the speaker planted on a desk. The overall size is pretty compact &#8211; it&#8217;s about 5 inches long, 2.5 inches wide at the widest point (the middle) and stands about 2 and 3/8 inches tall.It has the usual bluetooth connectivity plus the ability to use a 3.5mm cord to direct connect it to a tablet. Both methods worked just fine &#8211; pairing was quick, and using the cord to connect was simple. The bluetooth range was very good with no dropouts at 20+ feet. I&#8217;m especially pleased with the bluetooth pairing sound &#8211; rather than a grating beep (or, worse yet, spoken prompts) this has a very nice (and quiet) chime.The sound quality was quite good. It&#8217;s not a &#8220;big&#8221; sound, but it performs admirably given the size. As with the build quality, it sounds far better than you would expect given the price. It does get somewhat harsh at loud volumes, but at normal listening levels it puts out a fairly clear sound with a decent amount of bass.It also offers phone functionality with a built-in mic. I didn&#8217;t test that, so I can&#8217;t give feedback on its quality.It comes with a very nicely made carry pouch and a manual that actually is readable and helpful.Complaints are few. As noted previously, I&#8217;m not a fan of the glossy top. I also wish the side controls for volume were better marked. They work fine, but it&#8217;s almost impossible to see which side of the rocker switch to press. Not a huge deal, but I prefer clear markings even if it detracts a little from the overall black-on-black color scheme.There&#8217;s a lot of bluetooth mini speakers out there, but this stands out with solid build quality, sound and looks. I&#8217;m happy with it, and would recommend it.[Sample provided for review]", "overall": 5.0, "summary": "Good sound quality; excellent build quality; attractive design", "unixReviewTime": 1404259200, "reviewTime": "07 2, 2014"}
,{"reviewerID": "A2BYV7S1QP2YIG", "asin": "B00KNOGK48", "reviewerName": "Dr. Oceanfront \"Oceanfront\"", "helpful": [1, 1], "reviewText": "The Aukey BT013 Bluetooth speaker is a very well built, compact speaker, that has a robust sound considering it's size.  The unit has two 3W drivers, so the sound fills my office.  The unit is a great size so you can take this speaker anywhere.  It fits right in my backpack, or briefcase.The bluetooth was a simple connect with my IPhone 5s.  It automatically pairs now when I turn on the unit, and connects to my phone.If you don't have bluetooth, or prefer the sound of a wired connection, there is a 3.5mm audio cable you can plug into any device.It also makes a very good speaker phone, for Skype or regular calls.The units rechargeable battery enabled me to use the unit for 8 hours of straight playtime at about 40% volume. Very impressive.The unit really is a very nice looking speaker.  I like that it has rubber pads on the bottom so keep it from slipping or scratching my furniture.At this low price point, this speaker is a real deal.Sample provided for review.  However, the opinion is my own.", "overall": 5.0, "summary": "Very nice compact speaker...", "unixReviewTime": 1404432000, "reviewTime": "07 4, 2014"}
,{"reviewerID": "A1LSLXHU7SUSZX", "asin": "B00KNOGK48", "reviewerName": "Rick &#34; The best of everythng &#34; \"The b...", "helpful": [0, 0], "reviewText": "Just back from a little 4th of July excursion.  I was fortunate enough to have taken with me the Aukey BT013 Bluetooth external speaker.It arrived almost minutes before pulling out for the Independence Day weekend travel.  I was surprised it made it in time. This was two days from the order point.  The Aukey packaging is a step above average.  Although the theme is brown box. The packaging is tight with crisp folds with internal cardboard support structuring. Included in the BT013 package are one handy user manual, one 3.5mm speaker auxiliary cable, a USB2/micro (Like you find on Samsung), and a microfibre drawstring bag.Charging was simple enough. Plug in the micro USB cable and a Red light comes on in the grill of the speaker.  After a while the BT013 is fully charged and the red light is extinguished.First use was painless in that I turned it on, My Samsung SGH-i727 reported a BT013 in range.  I tapped that on the 727 display and it was paired with no further fiddling.  Drivine to the first holiday destination I was reviewing audio notes about some captured video with unuseable sectons of audio totally blown away by wind and or firecrackers.  This was interupted by a couple of incoming calls.  Which were handled well by the Aukey BT013 speaker's built in internal microphone pickup.Re-pairin is simple as the BT013 powers up paired to the last device.  Turn it on and if the device is in range it connects within a couple of seconds.  At one point it was necessary to Re-pair the BT013 with a 10&#34;pad for a mini theatre.  Just BT-off on the i727, BT-on on the pad, and push and hold the special button on the side.  You can answer a call with this button, the button above it is volume -/+ and skip forward/backward. Holding the special button a couple of seconds causes the BT013 to enter pairing mode again and can be paired to an alternate device.The compact size is easy to deal with, it takes very little space on the desktop in front of the monitor, or in the courtesy console in the land yacht. It takes up very little space in its storage bag in my mobility package.  It was nice it came with a 3.5 inch audio patch cable one extremely low end tablet that came with us besides virtually no volume did not have bluetooth and the BT013 saved that low end tablet from the trash for the trip.  If I were to think on it for a bit, the only drawback would be the 8 hour battery time.  I did not depleate the BT013, but would feel more secure if it had a longer rated time between charge cycles.With the clear audio and excellent microphone pickup I will definitely get a lot more good use from this device.  As a final testament, I had to spend a half hour on the cell phone to a service rep for a well known product distributor.  It sounded like they were a bad burger drive through, I could barely understand anything she had to say until I flipped on the Aukey BT013.  It cut through the over amped signal from the rep and made it possible to complete the service request without being reduced to a drooling screaming fit.", "overall": 5.0, "summary": "Aukey BT103 BT2.1 external speaker", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "AKS5TVGA2VG0W", "asin": "B00KNOGK48", "reviewerName": "Robbie Stevenback", "helpful": [0, 0], "reviewText": "I love this speaker. The design is incredible. It feels light weight and the way the buttons are placed are good. You can change songs on the switches on the side. The sound of the music is no disappointment. You get all you need to be able to charge this and it comes with a nice carrying bag, too!", "overall": 5.0, "summary": "Must Buy Speaker!", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "A3984G9B5FXH64", "asin": "B00KNOGK48", "reviewerName": "Vincent's Nana Sunni", "helpful": [0, 0], "reviewText": "The Aukey Bluetooth Speaker is very compact but that certainly doesn't mean that it doesn't pack a punch! I love that it is wireless and the sound is far reaching. It works on the Bluetooth Version 2.1 +EDR or higher. It works on such items as iPad, iPhone 2 or higher, iPad Touch and MAC and it worked fabulous on my Samsung Galaxy S3 smartphone. The bluetooth was a very simple connect and pairing w/ my Samsung Galaxy S3, and I tried it w/ my iPad Air and iPad 2 and all worked great as well. If you prefer a wired connection or don't have bluetooth you can use a 3.5 mm audio cable that's included that you can plug into ANY device you'd like.The sound for a speaker this small is totally amazing.The fact that it's able to be recharged and holds a charge while playing for hours on end makes this unit worth every penny. We had a family get together here at the house and we played it for over 7 1/2 hours (I timed it) without having to recharge it at about 60 % Volume..TOTALLY unexpected .For $21.99 you won't find anything better for your money.I did test this on Skype to see how it would work as far as a speakerphone. it worked amazingly well for this purpose as well.I did obtain this product at no charge in exchange for my honest testing of this product and my honest review and opinions. These opinions are my own and were not in any way negotiated with the owner of the product. I do plan on buying a few more of these speakers for family members for the holidays as I was totally impressed not only by the sound quality but also by the look of the product that stands out. For it's size it definitely packs a punch.", "overall": 5.0, "summary": "Aukey Gemini Portable Wireless Bluetooth Speaker Really Packs a Punch! Fabulous Sound", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A18FUBX0QLXMZS", "asin": "B00KNOGK48", "reviewerName": "Wizard", "helpful": [0, 0], "reviewText": "Wow.. I was so impressed with the look and build quality of this item when I received it. I needed a classic, elegant Bluetooth speaker for use on my desk in my office. I deal with customers all day long and wanted a subtle but classy looking device that would sound and look great. This fits the bill perfectly. I simply cannot emphasize how nice this piece is. The build quality, the look and sound quality are all top notch. Pairing was easy as pie. Simply turn on device, discover with your phone, hit pair and begin to stream your music collection. The size of speaker allows for discrete placement on any flat surface and the rubber feet keep it in place and prevents vibration from ruining the sound. I would consider this a more personal listening device as opposed to a party speaker due to its size but can fill my office with sound if played at higher volumes. I got about seven hours play out of it before needing a recharge. Basically it can last an entire work day while playing music at 40-50% volume level. Simply plug in when leaving for the day and it will fully charged in the morning when you arrive. I LOVE THIS DEVICE! Great value and great looks. I would recommend to family and friends in a heartbeat.", "overall": 5.0, "summary": "Classic elegant look and great sounding. I LOVE THIS DEVICE!", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
,{"reviewerID": "A1EQEPO5XSE926", "asin": "B00KO9DUIQ", "reviewerName": "Carol", "helpful": [0, 0], "reviewText": "Incredibly convenient to have. The cables are so amazing! It charges just as fast as the OEM. I'm so impressed by the chargers. Highly recommended.Cables are strong and sturdy. Fits perfectly into the slot. The car charger works perfect and so does that home adapter and both comes with dual USB ports so it's just perfect!", "overall": 5.0, "summary": "Really convenient!", "unixReviewTime": 1401667200, "reviewTime": "06 2, 2014"}
,{"reviewerID": "A14H2WTFVA1ESO", "asin": "B00KO9DUIQ", "reviewerName": "George", "helpful": [0, 0], "reviewText": "Great bundle for use with my note 3.  Great quality for such a value bundle.  Would definitely recommend to others", "overall": 5.0, "summary": "Works great with note 3", "unixReviewTime": 1403222400, "reviewTime": "06 20, 2014"}
,{"reviewerID": "A28W82ZVOFDFW9", "asin": "B00KO9DUIQ", "reviewerName": "hellomimi", "helpful": [0, 0], "reviewText": "very nice little package, great value, everything good quality. definitely recommend this product if you have a galaxy s5. a+", "overall": 5.0, "summary": "GREAT VALUE!!", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "AT8K624TIHF1T", "asin": "B00KO9DUIQ", "reviewerName": "Jimmy Glenstohr", "helpful": [0, 0], "reviewText": "Needed the extras and love the fact that cords are different lengths for the right space. Short cord in car and long cord for wherever I need it.", "overall": 5.0, "summary": "Best Buy!!!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "AFIBUK4LTADMC", "asin": "B00KO9DUIQ", "reviewerName": "KKOCLUB", "helpful": [0, 0], "reviewText": "Buy it for my family. Get it on next day! Cables quality are good. It charging iike the OEM cable. Recommended!", "overall": 5.0, "summary": "Great Deal with Prime Shipping!", "unixReviewTime": 1403136000, "reviewTime": "06 19, 2014"}
,{"reviewerID": "A3UBTF81J52N2F", "asin": "B00KO9DUIQ", "reviewerName": "Royceephius Jones", "helpful": [0, 0], "reviewText": "Bought this for my girl. She seems to like it a lot. I like the car charger. That was the only thing I took from her. Man, it works so well for both ports.", "overall": 5.0, "summary": "Yes", "unixReviewTime": 1403222400, "reviewTime": "06 20, 2014"}
,{"reviewerID": "A390XPHE9J7DBO", "asin": "B00KOZNJXG", "reviewerName": "AIMEE A TAYLOR", "helpful": [1, 2], "reviewText": "Can't really say anything bad about this case. It is simple and to the point. I like the way it fits.", "overall": 4.0, "summary": "Good Case", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00KOZNJXG", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [1, 1], "reviewText": "Flexible but protective case. Very high quality! Washable and I like that I can still see my lovely phone through this completely transparent case! A+ for this case for sure!", "overall": 5.0, "summary": "Great quality completely see through case!", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
,{"reviewerID": "A14NHXPYTSZ2HT", "asin": "B00KOZNJXG", "reviewerName": "Brandyn F.", "helpful": [0, 1], "reviewText": "I received this product in exchange for an honest review.  For a phone that is already pretty big, all I wanted was a simple case that didn't add a lot of bulk.  This case fits the bill. The phone fits inside perfectly and looks great.  I can't attest to how long the case will last, as the sides seem like they will probably stretch over time, but for the price this is perfect for me.", "overall": 4.0, "summary": "Works for me", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "A21T5C3KL41REL", "asin": "B00KOZNJXG", "reviewerName": "galbarran", "helpful": [0, 0], "reviewText": "I got this for my husband, it' s a great case, it's clear and has not broken or fall apart.  So far so good, great case!", "overall": 5.0, "summary": "Great Case", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "AN65KG18M4SDN", "asin": "B00KOZNJXG", "reviewerName": "jeff grant", "helpful": [2, 2], "reviewText": "This case is eaxactly what I was looking for. I love the way the case is clear unlike other cases that do not let you actually see your phone. I actually saw the case in action today . I was being clumsy as usual and dropped my phone and it hit the concrete and I thought well thats it bye bye phone. The case was scratched and scuffed but the phone was not hurt at all. Great product.", "overall": 5.0, "summary": "Does the job", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A1K3L3CVDVSKH2", "asin": "B00KOZNJXG", "reviewerName": "JOX MONTES", "helpful": [1, 1], "reviewText": "So today I dropped my phone. It hit my knee before actually falling but, in one of those weird accidents, I kicked it, watching it slide on its face across concrete and flip several times.That millimeter worth of space on the front is just enough to protect it. The case was scuffed nothing a little cleaning wouldn't fix, but the phone is completely unbroken what a relief. The case has a good grip, like it wont easily fall out of your hands. I totally recommend this case.", "overall": 5.0, "summary": "That's all I pretty much want in a case", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
,{"reviewerID": "A537XC69FAD3J", "asin": "B00KOZNJXG", "reviewerName": "L Green", "helpful": [0, 0], "reviewText": "great case - lightweight but protective and sturdy - nicely made  - nice to be able to actually see the phone -", "overall": 5.0, "summary": "great case - lightweight but protective and sturdy - nicely ...", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A1QR76SYGTXJN5", "asin": "B00KQT0Q0E", "reviewerName": "Adam B. Shaeffer \"ashaef\"", "helpful": [0, 0], "reviewText": "I found this screen protector just as easy to install as advertised. No bubbles. No tricky positioning. It just went right on smoothly and easily.One thing I appreciate about this protector is the texture it offers my phone's screen. It's not slick, it's not rough, but it has a smooth feel under my fingers that I find to be an improvement over the feel of the glass itself.One thing I don't appreciate (and this is admittedly a very minor gripe) is the slight edge the protector creates around my home button. If I didn't have a 5S I probably wouldn't mind, but using the touch-id with this protector on isn't as pleasant on the fingertips as using touch-id without it.", "overall": 4.0, "summary": "Works for me", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A91BK8S5QH98K", "asin": "B00KQT0Q0E", "reviewerName": "CelticWomanFanPiano", "helpful": [0, 0], "reviewText": "These glare screen protectors fit the iphone well and just slip right on.  The box they come in doesn't provide a small cloth to clean the screen with, which I was surprised about.  However, the protectors work well and they even double-up one on top of the other well.", "overall": 5.0, "summary": "Work Well.", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
,{"reviewerID": "A4U27URFECK1U", "asin": "B00KQT0Q0E", "reviewerName": "Chris Damon \"Classic TV & Tech Guy\"", "helpful": [0, 0], "reviewText": "At first I wasn't sure I received the product that was request. The label says it is \"Transparent Film for iPhone 4/4s - 2 pack\", while another label says \"Belkin 2-Pack Anti-Glare\". So, I'm not sure exactly is this is Belkin's product of Micra Digital's. When I opened the box there was actually two packs of two films, so wouldn't that be a four pack? Confusing, isn't it?Like I said, there are two packs, each containing two films inside the carton with an instruction card only with diagrams, no text. You can see these instructions in the photos section of this product, so I guess maybe I did receive the correct product. You start by cleaning your iPhone with a cloth that is not supplied, so I'm not sure if there is a specific type they want you to use. Next, you peel off the plastic backing, and throw it in the trash. What they don't say is to flip the product over so the sticky side is facing down, which is obvious, but some people may not realize that. Then you have to be good at aligning the product so that the holes all line up. This takes a steady hand and a great deal of patience. Once it is in place, press it down using the cloth again over the entire surface. It is easier said than done. The first time I tried, I got more bubbles than blank screen - it was terrible. I ripped the first one off and trashed it. By this time it was full of dust and could not be re-used. The second application went a little bit better. I got far fewer bubbles, but the fact that there are any bubbles is annoying, especially since the product description says \"Specially formulated adhesive for super-easy installation that will be bubble-free!\". Further instructions in the product description say \"Then with your fingernails, gently push away any small bubbles that may remain.\"  - this did not work. I still have bubbles that I cannot get rid of.UPDATE - After using my iPhone for a day after applying the film, most of the bubbles are still there (though some have gone away), and now there are a lot of smudges too. These films certainly are not smudge proof.While the film helps cut down on a little glare, by no means will your screen be glare free, and the screen will not be as brilliant as it once was. What I have noticed though is that text does not move up and down the screen as smoothly as it did without the film attached. It kind of has a quick stuttering effect as it scrolls, which might be annoying to some. There appears to be tiny dots visible on a white screen, which may account for this. I did not notice any drop in screen sensitivity, and the film gives the screen a silky smooth feel. Other than that it is what is. Installation can be luck of the draw, and seems somewhat prone to bubbles. For about the same price I like theZAGG invisibleSHIELD for Apple iPhone 4/4S (Screen) - Retail Packaging-Clear, which I had on my phone previously. It comes in several different types, has a Lifetime Guarantee (you pay a small shipping fee), but they will send you a replacement, and they last for several years.", "overall": 3.0, "summary": "It is what it is - not the best - not the worst.", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
,{"reviewerID": "AJWLN5Z6W97TM", "asin": "B00KQT0Q0E", "reviewerName": "DeeDee Fox \"Dee Dee Fox\"", "helpful": [0, 0], "reviewText": "I used this to replace the brand-new screen protector I got at my phone store.I prefer this product, as it is much better for a number of reasons.FEATURES:Easy to put onVery clear imageNon-glareSmooth surface (not like some that feel rubbery and are hard to slide your finger over)Great Value (comes in a pack of 4)This is a great screen protector.", "overall": 5.0, "summary": "This is a great screen protector.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "A30J7WQV0ZNRXG", "asin": "B00KQT0Q0E", "reviewerName": "D. Reinstein \"marindavid\"", "helpful": [0, 0], "reviewText": "I had tried many screen protectors when I first got my IPhone5 about 18 months ago.  My favorites were the matte finish ones from Tech Armor.  I switched over to a clear glass cover so as to enjoy the enhanced clarity of my screen and images. However, I found out what most users of glass screen protectors discover - they smudge really easily - and I was getting tired of cleaning it each and every time I picked it up to use it!Then, along came the offer to try out these Anti-Glare screen protectors from Belkin. Belkin is a very reliable name in the manufacture of after-market IPhone accessories, so I was sure they were worth a try. They weren't.Like others have mentioned, after trying with 5 of the 8 I received (free via Amazon Vince to try and review) I gave up. I found a pack of the Tech Armors in my desk and in one easy motion, applied one with no bubbles or dust specks. Problem solved.Simply put: Belkin does a lot of things right, but this is not one of them.**(I presume that Micr-aDigital is a division of Belkin as the names are used together in the invoice that accompanied there screen covers. If they are not, I apologize to Belkin, but not for the content of this review.}", "overall": 1.0, "summary": "Simply Put: **Belkin/ Micra Digital does a lot of things right, but this is not one of them.", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A2GOHNFBHUU3UI", "asin": "B00KQT0Q0E", "reviewerName": "Gadget Man \"Gadget Man\"", "helpful": [0, 0], "reviewText": "This anti-glare screen is fairly ordinary.  It is difficult to get rid of the bubbles.  While some competing products come with microfiber cloth to clean the Iphone, as well as a small card to wipe away bubbles...this one comes with nothing.  Just the screen protector.  It is okay, but nothing special.", "overall": 2.0, "summary": "Very Average", "unixReviewTime": 1404172800, "reviewTime": "07 1, 2014"}
,{"reviewerID": "A3OO4WIO4SKD55", "asin": "B00KQT0Q0E", "reviewerName": "I'm hungry. feed me", "helpful": [0, 0], "reviewText": "These Micra Digital 2-Pack Anti-Glare Screen Protector for the iPhone 5/5s/5c need improvementI mean, they apply right onto the iPhone just fine and do a great job keeping the screen protected but there is just one problem - the air bubbles are impossible to get rid of.The set didn't come with instructions, so there's no directions on how to get rid of them.Polaroid makes a better Iphone 5s screen protector", "overall": 2.0, "summary": "needs improvement. 2.5 stars", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "A3D1TZH619NKHN", "asin": "B00KQT0Q0E", "reviewerName": "In the AmaZone...", "helpful": [0, 0], "reviewText": "These aren't the most anti-glare screen protectors out there, but it went on easy enough and stayed on without lifting in the corners, so far after more than a week.  This came in Amazon frustration free packaging, with a very basic set of instructions, and no cleaning cloth or applicator, like some other sets do.  I did use a lint free cloth on the screen after cleaning it, and an applicator from my last screen protector to smooth out the bubbles as I stuck it on my phone.  Overall, a pretty basic, middle of the road set of screen protectors.", "overall": 3.0, "summary": "Micra Digital 4-Pack Anti-Glare Screen Protector for iPhone 4 / 4S", "unixReviewTime": 1404604800, "reviewTime": "07 6, 2014"}
,{"reviewerID": "A3QG32P5IF3JAK", "asin": "B00KQT0Q0E", "reviewerName": "Jacqueline \"sf/f writer\"", "helpful": [0, 0], "reviewText": "This is about as good a screen protector as you'll find today.  It's just about like the others on the market.It is more shiny than the anti-glare screen protectors I've used previously, not the matte finish you can get from, say, Belkin or iLuv.To apply the film to your phone, you have to peel the film partially off the backing, align the holes with the holes in the device and peel the rest.  Then you remove the bubbles with fingernail or the stiff cardboard applicator they include.  Many screen protector kits come with a little scrap of micro-fiber cloth to clean the phone screen.  This one did not include that scrap.The film is extraordinarily transparent -- really, you can't see it.  That makes it very hard to align.To think about aligning it, it seems a simple procedure. To do it just right -- not simple.  They provide a second film to use if you mess up the first try.  You can't just pull it off and try again with the same film.I'm waiting for screen protectors to come with alignment devices that prevents getting them on crooked.An alternative is to get the film applied by one of the kiosk shops in a Shopping Mall that sells screen protectors.  Soon, I expect, the actual glass surface will be tough enough that you won't be able to scratch it, no matter what.  But glare may always be an issue outdoors -- and this Micra works.  The iLuv works. The Belkin anti-glare one works.", "overall": 4.0, "summary": "Does not have the applicator I'm looking for.", "unixReviewTime": 1404345600, "reviewTime": "07 3, 2014"}
,{"reviewerID": "A5GPH59NDWJRB", "asin": "B00KQT0Q0E", "reviewerName": "Jenna of the Jungle", "helpful": [3, 3], "reviewText": "I went into this feeling pretty confident. I'm a neat person and I felt capable of installing a screen protector, especially since all three people who reviewed this before me said it was easy and there were no bubbles. Those people are complete freaks.I put on the first protector. I couldn't get it to line up exactly, so I repositioned it three or four times. When I put it down, there were bubbles GALORE. No way could I smooth them with my nails. I tried, but then also tried using a credit card. For ten minutes, Finally gave up and decided I'd try a second protector (I had a pack of 4). The same thing happened.I decided I must not have cleaned the screen enough, so I did it again, even though it looked perfect. Absolutely not a speck of dust on the screen. I put the third screen protector on and made sure not to reposition it this time. Again, there were bubbles, and this time I paid close enough attention to see that the bubbles I couldn't get rid of all had a speck of dust in the middle. How?! The phone was spotless and all I'd done was remove the protector's backing and stick it right on.Down to my last protector, I gently eased it off its backing and looked at it in the light. It had dust on it! On the sticky side of the protector, which you can't wipe off. So I washed the darn thing with soap and water and waited for it to air dry and then tried again. And again. And again. I washed all of the screen protectors and tried different methods... shaking them dry, patting them gently with cloth... whatever I did, dust jumped right onto the protector's sticky side within moments.FOR TWO HOURS, I was driven to homicidal rage by these screen protectors that gave my iPhone the measles. Three of them are now in the garbage, and the fourth will be in the garbage tomorrow when I make it to the Verizon store and make an employee put a new screen protector on for me.", "overall": 2.0, "summary": "The people before me are sorcerers", "unixReviewTime": 1404086400, "reviewTime": "06 30, 2014"}
,{"reviewerID": "A3GVD3O9QG6I0V", "asin": "B00KQT0Q0E", "reviewerName": "Jennifer L. Vido", "helpful": [0, 0], "reviewText": "I just purchased an iPhone 5C. I usually get my screen protectors from the Verizon store along with the car charger and case. This time around, I skipped buying anything extra because I was in search of a different type of screen protector. Lately, I've been having a hard time reading the phone screen inside and outdoors. I really wanted to try this one due to the anti-glare factor. The package comes with two protectors. As for installation, it was a snap to put on. Just peel and place! As for the results, you can immediately see the difference compared to a regular screen protector. Definitely worth it!", "overall": 5.0, "summary": "Simple to use", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
,{"reviewerID": "A13BX9O5UDBILC", "asin": "B00KQT0Q0E", "reviewerName": "Jong Lee", "helpful": [0, 0], "reviewText": "never heard of this brand as I've typically purchased a name brand screen protector or from AmazonBasics. The cutout for this screen protector is very precise and no weird shapes, and was easy to apply and the quality was clear - not too matte. would definitely recommend.", "overall": 4.0, "summary": "and was easy to apply and the quality was clear - not ...", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "A11LNPG39A2ZV4", "asin": "B00KQT0Q0E", "reviewerName": "Kristi Swede", "helpful": [0, 0], "reviewText": "Outstanding screen protector!  In the past several years I've been using the ZAGG screen protectors for my iPhones, iPads, i-everything...and far be it from me to say anything negattive about my ZAGGS (except for the recent applications, which have been a nightmare...).This Micra went on like a champ!  Like my old PDA protectors! It just lay right down like it wanted to take a nap on my screen; no bubbles, no troubles. I've been using it for a month now, and the only downside I can see is that it's a bit difficult to take photos in bright light.This is definitely your best choice if you are finding the wet-application or squeegee application screen protectors unsatisfactory. Highly recommended", "overall": 5.0, "summary": "Outstanding screen protector!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "ABOTQXNUBA1MM", "asin": "B00KQT0Q0E", "reviewerName": "Mark F. Braun", "helpful": [0, 0], "reviewText": "I knew it going in: An anti-glare screen won't stick any better or worse that an old Colorforms set. But yes, it will protect your screen very well and glad I have it!", "overall": 2.0, "summary": "Won't stick and semi-glare-free", "unixReviewTime": 1403654400, "reviewTime": "06 25, 2014"}
,{"reviewerID": "A3A15L96IYUO6V", "asin": "B00KQT0Q0E", "reviewerName": "Michael Smith", "helpful": [0, 0], "reviewText": "There&#8217;s an older iPhone 4S laying around at home so I thought I&#8217;d give these a try. The last screen protector I bought from Monoprice was so glossy it was like looking into a mirror every time I was trying to focus on something on my phone&#8217;s screen.These clear/matte screen protectors arrived in a small cardboard box (frustration free packaging). There&#8217;s no cleaning cloth included to clean your screen before putting it on (I had some laying around), but as soon as you open the box there&#8217;s a pictogram with a few brief steps on how to install (which really aren&#8217;t needed - remove the adhesive backing and carefully apply to the phone.) I was able to do so easily on the first try with minimal bubbles, and the best part - no glare on the screen. I think small bubbles are a given with any screen protector &#8212; you just have to live with it.I&#8217;m knocking one star off for the high price (I&#8217;m sure these cost pennies to manufacture) and no inclusion of a cheap cleaning cloth. But other than that, they seem like a reasonable product.", "overall": 4.0, "summary": "Tad expensive, no cleaning cloth -- but get the job done", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "AT1RF4WNPGGLC", "asin": "B00KQT0Q0E", "reviewerName": "Mick McArt \"Mick McArt\"", "helpful": [0, 0], "reviewText": "This was okay. It went on easy enough, but I really felt there was a loss of sensitivity here. Plus I thought it was a bit cloudy. It beats having your 1 and a half year olds sticky fingers from being on your screen though.", "overall": 3.0, "summary": "Meh.", "unixReviewTime": 1403827200, "reviewTime": "06 27, 2014"}
,{"reviewerID": "A2GSJUETASGMO0", "asin": "B00KQT0Q0E", "reviewerName": "rose thyme", "helpful": [0, 0], "reviewText": "Either I made a mistake, or I was shipped the wrong thing. I thought I was getting screen covers for iPhone 5. I cannot really test these until I find someone with a 4 who can use them. They appear to be easy to apply, and of nice quality. Since this is an Amazon Vine review, I cannot send them back. It is the first time I have gotten the wrong thing, and I really think that I clicked on the proper selection. Of well.", "overall": 4.0, "summary": "Will Test Later", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "A1ZZR25X0CNOJX", "asin": "B00KQT0Q0E", "reviewerName": "slim \"57psalm\"", "helpful": [0, 0], "reviewText": "I have trouble putting on most of the screen protectors I have tried over the years. Either I don't get all the bubbles, out. or some tiny speck of dust gets trapped underneath it, and appears 100 times bigger once sealed behind the screen cover!  I have been known to go through 4 or 5  screen protectors before getting one on the way I think it should be.Well not this time. These worked great, the FIRST TIME through!Turns out, the instructions make ALL the difference here.  The instructions for this screen protector was clear, and easy to follow, and made it much much easier to get the protector on without bubbles, or dirt specks ruining it.  I'm very pleased!", "overall": 5.0, "summary": "Easy on!", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2SPV96SGOEO2", "asin": "B00KQT0Q0E", "reviewerName": "The Travelin' H-Family", "helpful": [0, 0], "reviewText": "In our house we still have a few iPhone 4 cell phones laying around the house, and since two were recently replaced. So we needed to get a couple more, and these were available.They seem to work perfectly. The installation on both went relatively well, with only 2 small bubbles on the first one we placed on. So far they're holding up perfectly, and the quality is certainly just as good as screen protectors much more expensive in price.The only thing I can't objectively assess after the first ten days is how long these will hold up after 6 months to a year. So if they start wearing out faster then I'll update, but initial they are working perfect.", "overall": 5.0, "summary": "The Perfect Budget Screen Protector", "unixReviewTime": 1404604800, "reviewTime": "07 6, 2014"}
,{"reviewerID": "AW7BIYHXUIZ62", "asin": "B00KQT0Q0E", "reviewerName": "T.M. Reader", "helpful": [0, 0], "reviewText": "I've purchased 2 other brands of screen protectors in the past and have made many installations . . . and ruined many screen protectors in the process.  I'm getting the hang of it and am now semi-competent.  But NO installation has ever been \"quick and easy\".  Or absolutely perfect.My phone is an iPhone 5c, with the screen in perfect condition (a result of always using screen protectors).  This Micra Digital Anti-Glare protector probably went on easier than any installation I've ever done.  The pictorial instruction card was adequate.  There is no cleaning cloth enclosed but I had a micro-fiber eyeglass cloth at hand which worked fine.  I had to reposition a couple of times during installation, but the protector was very tolerant of this and I ended up with a well-positioned installation and was easily able to press out all but just a few very tiny air pockets.  I was well satisfied with this installation.  How about performance? . . . .Works super.  Very touch sensitive (obviously more sensitive than the one I took off).  A slight matte finish, which cuts some glare, but still passes the screen image very clearly - as compared to the very dull matte finishes in some brands of protectors, which cut all glare out, but also attenuate some of the screen image.  This Micra Digital is a nice compromise, seemingly cutting some of the glare, but clearly passing all of the image.  And again, the touch sensitivity is superb, performing just like a naked screen.Great screen protector.  The best I've installed or used so far.", "overall": 5.0, "summary": "This one is as good as you'll find", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A2JWEDW5FSVB0F", "asin": "B00KROF20M", "reviewerName": "Adam", "helpful": [0, 0], "reviewText": "the bubbles around the edges are a great multipurpose feature. its absorbs the shock and its great for clipping my phone to thing, like for camping. i love it and recommend it!", "overall": 5.0, "summary": "I love this case", "unixReviewTime": 1402444800, "reviewTime": "06 11, 2014"}
,{"reviewerID": "A8AJS1DW7L3JJ", "asin": "B00KROF20M", "reviewerName": "Agata Majchrzak", "helpful": [0, 0], "reviewText": "Excellent !! I dropped my phone a few times I'm this phone and I am worry free! The bubble technology works great with absorbing the shock of an impact. Great buy and better than an otter box!", "overall": 5.0, "summary": "Better than otter box", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
,{"reviewerID": "A2YO4SCWAWNYBI", "asin": "B00KROF20M", "reviewerName": "Alex Maslakov", "helpful": [0, 0], "reviewText": "I dropped my phone 2x on concrete with this case and not even a scratch on my phone. great case", "overall": 5.0, "summary": "I am in shock how well it works", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}
,{"reviewerID": "A6Q0P54QSP11J", "asin": "B00KROF20M", "reviewerName": "Olivia \u001aysiak", "helpful": [0, 0], "reviewText": "This case gives me perfect protection. Its got the best of both world. Strong shock protection, but still light and not too bulky. Dropped the phone a few times and no damages to the phone! I highly recommend it!", "overall": 5.0, "summary": "Shockingly Awesome", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
,{"reviewerID": "ANMATY0L0HX6Y", "asin": "B00KROF20M", "reviewerName": "Sasha Malkin", "helpful": [0, 0], "reviewText": "Totally worth the money, It protects my phone in even of the most dangerous situations where I dropped my phone from 3 meters and it was as if nothing happened. BRAVO!", "overall": 5.0, "summary": "Amazing Product, Highly REcommend!", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
,{"reviewerID": "A1XBPVR8FE7TE1", "asin": "B00KROF20M", "reviewerName": "tim g", "helpful": [0, 0], "reviewText": "I got the blue for me, and pink for my wife. We are so grateful for this case because it saved us a bunch of time and money replacing our phones that we drop constantly", "overall": 5.0, "summary": "very strong", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "A35C4777EXZZQH", "asin": "B00KROF20M", "reviewerName": "Viktoriya", "helpful": [0, 0], "reviewText": "This is a really great case, looks and feels amazing, not to mention that the shock resistance saved my phone.", "overall": 5.0, "summary": "Fantastic Fantastic!", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
,{"reviewerID": "ACU3LCRX4A8RV", "asin": "B00KROF20M", "reviewerName": "Zonaldo Reefey \"Zonaldo Reefey\"", "helpful": [0, 0], "reviewText": "I saw a video of this case in action, and the guy drops this case off the roof of his home onto the concrete with no damage! This is some heavy duty stuff!", "overall": 5.0, "summary": "No way!", "unixReviewTime": 1402272000, "reviewTime": "06 9, 2014"}
,{"reviewerID": "A2L184RIPJYH8N", "asin": "B00KRY4YJW", "reviewerName": "bobby conley", "helpful": [0, 0], "reviewText": "With so many to chose from having an OTG solution this multiport usb charger stands out and works great,for any Android device or phone or any portable device that supports an OTG connection. Also works great for any non otg devices or phones. Charge time and speed works as well as any oem charger so no worries in that department. Using otg with 2 different devices videos work flawlessly no issues at all.I received a FREE SAMPLE for review for andevaluation, and promised an unbiasedreview.", "overall": 5.0, "summary": "one feature to rule them all", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
,{"reviewerID": "A1T4SP880XEFB3", "asin": "B00KRY4YJW", "reviewerName": "darren", "helpful": [0, 0], "reviewText": "space saver for home or on the go!!!! i have multiple devices including tablets/phone's and cameras so this unit takes care of all my charging needs with 1 simple to use unit. in the package was 4 port charging station/detachable power cord (4ft) OTG cable (more on its use) instruction manual and a warranty card.  the unit has 2 x Smart Charging Ports (Max 2.4A) 2 x Universal Charging Ports for Phones (Max 1.5A) 1 x OTG Port which allows instant read/write/view access to any USB storage from Android devices. (Need to use provided OTG cable) unit also has over-charge protection, surge protection and short circuit protection which was a very nice feature not found in all units of this type.another added feature was AC 100 - 240V input voltage and portable palm size (4.3&#34;*3&#34;*1.3&#34;) make it ideal for international travel which also other units are lacking. the OTG or &#34;on the go feature was a great added bonus and such a huge reason to purchase this unit, devices supported by OTG are: &#8226;Samsung:Galaxy S2/3/4;Note2/8;Galaxy Tab 3 8.0/10.1(Android OS 4.2 or later)&#8226;Nexus 5/7/10(Need to download StickMount on the market if you have root access;if you don't, download &#34;Nexus Media Importer&#34;)&#8226;ASUS memo pad;Asus Vivo Tablet;Kindle Fire;HTC One m7;HTC evo 4g LTE;Dell Venue 8 Pro;Lenovo lynx;Lenovo A2109 tablet;Xoom ;CM9 HP touchpad;Nvidia Shield;Motorola Xoom should note that OTG function can NOT be used on any Apple devices&#8226; Android devices needs to be updated to 4.2 or later to work with OTG function&#8226; OTG ports and OTG cable can NOT be used to charge devices&#8226; Use your device's original cable or a 3rd certified cable to charge you devices for safetythe 4 ports are named SMART (2) iphone (1) and ANDROID (1) which is kinda confusing and not really limited to whats listed. SMART. What that really means is that it can charge most tablets and smartphones but Do not let the labels fool you. You can charge any smart phone, cell phone, or bluetooth keyboard with these ports. i guess bottom line is it's 2 ports that are 2.4A MAX and 2 ports that are 1.5A MAX.. unit also has a nice blue led to show unit is getting power and ready for use. also all ports have an intelligent chipset that allows it to auto adjust the current to devices plugged in which is another added safety feature. i was able to charge 4 smartphones simultaneously across all 4 ports of this unit since they would be at or below the MAX current for each port.  in the end if you own multiple devices this is the unit for you, i gave it 5stars for price,function and features.", "overall": 5.0, "summary": "space saver for home or on the go!!!!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1UQBFCERIP7VJ", "asin": "B00KRY4YJW", "reviewerName": "Margaret Picky", "helpful": [0, 0], "reviewText": "This versatile charging station has smart circuitry for advanced power management and fast charging as well as OTG facilitation.There are two smart USB ports to deliver up to 2.4 A for fastest charging of almost any small electronic device plus two dedicated USB ports for Apple and Android devices with 1.5 A each for total maximum output of 7.8 A when all four ports are in use.There are also paired OTG USB ports and an OTG-only cable, allowing peripherals to be used with Android 4.2 and higher devices.  The OTG cable cannot be used for charging.A detachable power cable is included and there is an LED indicator for power status.  The case is compact and has four large grippy feet underneath.  There is a legible user manual and everything is packaged in a recyclable frustration-free box.Sunvalleytek provided a charging station for evaluation and review.", "overall": 5.0, "summary": "Smart charging station with OTG", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A3984G9B5FXH64", "asin": "B00KRY4YJW", "reviewerName": "Vincent's Nana Sunni", "helpful": [0, 0], "reviewText": "This device is one small item that really packs a punch. It is able to charge all my family's smart phones at once or my cellphone (Samsung Galaxy Note S3) and My Tablets (Kindle Fire HDX and iPad Air ). It's all about the amps there are 2 smart ports forup to 2.4A (think ipads and tablets) and 2 ports for up to 1.5 amps (think smart phones). The OTG port CANNOT be used for Apple Products esp iPads.What's really unique about this little gizmo is that it can charge both a phone and a tablet in about the same time as having multiple chargers going and is much safer since you're not overloading your home w/ all these additional plugs (esp in summer months in the south where the electric companies are forever telling you to unplug items even on strips while storms are coming or the temperatures are unseasonably high and everyone is using their A/c).Most of these devices do not come w/ the OTG cable but that's not the case. The manufacturer has thought of everything by including the cord with this unit.People ask me what the OTG port does. (OTG for those of you who aren't too computer literate yet means ON THE GO).Simply stated it 1 x OTG Port: allows instant read/write/view access to any USB storage from Android devices. (Need to use provided OTG cable). Again this will NOT work on Apple Devices!!While the manufacturer doe label the port for an iPhone and one port for Android it is NOT limited to either one. What this actually tells you is that it these two ports together cannot exceed 1.5a!This item is extremely compact : portable palm size (4.3\"*3\"*1.3\")and so this  makes it ideal for international travel or domestic travel. Either way it will fit very easily into a pocket of a tote bag or a fanny pack. Package includes: 1*charging station; 1detachable power cord; 1*OTG cable for Android; 1*User Guide.Make sure you take your user's guide just in case you have any questions.One thing that's invaluable to me is having 24/7 email customer support and HooToo is known for their outstanding customer support making it one of the best electronics companies on the market today. (Heck even Sony doesn't offer 24/7 customer support unless you pay for it..this is FREE).Most of these units don't have any safety features and yet this product is LOADED with them. Seems HooToo is all about Safety first! (Which for me when you have a family is an absolute must have).It has over charge protection, surge protection (heck my neighbor just lost a TV and a cable box by not having a surge protector on their box and tv..this to me here in the lightening capital of the world is fantastic), and it even has short circuit protection. Can you ask for any other protection? I can't think of anything that HooToo didn't cover. Oh yes..it does come with a 12 month HooToo Warranty and 24/7 email support.This device is compatible with ALL USB-charged devices with a few exceptions. The Asus Transformer and Ipod are NOT compatible with this device (but w/ the ipads and all the other phones like iphones etc this is still a winner for HooToo).One thing I did want to mention about Android Devices. In order for this to work with the OTG it MUST be updated to Android 4.2 or later. My Samsung Galaxy Note S3 worked fine..plug and go.Finally I just want to let you know about this device that the OTG function cannot be use to actually CHARGE the device only read.This device at even double the asking price on Amazon.com is worth every penny. It literally eliminated tons of extra charging devices and cords that were scattered all over my home. Simplicity and being able to keep up w/ the kids' devices and my own all in one place is truly a blessing.I was actually sent this device by the manufacturer to test and review. This review is my own and nobody including the manufacturer had any influence over my opinions or reviews.", "overall": 5.0, "summary": "Great Product..don't let the low price fool you!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A18FUBX0QLXMZS", "asin": "B00KRY4YJW", "reviewerName": "Wizard", "helpful": [1, 1], "reviewText": "In a crowded market of multiport USB chargers this unit stands out due to the inclusion of an OTG port. This port allows easy hook up of vast array of usb devices to an Android smart phone, tablet or any device that supports an OTG connection. Once the connection is made the USB device can be accessed by the phone or tablet. I have both the Nexus 5 and Nexus 7 and both units were able to access the data contained on these USB devices perfectly. 1080P movies played perfectly and without stutter. The 4 port charging ports worked well with all my devices. I successfully charged my Nexus 5, Nexus 7, Asus Win 8 Tablet, Bluetooth headset and Bluetooth Speaker without issue. The charge time/speed was equal to the speed of the OEM chargers that came with the each respective device.As a side business, I convert wedding/party videos to 1080P MP4 videos that can play on the latest and greatest Android/Apple devices. This unit serves as my test bed for such projects. I do all conversions on my editing PC and then transfer to customers 64 gig flash drive, SD card or USB 2.5\" HDD. Next step, I test final work by simply plugging in the flash/hard drive into the OTG port on this device and the Android Phone or tablet is able to see the data and play without issue. I have tested videos up to 6000 kb/sec @ 1080P and they played perfectly. The connection has been solid and error free.I would recommend this unit without hesitation to anyone looking for a desktop OTG solution for their Android or any portable device that supports an OTG connection. The extra feature of multi port USB charging is a bonus and can keep all your devices powered up. Kudos to the manufacturer for thinking out of the box and creating a unique product that performs well and is cost effective", "overall": 5.0, "summary": "Unique Item the stands out from the crowd with an OTG port.", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "A39F36FX7I80WW", "asin": "B00KS0BL5A", "reviewerName": "Alonso", "helpful": [0, 0], "reviewText": "I would not recommend this to anyone. The materials become loose very quickly. I expected more for the price. Only way it is worth it is if you put it on and NEVER take off.", "overall": 1.0, "summary": "DONT Recommend", "unixReviewTime": 1391731200, "reviewTime": "02 7, 2014"}
,{"reviewerID": "A37OEEPJ8I3O8C", "asin": "B00KS0BL5A", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Concrete, asphalt, carpet-covered concrete, books on top, this case shrugs them all off!Also easy to remove when you want to clean the inside of the dust that sneaks in through the speaker gap.", "overall": 5.0, "summary": "Tough, and has protected my Galaxy S3 through bunches of drops.", "unixReviewTime": 1390521600, "reviewTime": "01 24, 2014"}
,{"reviewerID": "A3968V5F8JKMA3", "asin": "B00KS0BL5A", "reviewerName": "DJ MinWah", "helpful": [4, 5], "reviewText": "I've loved this case since I first got it a little under a year ago and it protects it very well for my personal daily use.  It's both my personal and work phone so obviously I'm using it all over the place.  The only thing, as with any phone that has a silicone covering, is that the silicone tends to stretch and thus you're not getting as snug a fit to the plastic part of the casing.  I'm trying to get as much life out of it before considering getting another silicone skin or replacing the case altogether.  I like it but I'd research other cases first.UPDATE 6/16/2013:I've actually had this case almost a year; I just never got around to writing a review until my problems were obvious back in March.  So I sent rubber/silicone casing back and they replaced it with an upgraded composite.  I normally don't bother with warranties, I just decided I try this since I was really all about this case when I first got it.  This new rubber outer shell doesn't stretch as easily and I've been using it well over a month now and am very happy not just for the new case but that the rubber issue seems to be fixed.  As well, I've even dropped my phone from about 3 to 4 feet twice since getting the new case and my phone is snug and intact.  I've thus upgraded from 4 to 5 stars because of this and am fully recommending this case if anything short of having it protected from being submerged in any liquid is the level of protection you're looking for.", "overall": 5.0, "summary": "Great case...one personal caveat...", "unixReviewTime": 1362096000, "reviewTime": "03 1, 2013"}
,{"reviewerID": "A3OPBJ5PZ4F41Z", "asin": "B00KS0BL5A", "reviewerName": "F. Ache", "helpful": [0, 0], "reviewText": "I used to have this case for my ipods and they worked great but I have had 3 for the Galaxy S3 and the rubber is not as tie and with time it stretch it. No good at all for other devices than Apple.", "overall": 2.0, "summary": "Not as good as it used to be", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
,{"reviewerID": "AMKI6MN8AVY1L", "asin": "B00KS0BL5A", "reviewerName": "itsvance", "helpful": [2, 3], "reviewText": "Offers decent protection.  Has already saved my phone from my wife once already.  It does not offer any more protection than my wives commuter however, I have ordered a commuter and will use that instead for the S3 since it is lighter and less bulky.", "overall": 4.0, "summary": "Otterly Terriffic", "unixReviewTime": 1344729600, "reviewTime": "08 12, 2012"}
,{"reviewerID": "A3NFCQQL2B10I3", "asin": "B00KS0BL5A", "reviewerName": "Ixil Pierce \":)\"", "helpful": [0, 0], "reviewText": "I tried to like this product, I got a Warrenty replacement and bought two others. In my line of work it's just hard to find a case to keep up with me. I drive Forklift at a Factory. The Dust/Sawdust/Metal Shavings/Debris that's thrown at this thing are just too much for it. If I never took the phone out of it's case to swap batteries, then maybe the Rubber wouldn't have stretched as it did. Possibly the high physical part of my job caused the breakage of the Belt Clip over, and over... But I switched to a UAG and am very happy with it. Don't not buy this case based on my review alone, there are plenty of others who dislike it, and others it works perfectly for. My wife is one of those people, she works in an Office/Warehouse environment and has little to no issues with the case (her belt clip also broke but was replaced via warranty claim and hasn't broken &#34;yet&#34;)", "overall": 2.0, "summary": "Didn't work for me...", "unixReviewTime": 1376092800, "reviewTime": "08 10, 2013"}
,{"reviewerID": "A3L8KM5K79T16", "asin": "B00KS0BL5A", "reviewerName": "J. MacDonlad", "helpful": [0, 0], "reviewText": "I needed a cover for my Samsung that also included a belt clip.  The belt clip in interesting.  You can push it open and it stays open until you release it. That makes it easier to clip it to your belt. The cover over the phone appears to protect it very well.  I have not had the opportunity to test the limits. It snaps into the belt clip in either direction and is not easy to unclip it, so no one will be stealing it without you knowing.Overall, I am very impressed and would purchase another one.", "overall": 5.0, "summary": "Well made cover and Belt clip for my S3", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
,{"reviewerID": "AOC7NON60J6L9", "asin": "B00KS0BL5A", "reviewerName": "JOHN", "helpful": [0, 0], "reviewText": "The side tabs that latch the front cover to the rear cover break off when you remove the phone to clean it. This causes bubbles under the screen protector, because the locking tabs are not securing the front cover tight enough. once you install the phone. Leave it in there until you are ready to file a warranty claim with Otter Box when you take it apart. I'm in the middle of a warranty claim. I'll post back to let you know if it all goes well...Otter Box replaced the defender series case and cover. If you follow the online instructions, the warranty should go through.", "overall": 4.0, "summary": "CASE AND HOLSTER GOOD OVERALL, BUT....", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
,{"reviewerID": "AX4L6DVN3E0XX", "asin": "B00KS0BL5A", "reviewerName": "Lady Karen of Maine", "helpful": [0, 0], "reviewText": "I think it well worth it,  look around and find them for less then the 50-60 dollar price tag, cause amazon has them,  and its good with my SG3,  Its not too bulky like the outter box for iphone is boxy,  and big,  heavy almost,  but for my S3,  perfect fit,  love it and have dropped it more than I will admit,  and my phone is so protected!", "overall": 5.0, "summary": "outterbox is worth it", "unixReviewTime": 1396224000, "reviewTime": "03 31, 2014"}
,{"reviewerID": "A3U5ZSO7E4D88I", "asin": "B00KS0BL5A", "reviewerName": "Michael F. Perry \"mfperry\"", "helpful": [0, 0], "reviewText": "I'm an extremely active guy who is always banging and dropping his phone.  No doubt, Otterbox has saved me thousnads of dollars in damage.  Short of floating and being waterproof, they are as good as it gets and well worth the investment.", "overall": 5.0, "summary": "The CADILAC of Covers", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
,{"reviewerID": "ARGOEBLR298BC", "asin": "B00KS0BL5A", "reviewerName": "smilenstewie", "helpful": [0, 0], "reviewText": "This is okay if you don't ever need to access your battery or memory card.  Its very had to take off.  One of the tabs that help hold it in place has broken.  Soooo, if you need to remove it, its not for you.  If you don't then you will most likely be okay.", "overall": 2.0, "summary": "phone cover", "unixReviewTime": 1403049600, "reviewTime": "06 18, 2014"}
,{"reviewerID": "AG0MAZ9F6A7OD", "asin": "B00KS0BL5A", "reviewerName": "Sparky", "helpful": [0, 0], "reviewText": "I have used Otterbox Defenders for years, protecting iPhone 4, iTouch and now Samsung Galaxy S3. On my iphone, the older case rubber wanted to roll off the hard frame (after time). This case fixes that with a new design where the edge &#34;tucks in&#34; more effectively. The older case also broke where the belt carrier snapped into the case. This one seems much heavier at that point. I supplemented this case with a ZAGG invisibleSHIELD screen cover. They work well together.", "overall": 5.0, "summary": "Great Protection--Fits Well", "unixReviewTime": 1369008000, "reviewTime": "05 20, 2013"}
,{"reviewerID": "A3H401OQCXSQHV", "asin": "B00KS0BL5A", "reviewerName": "Womp Womp", "helpful": [0, 0], "reviewText": "This is probably the best case you can get for this phone. I call it the batman suit. I take out the screen when I buy these because they get dirt under them, but other than that the case is perfect. If you get a Zagg Invisibleshield and this case, you're good to go. Don't take the case apart a hundred times like I did with my first one. It makes the rubber go soft and the outer case winds up falling loose after a while.", "overall": 5.0, "summary": "Best case available", "unixReviewTime": 1367798400, "reviewTime": "05 6, 2013"}
,{"reviewerID": "A4WEZJOIZIV4U", "asin": "B00KTBOUWO", "reviewerName": "Chuck Bittner \"Disabled comedian & gamer!\"", "helpful": [0, 0], "reviewText": "This is a really nice and more importantly powerful USB car charger. This is capable of charging iPads which some chargers available on Amazon cannot do. I've had a few in the past that wouldn't charge iPads and that can be really annoying.I'm of the opinion that everybody should have one of these. If you're looking for a stocking stuffer or small present for somebody these are perfect. And at the time of writing this review it was only $12 to me that's a great price.One other thing I like about this is the look and it just really feels like will last for a while. Okay I guess that's really two things.Thanks for reading.", "overall": 5.0, "summary": "And affordable and powerful USB car charger.", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A18U49406IPPIJ", "asin": "B00KTBOUWO", "reviewerName": "Deon", "helpful": [0, 0], "reviewText": "This dual port USB charger is made for power users in the car, allowing you to charge two power hungry devices at the same time.Having two powerful ports makes for a great charger, packing 2.5A each. You can charge two tablets without any issues. In the hand, the charger is very light, about the size of a tube of \"ChapStick\". The layout is very simple and clean. There is a subtle round green LED light when plugged in.The first added bonus is there is not a fuse like most on the market. Secondly, the device is very simple, no moving parts, and feels very solid in the hand. Also, the finish is matte and textured, which makes it easier to insert/remove.I use this in the car to charge my Galaxy Tab 2 and Galaxy Note II both at the same time, which is great for me. With this car charger, there is no need for two chargers. Use it to charge your cell phone and other mobile devices at the same time and you will not be let down.I was supplied a sample for the purpose of review.", "overall": 5.0, "summary": "Charges Any Mobile Device", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A1B4MIXYVIKMU2", "asin": "B00KTBOUWO", "reviewerName": "D. Truong \"-The Duke-\"", "helpful": [0, 0], "reviewText": "I like the overall design of this charger. I also like the fact that each port can charge up to 2.5Amp which allows you to charge tablets in addition to smart phones and a vast array of other electronics which use USB ports to charge. The Green light (on both sides of the charger) is cool but it may be too bright for some. Also, I would've loved a &#34;TRON&#34; BLUE color version of this charger if they had the option. I think they'd sell twice as many if it were in that color... since there are quite a lot of TRON Fans out there, Lol.  The only problem I've had with this Car Charger is that the charger has to be shoved into the Car Charging Port all the way for it to work... A slight bump can stop it charging. So it seems finicky that way.  The nice thing is that because it has embedded lights, it's easy to see if it does indeed stop charging because it's loose.  This is the reason I took one STAR away. Even rotating it around in the charge port sometimes disrupts the charging cycle and I have to re-adjust it.", "overall": 4.0, "summary": "Pretty Cool High 2.5Amp (per port) Car Charger ... but easily bumped loose.  It has to be pushed in snugly in port to work.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "A63TRJP2XQCD3", "asin": "B00KTBOUWO", "reviewerName": "Frank Peters \"Your Ace\"", "helpful": [1, 1], "reviewText": "Outstanding Performance, very low-profile, & a secure fit (camry 2007).  I would definitely buy this again and trust this seller.  I've used about 5 different types of dual car chargers.... this 1 is the best.  It works, is simple, and is durable.  The price is not high. This company also makes the #1 cellphone car mounts in that division.. the 'iOttie Car Mounts.'  It seems like they know how to do some electronics as well.  I am very tough on reviews.. as a lot of products are 3 stars or less out there.  I hate getting ripped off and work hard for my money.Please click, 'Yes' if helpful in any way", "overall": 5.0, "summary": "Works Flawlessly.. iOttie Makes a Lot of Great Products", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A1CMD08Z49PGKQ", "asin": "B00KTBOUWO", "reviewerName": "okiedan \"Pro Bono Publico\"", "helpful": [0, 0], "reviewText": "A quality usb charger that can handle all of your usb devices.  Tested with all of my devices and it charged each and everyone.  What more can you ask. It has a glow light that helps you find it in the dark.Seems to be well made and Should last.", "overall": 5.0, "summary": "A good choice.", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A390XPHE9J7DBO", "asin": "B00KTUWSSI", "reviewerName": "AIMEE A TAYLOR", "helpful": [0, 0], "reviewText": "I gave this to a friend and they loved it. He runs and this made it more convenient.", "overall": 5.0, "summary": "convenient Product", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A24MUR7JGFFAXF", "asin": "B00KTUWSSI", "reviewerName": "Alf M,", "helpful": [2, 2], "reviewText": "Love it, Love it Love it.  Excellent Armband for my iPhone an oozes of Quality!Great quality  material and fits my iPhone 5 like a glove.Super fast shipping and great follow up by the seller.Will definitely look for more items from this seller.", "overall": 5.0, "summary": "Love it, Love it Love it.  Excellent Armband for my iPhone an oozes of Quality", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
,{"reviewerID": "AP9USU1C1C21P", "asin": "B00KTUWSSI", "reviewerName": "Allan Burks", "helpful": [0, 0], "reviewText": "Very cool, love the feel and design of this", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00KTUWSSI", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [8, 8], "reviewText": "High quality and get for any iphone owner that needs an armband for working out or riding your bike. Anything you need to be hands-free for. Love this and use it constantly. Everyday! No metal to bug your arm and stays where you put it! Very nice.", "overall": 5.0, "summary": "A must-Have for any iphone owner that works out!", "unixReviewTime": 1405296000, "reviewTime": "07 14, 2014"}
,{"reviewerID": "A14NHXPYTSZ2HT", "asin": "B00KTUWSSI", "reviewerName": "Brandyn F.", "helpful": [0, 0], "reviewText": "I received this product in exchange for an honest review.  This is just what I needed to keep my iPhone on me while riding my bike.  The armband fits nicely and other than the weight of the phone I can barely tell that I'm wearing it.", "overall": 5.0, "summary": "Great for riding", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A21OFVVU602ODC", "asin": "B00KTUWSSI", "reviewerName": "Daniel Lambert", "helpful": [1, 1], "reviewText": "I used this with my ipod while mowing the grass and it works great. So far it has held up well and fits my arm perfectly. I'm very pleased!", "overall": 5.0, "summary": "Great!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1YMNTFLNDYQ1F", "asin": "B00KTUWSSI", "reviewerName": "eyeused2loveher", "helpful": [0, 0], "reviewText": "This is just what I was looking for. My iphone fits perfectly in there and I can use this while walking. This secures easily to arm and stays in place. Its a great value.", "overall": 5.0, "summary": "This is great for hands free while working out!", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A15TX8B2L8B20S", "asin": "B00KTUWSSI", "reviewerName": "Jon Davidson", "helpful": [0, 0], "reviewText": "Well constructed, very convenient  and easy to use. I love it. I'm going to order one for my son. I highly recommend this product..(it permanently replaced my previous one)", "overall": 5.0, "summary": "Excellent product", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A3JI7QRZO1QG8X", "asin": "B00KTUWSSI", "reviewerName": "Joyce M. Davidson", "helpful": [0, 0], "reviewText": "When I ordered this it was to be for my daughter as she has the iPhone 5c but to my surprise my iPhone 4s fit in it very nicely so I'm keeping it for myself. It's really nice and better than I expected. It's a really nice, quality fabric that seems as if it will hold up to a lot of wear and tear. The band has Velcro so it's adjustable and fits my arm nicely and really stays in place. The fabric has a slight give, like it has a little stretchability, which I think adds to the comfort factor; I hardly know it's there. The clear plastic front does not effect the touch screen ability at all which is surprising and nice.  For the safety aspect, there is a grey reflective stripe around the front screen area and around the Velcro area in the back...very smart. I am very happy and look forward to many walks and bike rides with my phone safely on my arm.", "overall": 5.0, "summary": "Fits my iPhone 4s nicely", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A1NHB2VC68YQNM", "asin": "B00KTUWSSI", "reviewerName": "Nurse Farrugia", "helpful": [0, 0], "reviewText": "Love the key holder!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A11LC938XF35XN", "asin": "B00KTUWSSI", "reviewerName": "SJ Blouse \"Stacey\"", "helpful": [0, 0], "reviewText": "Perfect for the gym and the little key holder is just great for holding the key to my locker.  Mostly I don't have pockets while working out, so that little added extra makes my life so much easier.  No more key on a string for me.  Fits my iPhone perfectly and has easy access ports for my headphones as well.", "overall": 5.0, "summary": "Perfect for the gym and the little key holder is just great for holding the key to my locker.", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A2I8KUDXTC9WYI", "asin": "B00KTUWSSI", "reviewerName": "theresa", "helpful": [0, 0], "reviewText": "Wow, this is a nice iPhone armband.  I ordered it so I could job and still have my phone with me.  It is everything I hoped it would be. It is lightweight and does not make my arm sweat.  It stays where I put it and does not slide down my arm.  My phone fits in it perfectly and it also has a key holder.  I highly recommend this product.", "overall": 5.0, "summary": "Stays Put when Jogging.", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A390XPHE9J7DBO", "asin": "B00KZ0RPB2", "reviewerName": "AIMEE A TAYLOR", "helpful": [0, 0], "reviewText": "This is a great back up for my phone. I am not having to take my cord in and out of the house and most the time I leave it in the car and then need to go back out or I leave it home and my phone dies on me.", "overall": 5.0, "summary": "Great Backup", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A24MUR7JGFFAXF", "asin": "B00KZ0RPB2", "reviewerName": "Alf M,", "helpful": [3, 3], "reviewText": "Wow... this is one of the HIGH QUALITY CABLES to use for your Gadgets... works like a charm andmakes me happy.Came in a high quality box and high quality cable / connector.Will Definitely buy from this seller again and have actually told some other friends of mine to getsome of these as well.... and whom does not need more than ONE of these...  I definitely do.Happy buyer.", "overall": 5.0, "summary": "Wow... this is one of the HIGH QUALITY CABLES to use for your Gadgets... works like a charm and  makes me happy.", "unixReviewTime": 1404864000, "reviewTime": "07 9, 2014"}
,{"reviewerID": "A1YMNTFLNDYQ1F", "asin": "B00KZ0RPB2", "reviewerName": "eyeused2loveher", "helpful": [0, 0], "reviewText": "This thing really is fast. Plugged my iPad air and wow, was charged fully after only a short time. It's great to have this as an extra .", "overall": 5.0, "summary": "Works great for iPad and iPhone!", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A15TX8B2L8B20S", "asin": "B00KZ0RPB2", "reviewerName": "Jon Davidson", "helpful": [0, 0], "reviewText": "This cable is a high quality product. Works great. It comes in a nice package. It's a little longer than my other cable which is something that I have been looking for.. Overall great product .", "overall": 5.0, "summary": "Excellent product", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A2HT05OASZO53B", "asin": "B00KZ0RPB2", "reviewerName": "Margo J. Jablonski", "helpful": [1, 1], "reviewText": "This is very good quality  cableWorks excellent , charging is fastit ts very well made and  I have a feeling it will last a while ...exactly what I needed ....shipping was fast as usual with my Prime .....arrived packed really well in a nice  boxhappy camper here", "overall": 5.0, "summary": "works like a charm", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A3F1563BPENTHT", "asin": "B00KZ0RPB2", "reviewerName": "Nish", "helpful": [0, 0], "reviewText": "Well made cable. Better than the standard apple 8-pin lighting cable in terms of quality. Charges the iPhone at a good speed.", "overall": 4.0, "summary": "Nice cable. Better than standard Apple cable.", "unixReviewTime": 1406073600, "reviewTime": "07 23, 2014"}
,{"reviewerID": "A1NHB2VC68YQNM", "asin": "B00KZ0RPB2", "reviewerName": "Nurse Farrugia", "helpful": [0, 0], "reviewText": "Works well. Great value", "overall": 5.0, "summary": "Great", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A2I8KUDXTC9WYI", "asin": "B00KZ0RPB2", "reviewerName": "theresa", "helpful": [0, 0], "reviewText": "This is a nice quality cable. It works perfectly with my iPhone. Hooks up to my phone with ease.  I highly recommend it.", "overall": 5.0, "summary": "Works perfectly.", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A18JF0T0GOCORW", "asin": "B00KZ0RPB2", "reviewerName": "Y.Trinh \"U\"", "helpful": [0, 0], "reviewText": "Very nice cable. Fit and plugs into device without problems. Like oem, possibly even better. Package is beautiful. Charged quickly. Handy to have another charging cable to travel to work with. 4 feet long, so nice length.", "overall": 5.0, "summary": "Best 8 pin cable", "unixReviewTime": 1406073600, "reviewTime": "07 23, 2014"}
,{"reviewerID": "A1EQEPO5XSE926", "asin": "B00L0N4ID6", "reviewerName": "Carol", "helpful": [0, 0], "reviewText": "This product works just as described. I was able to use it to sync my ipad and iphone. I noticed with other cords, it did not sync at all, and when I used this cord, it worked just the same as an original apple iphone charger. Definitely worth the money! I would recommend this product to all my friends", "overall": 5.0, "summary": "I would recommend this product to all my", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A26EU9F8AGPG71", "asin": "B00L0N4ID6", "reviewerName": "Chris P", "helpful": [2, 6], "reviewText": "I ordered these and they work fine with all of our families' iPhone 5's, as well as the iPad Mini. No error messages on anything and they charge well with no problems. The cords are thick and the lightning end is a little large, but it fits all of the cases we have, including Otterboxes. Just don't be surprised athe cord. They worked so well, I am ordering more.", "overall": 5.0, "summary": "Awesome", "unixReviewTime": 1393977600, "reviewTime": "03 5, 2014"}
,{"reviewerID": "A2W5S26XTAFD97", "asin": "B00L0N4ID6", "reviewerName": "Kath", "helpful": [4, 6], "reviewText": "These cables work great and the price for the two of them is very reasonable. I really like that they are 10 ft. long. That has come in very handy.", "overall": 5.0, "summary": "Work Well", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
,{"reviewerID": "AFIBUK4LTADMC", "asin": "B00L0N4ID6", "reviewerName": "KKOCLUB", "helpful": [1, 3], "reviewText": "All 5 cord are working good for my iphone and ipad. The quality is good as the original iphone cable. Don't need to bring the cord to go out and worry to get lost.", "overall": 5.0, "summary": "Good Price! Work Perfect!", "unixReviewTime": 1395273600, "reviewTime": "03 20, 2014"}
,{"reviewerID": "A1JOYWSFNQOCE2", "asin": "B00L0N4ID6", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "This is an excellent price for this necessary device. Great for travel. Fits in a purse of course, as well as a variety of cases for travel. Another easy place for one is in the car in case you need to take one with you to meetings and such.", "overall": 5.0, "summary": "Perfect and convenient!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A3UBTF81J52N2F", "asin": "B00L0N4ID6", "reviewerName": "Royceephius Jones", "helpful": [0, 0], "reviewText": "Great bundle. Love the length. Cables are thicker than normal so there's a durability there that the original cables don't have. Haven't had any problems with it.", "overall": 5.0, "summary": "Great package.", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "AMD75QJFKIAQ2", "asin": "B00L2JZZJE", "reviewerName": "I. Kato", "helpful": [0, 0], "reviewText": "I have not used it very often yet because I bought it as a back up. It looks and feels original for the few times I used it seems to be a good product.", "overall": 5.0, "summary": "It looks and feels original for the few times I used it seems to be a good product.", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A140BGX2HI2GKM", "asin": "B00L2JZZJE", "reviewerName": "Jonathan", "helpful": [0, 0], "reviewText": "Just like the original charger that comes with the phone. Works Great as Samsung always does!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A2HSRTNI97S051", "asin": "B00L2JZZJE", "reviewerName": "Juan Fermin", "helpful": [0, 0], "reviewText": "Not OEM, cheap knockoff", "overall": 1.0, "summary": "Don't waste your money", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A26KQS2TR5XURA", "asin": "B00L2JZZJE", "reviewerName": "Pete", "helpful": [0, 0], "reviewText": "Tested the charger and it is 5V 2amp. And it charged the phone quickly. I would buy another and recommend this item", "overall": 5.0, "summary": "I would buy another and recommend this", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A17SPEC8D1SX85", "asin": "B00L2JZZJE", "reviewerName": "R. Tobias", "helpful": [0, 0], "reviewText": "This is a solid charger, which seems well constructed, and gives a fast charge to my Galaxy Note 2.  The insulation on the cord could be made of a bit sturdier material, but otherwise, I can find nothing to complain about.  It does what it is supposed to do quite well, and will last a long time if you protect the cord from getting damaged.", "overall": 5.0, "summary": "Does Its Job Well", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2MMXC9Y2Q6UV1", "asin": "B00L2JZZJE", "reviewerName": "T. Evans", "helpful": [0, 0], "reviewText": "Purchased it for the long length. Very happy.", "overall": 5.0, "summary": "Very Long Cord", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A21ZZWTBPMHQJ9", "asin": "B00L2JZZJE", "reviewerName": "tgmotoman", "helpful": [0, 0], "reviewText": "Works just like the oem one I got when i got my phone.", "overall": 5.0, "summary": "Looks oem to me", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A390XPHE9J7DBO", "asin": "B00L3MG3S2", "reviewerName": "AIMEE A TAYLOR", "helpful": [0, 0], "reviewText": "I liked the look of this case. That colors are transparent. Firm back and soft front bumpers. Well worth the price.", "overall": 5.0, "summary": "Cool Case", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
,{"reviewerID": "AP9USU1C1C21P", "asin": "B00L3MG3S2", "reviewerName": "Allan Burks", "helpful": [0, 0], "reviewText": "nice, slim, works just like I wanted it", "overall": 5.0, "summary": "very cool item", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00L3MG3S2", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [0, 0], "reviewText": "Very protective case for my Galaxy S5 and I love all the beautiful colors on the back. Very cute and colorful. Love that the charging port and buttons still work very well. Very good case.", "overall": 5.0, "summary": "Love this case a lot! Super Cute and very protective", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A1W9OSF4ZWL94R", "asin": "B00L3MG3S2", "reviewerName": "Beth Jenner", "helpful": [0, 0], "reviewText": "The perfect phone cover it is light weight...durable...and colorful....any girls dream", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2AVWHAP4IUN0G", "asin": "B00L3MG3S2", "reviewerName": "Courtney Johnson", "helpful": [0, 0], "reviewText": "Fits great. Really pretty colors.  I love the way it makes my S5 look.  It's like a rainbow is on the back of my phone. It also keeps it safe.  Great price.", "overall": 5.0, "summary": "Pretty colors case", "unixReviewTime": 1405209600, "reviewTime": "07 13, 2014"}
,{"reviewerID": "A9WO6SOUAHQ8A", "asin": "B00L3MG3S2", "reviewerName": "HealthyLivn", "helpful": [0, 0], "reviewText": "Wonderful slim fit phone case! I love the translucent rainbow colors, it like the glow. Absolutely beautiful case that will get noticed wherever you are!", "overall": 5.0, "summary": "beautiful translucent case", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A1FQ3HRVXA4A5B", "asin": "B00L3MG3S2", "reviewerName": "Heather", "helpful": [0, 0], "reviewText": "Cute case, protects and fits on the phone well, really stands out against other plain cases and makes it easy to find when digging through purse!On some reviews I do I either get a discount/free product in exchange for a review. However, this does not determine my opinion of the product and I do not get paid for this.", "overall": 5.0, "summary": "Nice colors!", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A15TX8B2L8B20S", "asin": "B00L3MG3S2", "reviewerName": "Jon Davidson", "helpful": [0, 0], "reviewText": "Very sturdy and colorful ..I love it. I'm very clumsy and drop my phone a lot. Well, I  accidentally  dropped it again and there was no damage to the phone or the case..I highly recommend this product.", "overall": 5.0, "summary": "Great case", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1K3L3CVDVSKH2", "asin": "B00L3MG3S2", "reviewerName": "JOX MONTES", "helpful": [0, 0], "reviewText": "GOOD CASE NO COMPLAIN", "overall": 5.0, "summary": "GOOD CASE", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A3JI7QRZO1QG8X", "asin": "B00L3MG3S2", "reviewerName": "Joyce M. Davidson", "helpful": [0, 0], "reviewText": "Cute cover. I got the pastel rainbow and white one. I gave it my daughter for her 5S and she loves. It fits nicely and feels secure. Can't go wrong for the price.", "overall": 5.0, "summary": "Fits great", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A537XC69FAD3J", "asin": "B00L3MG3S2", "reviewerName": "L Green", "helpful": [0, 0], "reviewText": "great case - so pretty - my daugher loves it!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "A1Y3FEUELH3FTI", "asin": "B00L3MG3S2", "reviewerName": "Onlinesalesgirl", "helpful": [0, 0], "reviewText": "So cute! Sturdy, fits well, gave as a gift!", "overall": 5.0, "summary": "Perfect, nicer in person!", "unixReviewTime": 1404950400, "reviewTime": "07 10, 2014"}
,{"reviewerID": "A1RQN2NK36226H", "asin": "B00L3MG3S2", "reviewerName": "sarah M", "helpful": [0, 0], "reviewText": "very nice case,don't add extra bulk to the phone,colors are nice not over powering.Just what I wanted", "overall": 5.0, "summary": "just what I wanted", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "A2I8KUDXTC9WYI", "asin": "B00L3MG3S2", "reviewerName": "theresa", "helpful": [0, 0], "reviewText": "This is a really nice slim fit case.  It fits very snug on my phone and looks very attractive.  It is a good quality case and the colors are very vibrant.  It makes my phone look like a rainbow.", "overall": 5.0, "summary": "It makes my phone look like a rainbow.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1AG6U022WHXBF", "asin": "B00L3MG3S2", "reviewerName": "Trisha Crocker", "helpful": [0, 0], "reviewText": "as described and so cute, my niece loved it", "overall": 5.0, "summary": "my niece loved", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AAOYA0DKWED4W", "asin": "B00L3MG3S2", "reviewerName": "WombatComputing", "helpful": [0, 0], "reviewText": "Nice case for my Samsung S5.", "overall": 5.0, "summary": "Samsung S5", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A18JF0T0GOCORW", "asin": "B00L3MG3S2", "reviewerName": "Y.Trinh \"U\"", "helpful": [0, 0], "reviewText": "Cute slim fit case. Colors are transparent. Sides are polyurethane and soft, and the polycarbonate hard back seems to give good protection. Ports fit well so charging isn't obstructed. Nice!", "overall": 5.0, "summary": "Cute", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "ABJVSQBJ4G438", "asin": "B00L3MNE2U", "reviewerName": "amy m welling", "helpful": [0, 0], "reviewText": "I really do love this case! Not too bulky but feels strong and protected. Would recommend.", "overall": 5.0, "summary": "Great Case", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
,{"reviewerID": "A537XC69FAD3J", "asin": "B00L3MNE2U", "reviewerName": "L Green", "helpful": [0, 0], "reviewText": "Really nice case - very strong and sturdy - quality made!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AWHZOUIQ0VO7M", "asin": "B00L3MNE2U", "reviewerName": "Richard N", "helpful": [0, 0], "reviewText": "Great case - nicely made - fits well -love the added protection!", "overall": 5.0, "summary": "Five Stars", "unixReviewTime": 1405468800, "reviewTime": "07 16, 2014"}
,{"reviewerID": "A11LC938XF35XN", "asin": "B00L3MNE2U", "reviewerName": "SJ Blouse \"Stacey\"", "helpful": [0, 0], "reviewText": "Gave this to my friend who broke her other case. She loves this one because of the soft inner section surrounded by the hard plastic outer case. She says she feels confident this case will protect her S4 just fine.", "overall": 5.0, "summary": "Gave this to my friend who broke her other case. She loves this one!", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
,{"reviewerID": "A2I8KUDXTC9WYI", "asin": "B00L3MNE2U", "reviewerName": "theresa", "helpful": [0, 0], "reviewText": "I got this for my company cell phone.  It is a really nice case. It is a made very well and is a  quality case that has a nice rubber cover and then a hard protector outer case. It is really attractive on my phone and I am very happy with it.  I feel my phone will really be protected with this case.", "overall": 5.0, "summary": "Nice Protective Case", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A1S3C5OFU508P3", "asin": "B00LA1OD8S", "reviewerName": "Charles Ashbacher", "helpful": [0, 1], "reviewText": "The need that this device meets is obvious, but I will state it anyway. There are times when it is inconvenient or impossible to have two devices that have to be connected close enough so that the standard short cord is long enough. This cable gives you the allowance of one meter (3.3 feet) of distance between them. One end is a USB connector and the other is a Lightning connector. This is one of those devices where you may not ever need it, but when you do it is priceless. With rare exceptions, the data transfer speed will not disappoint.", "overall": 5.0, "summary": "Great and necessary product when you need it", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "A2BYV7S1QP2YIG", "asin": "B00LA1OD8S", "reviewerName": "Dr. Oceanfront \"Oceanfront\"", "helpful": [4, 4], "reviewText": "I have reviewed a lot of lightening cables for companies, and I have found that many do not work properly.  When I was asked to review this cable, the first thing I noticed is it is Apple MFI Certified.  That means the lightening cable actually contains an authorization chip, issued by Apple, which communicates with any Apple lightening connector device to be sure they are 100% compatible.So, when I received the cable, I tested it on all my Apple products,  an IPhone 5s, and iPad Air and an IPad mini.  The cable worked flawlessly.  I got a quick charge and rapid sync.  This is a great little cable, at a very low price (under $10!).The cable is 3.3 feet long.", "overall": 5.0, "summary": "Great little cable...", "unixReviewTime": 1403913600, "reviewTime": "06 28, 2014"}
,{"reviewerID": "A34CSXOGVYF94S", "asin": "B00LA1OD8S", "reviewerName": "Joel Avrunin \"Electrical Engineer who loves S...", "helpful": [2, 3], "reviewText": "I have a ton of third party lightning cables and the problem with many of them is that the shroud on the lightning connector is too big and it can't plug into a thicker case.  Thankfully, this MFi certified Lightning Cable from TopG is not only a top quality cable, but the shroud on the connector is small.  The cable worked well to both charge and send data to my iPad and iPhone 5S.  The cable itself is a little thicker than the OEM cable and seemed to retain some memory when I bend it (it is slightly less flexible), but overall works fine and is an excellent value!Note: I received a free sample for the purposes of review/", "overall": 5.0, "summary": "Great substitute for OEM cables - lightning connector shroud is narrow enough for most cases unlike other third party cables", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"}
,{"reviewerID": "AYB4ELCS5AM8P", "asin": "B00LA1OD8S", "reviewerName": "John B. Goode \"JBG\"", "helpful": [0, 0], "reviewText": "This is a great 1 meter long (3.3ft) certified Apple 8pin cable. Download speed is great and I tested it with an iPad, iPhone and iPod and works like a charm with all 3. Best of all, it's MFI Apple certified. (Sample was provided for review purposes.)", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1404604800, "reviewTime": "07 6, 2014"}
,{"reviewerID": "AZMY6E8B52L2T", "asin": "B00LA1OD8S", "reviewerName": "JP \"J.P.\"", "helpful": [0, 1], "reviewText": "I use the Apple Lightning cable with my iPod 5 and unfortunately my original OEM cable stopped working a couple weeks ago.  An OEM cable directly from Apple can be pricy at nearly $30.  For a faction of that price, theTopG - Apple MFI Certified Lightning Cable (3.3ft)has been an excellent replacement and is better than my original because the black cable matches the back of my space gray iPod.  I like to sync my podcasts with iTunes and music I get outside the iTunes store and to do that, I have to have a cable that works and this does the trick.This cable has been great for both data and charging and in my experience, has performed equally as well as my original Lightning cable.  I love that there is a price break on this cable as compared to just getting it from Apple directly and have even recommended this specific cable to some of my friends with iPads that use Lightning as spares for the office/work or travel.[Review Sample Provided For Review And Evaluation]", "overall": 5.0, "summary": "Just As Good As OEM, Maybe Even Better...", "unixReviewTime": 1404777600, "reviewTime": "07 8, 2014"}
,{"reviewerID": "A1UQBFCERIP7VJ", "asin": "B00LA1OD8S", "reviewerName": "Margaret Picky", "helpful": [0, 0], "reviewText": "The biggest problem with Apple-branded cables is that they are severely overpriced. The really cheap cables either don't work right out of the box or break after a few uses. This USB to lightning cable from TopG is right in the sweet spot where quality and price intersect.It functions perfectly for power and data transmission both. It is 39 in. (1 m.) long, just the right length, and it is black so it doesn't end up looking dirty like white cables inevitably do. It has strain relievers at both ends and the lightning connecter is long enough to work with most smartphone and tablet cases. It even ships in frustration-free packaging with a plastic insert.TopG provided a cable for evaluation and review.", "overall": 5.0, "summary": "Works perfectly", "unixReviewTime": 1405382400, "reviewTime": "07 15, 2014"}
,{"reviewerID": "A2NYK9KWFMJV4Y", "asin": "B00LA1OD8S", "reviewerName": "Mike Tarrani \"Jazz Drummer\"", "helpful": [0, 0], "reviewText": "I received one of these cables as a review sample. One of the main reasons why it stands out from every other of the dozens of Lightning cables that I have tested is this fits any case. TopG must have been carefully watching the competition because almost all of the other cables that I have tested failed in a few cases I use. Ironically, the better the case, the tighter the fit. This one fit perfectly.Another thing I like it although it's thin and flexible, it's also tough and well built. I especially like the strain reliefs on the ends. At first I thought they would be a failure point because they did not have flex cutouts in them, but the barrel design is truly sturdy.The connectors also mate perfectly. Not too tight, not too loose, and this cable synchs without any issues. Most cables will charge, but synching with non-Apple gear can be problematic. As others have mentioned, the MFi certification is a big plus as well, and adds even more value because you know this is not some fly-by-night company that flood the bargain bins. If you want Apple quality without Apple prices this one is worth considering.", "overall": 5.0, "summary": "Stands out from the pack", "unixReviewTime": 1404518400, "reviewTime": "07 5, 2014"}
,{"reviewerID": "A3A4ZAIBQWKOZS", "asin": "B00LA1OD8S", "reviewerName": "Stephen M. Lerch", "helpful": [2, 3], "reviewText": "TopG's MFI Apple certified cable is a lightning cable. It does exactly what you expect and does it just as well as the OEM Apple cable as far as I can tell.This means:It will charge your phoneIt will allow you to sync to a computerThe interesting thing is that TopG tossed the idea of a &#34;me too&#34; white cable and made this one black. It's nicely built, it looks good and works.The cable also has a lifetime warranty, so if you think you'll break it, the option to get a replacement is a good thing. I've never ruined a charging cable, so I doubt I will ever avail myself of this service, but it IS a nice option to have.Recommended.I received a free sample for review purposes from TopG.", "overall": 5.0, "summary": "It's a cable, it works and is Apple certified", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QMS0", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "One of my favorite iPhone case makers does it again with this one. I like holding it.", "overall": 5.0, "summary": "Hold this and you'll see why you'll never go back to typical plastic.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2V247ZQT9OJIT", "asin": "B00LH1QMS0", "reviewerName": "Natalia", "helpful": [0, 0], "reviewText": "I was looking for a sharp iPhone case that you don't really see everyday and I found it!  This case is so nice on the phone, I just love it.", "overall": 5.0, "summary": "Gorgeous", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QMS0", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "All the stingrays will be jealous of your new case. It's the most unique black case I've ever used. Good, well made product.", "overall": 5.0, "summary": "Woah!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QMS0", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "When heading out for a night on the town, this case provides the shine and sophistication I need. It looks and feels amazing. A great addition to my phone.", "overall": 5.0, "summary": "Beautiful and Elegant", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A4XPE5UGK51IA", "asin": "B00LH1QMS0", "reviewerName": "Tia Scott", "helpful": [0, 0], "reviewText": "Really cool texture, it feels good in my hands. Probably one of the best cases I ever had.", "overall": 5.0, "summary": "Great look and feel", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QMXA", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "This is a very trippy black case with a great feel. I love that it's a sting-ray. So frickin' cool.", "overall": 5.0, "summary": "Trippy & Cool", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A3BXNEABWRWJ1R", "asin": "B00LH1QMXA", "reviewerName": "Jenn", "helpful": [0, 0], "reviewText": "Very bumpy case, but I think it makes it easier to pick up. The bumps kind of make a little space between the table and the phone so that my nails can slip in between and pick the phone up easier. It's like a little piece of heaven. I feel so fancy using this phone, like it's some really expensive brand. It also doesn't scrape very easily. I have dropped it many times and it still doesn't have a scratch.", "overall": 5.0, "summary": "Fancy fancy!", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1Q52UP42LZ6XY", "asin": "B00LH1QMXA", "reviewerName": "Nate", "helpful": [0, 0], "reviewText": "My wallet is now empty......but I don't even regret it. This case is the bomb. I've only ever seen plain black cases or cases where it's black with a different color, but I have never seen one like this. It is a very interesting look and feel, but different is good sometimes. It's nice to have something exotic and unlike anyone else's. Plus, it feels like it will last forever with this quality!", "overall": 5.0, "summary": "Bang for your buck!", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QMXA", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "Ok, this is just too cool in all regards. It has a nice grip, strong design and looks like the classiest case I've seen.", "overall": 5.0, "summary": "Stingray!?", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QMXA", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "I got this case for a family member who loves anything that sparkles and shines. It was the perfect addition to her iPhone. She can't put it down. She loves the look and feel of the case. Well worth the money spent on it.", "overall": 5.0, "summary": "Makes a Great Gift", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QPSW", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "It's a durable case with a little flare for those who keep their class subtle, not flashy.", "overall": 5.0, "summary": "Durable, well made.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2V247ZQT9OJIT", "asin": "B00LH1QPSW", "reviewerName": "Natalia", "helpful": [0, 0], "reviewText": "My boyfriend wanted a phone case to protect his phone but didn't want a typical case that you find at the mall.  When I saw this I thought it was perfect and he loves it!  So glad I got this, it's very sleek and stylish.", "overall": 5.0, "summary": "Great case", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QPSW", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "You won't be disappointed to have a pony in your purse! Feels/looks super.", "overall": 5.0, "summary": "You've always wanted a pony.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QPSW", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "This case is smooth and elegant. It has a nice finish that is comfortable to hold onto and doesn't cost a fortune. It works wonderfully with my black iPhone. Worth the money.", "overall": 5.0, "summary": "Perfect for Black iPhones", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A4XPE5UGK51IA", "asin": "B00LH1QPSW", "reviewerName": "Tia Scott", "helpful": [0, 0], "reviewText": "My boyfriend has this case and he really likes it. He usually rotates different cases often and he's been sticking with this one lately so I know he's pretty smitten with it.", "overall": 5.0, "summary": "Smooth", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QQH2", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "This is a way cool case. I'm getting second-takes and compliments constantly.", "overall": 5.0, "summary": "Reptile your iPhone", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A3BXNEABWRWJ1R", "asin": "B00LH1QQH2", "reviewerName": "Jenn", "helpful": [0, 0], "reviewText": "So so smooth! I've got to be careful of not dropping it, but the look of it looks great! I like how the pattern of scales on the back are all different shapes and sizes, so it makes the case look even more like the skin of an animal. No animal's skin is perfect and exactly the same shape. Each case has a different look on the scales and it is so cool!", "overall": 5.0, "summary": "Almost looks real", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1Q52UP42LZ6XY", "asin": "B00LH1QQH2", "reviewerName": "Nate", "helpful": [0, 0], "reviewText": "Very happy with my recent purchase, this case right here is a one-of-a-kind case. It looks like what it was worth, and sort of reminds me of a Gucci design or designer case. I have gotten so many compliments on it so far! Looks and feels so cool, also easy to clean and helps grip onto your phone better.", "overall": 5.0, "summary": "One and only croc case", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QQH2", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "With a textured feel and a unique coat. Excellent ideas, folks.", "overall": 5.0, "summary": "An aligator in your pocket.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QQH2", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "If you know how tough crocodiles are, you already know how tough this skin is going to be. Once you put it on your phone, you don't have to worry about it being protected anymore. I got this for a backup case, but it ended up turning into a case that I use all the time. A must-have for any iPhone owner.", "overall": 5.0, "summary": "Withstands Almost Anything", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QTB0", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "Love this fur. Feels awesome.", "overall": 5.0, "summary": "Pony up!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2V247ZQT9OJIT", "asin": "B00LH1QTB0", "reviewerName": "Natalia", "helpful": [0, 0], "reviewText": "I got this for a friend who loves animal print and she just loves this case.  It's definitely unique.", "overall": 5.0, "summary": "Great gift", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QTB0", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "If you like these type of patterns, you'll be pleasantly surprised to find you are holding the closest thing to the real animal- mainly because it feels like it.", "overall": 5.0, "summary": "Furry friend.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QTB0", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "Our oldest is an animal lover, so when she saw this case she really pushed for me to get it. I bought it and have been in love with it ever since. How can you not love the look and feel of this case? Unleash your inner spirit with this stunning case.", "overall": 5.0, "summary": "Perfect for Animal Lovers", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A4XPE5UGK51IA", "asin": "B00LH1QTB0", "reviewerName": "Tia Scott", "helpful": [0, 0], "reviewText": "My daughter is really into animal print so she flipped when I surprised her with this one. She's now asking me for a zebra striped one as well.", "overall": 5.0, "summary": "Funky design", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QXC0", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "Another trippy case for your reptilian friends. Durable, it doesn't feel cheap like most mall cases I've seen lately.", "overall": 5.0, "summary": "Reptile in your pocket!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2V247ZQT9OJIT", "asin": "B00LH1QXC0", "reviewerName": "Natalia", "helpful": [0, 0], "reviewText": "If you're looking for a one of a kind phone case, this is it.  Real python that looks and feels authentic.  Bought it for a snake lover and they were so impressed, they just love it!", "overall": 5.0, "summary": "Very authentic", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QXC0", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "Reptile lovers will be impressed by the realism of this iPhone case. Prepare for friendly and curious glances from folks who see you using it.", "overall": 5.0, "summary": "Tamed!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QXC0", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "Perfect gift for a family member who loved snakes. They said it allows them to grip their phone with ease, while still looking amazing.", "overall": 5.0, "summary": "Makes a Great Gift", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A4XPE5UGK51IA", "asin": "B00LH1QXC0", "reviewerName": "Tia Scott", "helpful": [0, 0], "reviewText": "My boyfriend also has this case and he adores it, it looks very realistic upclose.", "overall": 4.0, "summary": "Ultra-cool", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1QZR8", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "This is my favorite case in terms of feel. I'm sure it will also last a long time. What a cool idea.", "overall": 5.0, "summary": "Cool idea that worked!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2V247ZQT9OJIT", "asin": "B00LH1QZR8", "reviewerName": "Natalia", "helpful": [0, 0], "reviewText": "This is such a cool case.  I got it for myself but my boyfriend likes to use it sometimes.  The studs are just so sharp.", "overall": 5.0, "summary": "Very cool phone case.", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1QZR8", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "Punk retro texture!! Wonderful idea.", "overall": 5.0, "summary": "cool, punky one!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1QZR8", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "Get your stud their own studded case with this beautiful design. It was worth the investment and feels amazing. Worth every penny.", "overall": 5.0, "summary": "Studs for a Stud", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A4XPE5UGK51IA", "asin": "B00LH1QZR8", "reviewerName": "Tia Scott", "helpful": [0, 0], "reviewText": "I got this case for the texture and I've been loving it ever since, I think it's really edgy and mysterious and I'm find any reason to pull my phone out in public when I have this case on!", "overall": 5.0, "summary": "Very cool texture!", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1R3C4", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "Great idea and it works well. I love the feel of this one.", "overall": 5.0, "summary": "Feel", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A3BXNEABWRWJ1R", "asin": "B00LH1R3C4", "reviewerName": "Jenn", "helpful": [0, 0], "reviewText": "I love this galaxy-looking phone case! I painted my nails the same color so now it looks pretty awesome when I use it:P Even though it's not all that cheap for a phone case, i'm glad I got it, it looks like it's going to last me at least 10 years or so! Very well constructed and it makes me feel like my phone is more protected since I dropped it multiple times already and nothing has happened.", "overall": 5.0, "summary": "Bulletproof", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1Q52UP42LZ6XY", "asin": "B00LH1R3C4", "reviewerName": "Nate", "helpful": [0, 0], "reviewText": "This case somewhat reminds me of space. I saw it and it just kind of stuck out to me, it's very unique. Since my phone is black, it goes pretty well. It is very sleek leather and feels like it is meant to be in my hands. I've never seen a leather case before for a phone, so I think it's an awesome idea to go with things that you normally don't see.", "overall": 5.0, "summary": "One of a kind!", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1R3C4", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "A leather case is truly a treat. It also is staying clean as day 1. Kudos to this idea.", "overall": 5.0, "summary": "leather in any weather.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1R3C4", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "Got this case for my spouse to go with his black iPhone. It looks amazing and is super easy to wipe off. Some of the other cases on the market would get dirty so quickly it was unreal. Cleaning them was another whole problem. With this case, it wipes off quickly and keeps his phone protected. A definite must-have.", "overall": 5.0, "summary": "Looks Great On", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1R5HW", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "Another cool Valenz case. The pattern is why I bought it, but the feel is great.", "overall": 5.0, "summary": "Feel it", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A3BXNEABWRWJ1R", "asin": "B00LH1R5HW", "reviewerName": "Jenn", "helpful": [0, 0], "reviewText": "I am not obsessed with this case. I read some of the reviews before buying it and I wasn't so sure if I should spend money on another case, but I feel so much better now that I did. This case is so unique. I am always rubbing the bumps on the back and it just makes my phone feel so much slicker, like it's some sort of reptillic phone!", "overall": 5.0, "summary": "Obsessed", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1Q52UP42LZ6XY", "asin": "B00LH1R5HW", "reviewerName": "Nate", "helpful": [0, 0], "reviewText": "I've recently got a phone from my cousin in fairly nice condition and have been going on a splurge buying all these cool cases for it. This one, by far, is my absolute favorite just because of the design on the back. It looks like snake skin and feels so amazing.", "overall": 5.0, "summary": "Never seen a case like this before", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1R5HW", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "I've gotten in a habit of rubbing it back and forth like I'm petting some sort of friendly reptile.", "overall": 5.0, "summary": "Well designed", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1R5HW", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "If you are looking for something unique, you have to check out this case. It looks and feels like snake-skin, which is what makes it so unique. This case is one that very few people are going to have, so grab yours today. It is well worth the money spent.", "overall": 5.0, "summary": "Grab Your Own Reptile Case", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2G7RZI15ZPCTH", "asin": "B00LH1R6SK", "reviewerName": "Ever", "helpful": [0, 0], "reviewText": "Great case design and feel.", "overall": 5.0, "summary": "Ssssssssuper Sssssatisfied.", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A3BXNEABWRWJ1R", "asin": "B00LH1R6SK", "reviewerName": "Jenn", "helpful": [0, 0], "reviewText": "Feels fantastic. I feel like such a nerd buying all these phone cases just because they feel good, but they are great. I like switching cases every now and then just for something new. This case not only has a cool design but a cool color as well, and that's why I ended up buying it. I am happy with my purchase", "overall": 5.0, "summary": "Feel the python!", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A1Q52UP42LZ6XY", "asin": "B00LH1R6SK", "reviewerName": "Nate", "helpful": [0, 0], "reviewText": "I get so many compliments on this case. It was a little expensive, but you get what you pay for. The quality is excellent! I love the feeling of the case, it's easier to grip and there are so many times I would have dropped it if it didn't have that grip there. Even the color is pretty cool, i don't think I've ever seen this color on a case before so it makes it even more unique.", "overall": 5.0, "summary": "You get what you pay for!", "unixReviewTime": 1405555200, "reviewTime": "07 17, 2014"}
,{"reviewerID": "AF30DHAVSYNZ0", "asin": "B00LH1R6SK", "reviewerName": "Sasha DLH", "helpful": [0, 0], "reviewText": "Ahah, I love it. The case looks better than the amazon photo, and it feels really really neat.", "overall": 5.0, "summary": "Yesssssss!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A34KTJ4VWNBOHI", "asin": "B00LH1R6SK", "reviewerName": "Stina", "helpful": [0, 0], "reviewText": "As someone who owns an iPhone, I absolutely love this case. It has a brilliant color and stands out amongst all of the other cases out there. It works amazingly well to keep my phone protected. I am horrible about dropping my phone, but this case has helped to prevent it from getting damaged. I highly recommend this case to anyone looking to protect their phone and look amazing doing it.", "overall": 5.0, "summary": "Beautiful Color and Texture", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1Q1Z7IR79G52A", "asin": "B00LORXVUE", "reviewerName": "Ann Ingersoll Madison Rain \"Ann\"", "helpful": [0, 0], "reviewText": "What a high quality cable. Right out of the pack you can tell that this is not your cheap, replacement ipod/iphone cable.  This thing has substance! It also holds well while connected and doesn't fall out..I have had that problem with some aftermarket charging cables.  This is really one of the nicest cables I have every seen.  Great buy for sure!", "overall": 5.0, "summary": "Must have, high quality charging cable for ipad/ipod. Very nice!", "unixReviewTime": 1405987200, "reviewTime": "07 22, 2014"}
,{"reviewerID": "A388OX0ZF7OT8R", "asin": "B00LORXVUE", "reviewerName": "Chuck.C", "helpful": [0, 0], "reviewText": "This one actually works unlike some others I bought I get error msg saying this is unauthorized will not charge. This feels durable and not some flimsy garbage wire. The best part of this wire is, it is long enough for it to be plugged in and I can actually still use my phone while its charging since the wire is long enough.", "overall": 4.0, "summary": "Long Wire", "unixReviewTime": 1405728000, "reviewTime": "07 19, 2014"}
,{"reviewerID": "A2BLFCOPSMBOZ9", "asin": "B00LORXVUE", "reviewerName": "Dave Edmiston", "helpful": [0, 0], "reviewText": "I don't like the word \"hate\", so let's just say that there are two things that I *can't stand*.1)  I can't stand paying full price for an Apple Lightning cable.2)  I can't stand getting the message that this cable is not compatible with your device message.This cable is fantastic.  It is short, which I like.  (I don't need more than a couple of feet of cable coiled up on my desk.)  It charges well and doesn't give me the error.  Hooray!I like the black color of the cable and I like the nice substantial PVC coating.  This cable feels very sturdy and I'm confident that it won't fall apart like some of my other generic cables.  I suppose that with a name like Liger, how could you go wrong?  (Napoleon Dynamite would approve.)I was provided this item for review.", "overall": 5.0, "summary": "Awesome cable!", "unixReviewTime": 1405641600, "reviewTime": "07 18, 2014"}
,{"reviewerID": "A1YMNTFLNDYQ1F", "asin": "B00LORXVUE", "reviewerName": "eyeused2loveher", "helpful": [0, 0], "reviewText": "Works great just like my original one. I really need extras of these for the car and house so love this and the price!", "overall": 5.0, "summary": "This works just perfect!", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A15TX8B2L8B20S", "asin": "B00LORXVUE", "reviewerName": "Jon Davidson", "helpful": [0, 0], "reviewText": "Great product. Great packaging. High quality and apple certified. Works greats. This was a good replacement for my apple cable that is falling apart. I highly recommend this cable.", "overall": 5.0, "summary": "Great replacement cable. Apple certified", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A3JI7QRZO1QG8X", "asin": "B00LORXVUE", "reviewerName": "Joyce M. Davidson", "helpful": [0, 0], "reviewText": "This is a great cable, just as good as the more expensive Apple one. My husband and my daughter both lost their original cables for their iPhones and they went the cheap route, buying a cheap replacement cable, I believe it messed up their battery memory because coincidentally both of them have battery hold/charge issues but my son and I do not. I used this cable to charge my husbands phone and it charged it from 3% to 100% in about an hour, that's about how long it takes my phone to charge but with the cheap cable his takes 2-1/2 hours. I'm thrilled with the quality of this cable, I'm hoping now that we have &#34;quality&#34; cables again, maybe the battery memory will improve on their phones.  Great cable at a great price. I definitely recommend.", "overall": 5.0, "summary": "Real quality", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}
,{"reviewerID": "A1NHB2VC68YQNM", "asin": "B00LORXVUE", "reviewerName": "Nurse Farrugia", "helpful": [0, 0], "reviewText": "I really like it becasue it works well with my Life Proof case. I do not have to remove the case to charge my phone.", "overall": 5.0, "summary": "I really like it becasue it works well with my Life Proof ...", "unixReviewTime": 1405814400, "reviewTime": "07 20, 2014"}
,{"reviewerID": "A1AG6U022WHXBF", "asin": "B00LORXVUE", "reviewerName": "Trisha Crocker", "helpful": [0, 0], "reviewText": "product as described, I have wasted a lot of money on cords. I would buy them (usually on road trips) and then go to plug my phone in just to discover I have to work with cord and leave my phone sit while it was charging. This cord has not given me any issues, works just like my original!!", "overall": 5.0, "summary": "I have wasted a lot of money on cords", "unixReviewTime": 1405900800, "reviewTime": "07 21, 2014"}]
